[
    {
        "title": "Clinical Nursing Skills",
        "publish_date": "Jun 26, 2024",
        "last_update": "Jun 25, 2024",
        "authors": [
            "Christy Bowen, Chamberlain University",
            "Taranee Albert, Northwestern Medicine",
            "Mary Anne Bera",
            "Jessica Crockett, Baptist Health Care",
            "Lindsay L. Draper, University of North Carolina Greensboro",
            "Sandy Grimm, Nurse Educate",
            "Alissa Hershberger, University of Central Missouri",
            "Stephanie Hoffmann, Chamberlain University",
            "Czarina Hounsel, University of Texas at Arlington",
            "Lindsay Jusino, The University of West Florida",
            "Lori Kelly, Lipscomb University",
            "Heather Moore, Xavier University",
            "Amisha Parekh de Campos, University of Connecticut",
            "Margaret Riley, Nurse Educate",
            "Susan M. Rouse (Retired)",
            "Leigh A. Waldron, Western Governors University"
        ],
        "subjects": [
            "Nursing",
            "Fundamentals and Skills"
        ],
        "image": null,
        "description": "Clinical Nursing Skills is designed to equip nursing students with the practical knowledge and hands-on skills necessary to provide comprehensive patient care. The material emphasizes the application of clinical judgment in a variety of settings, ensuring that students are prepared to deliver high-quality care across different patient populations and clinical scenarios. The content utilizes concepts promoting the development of clinical judgment by building upon the systematic model developed by the National Council of State Boards of Nursing (NCSBN). Clinical Nursing Skills provides detailed instructions on basic procedures such as hygiene, mobility, vital signs assessment, medication administration, and wound care. It also guides students through more complex skills, including intravenous therapy, catheterization, tracheostomy care, and emergency interventions. By integrating the Clinical Judgment Measurement Model, the material helps students recognize, analyze, prioritize, create, act, and evaluate outcomes in various clinical situations, fostering critical thinking and clinical decision making. By studying Clinical Nursing Skills, students will gain the confidence and competence needed to perform essential nursing tasks, make informed clinical decisions, and provide compassionate, patient-centered care, which will prepare students for success in their clinical rotations and future professional practice.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-50-1",
        "source": "https://openstax.org/details/books/clinical-nursing-skills"
    },
    {
        "title": "Fundamentals of Nursing",
        "publish_date": "Sep 04, 2024",
        "last_update": "Aug 20, 2024",
        "authors": [
            "Christy Bowen, Chamberlain University",
            "Lindsay Draper, University of North Carolina at Greensboro",
            "Heather Moore, Xavier University"
        ],
        "subjects": [
            "Nursing",
            "Fundamentals and Skills"
        ],
        "image": null,
        "description": "Fundamentals of Nursing aligns with the outcomes and competencies of a nursing fundamentals course. It is designed to provide students with the foundational knowledge and practical expertise essential for delivering holistic and patient-centered care. The authors emphasize the application of clinical judgment across diverse healthcare environments, ensuring readiness to deliver high-quality, compassionate care in an inclusive and supportive manner. Composed of 43 chapters, Fundamentals of Nursing offers an in-depth exploration of the roles and responsibilities of the nursing profession, the healthcare environment, and the application of critical thinking and evidence-based practice. Fundamentals of Nursing features a variety of engaging and informative resources designed to prepare students for real-world clinical environments. By simulating patient interactions, students develop critical communication skills essential for effective nursing care. Insights from practicing nurses provide real-world perspectives, helping bridge the gap between theory and practice. The offering builds student confidence and competence through its focus on Quality and Safety Education for Nurses (QSEN), inclusion of robust unfolding case studies, and integration of NCLEX practice.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-41-9",
        "source": "https://openstax.org/details/books/fundamentals-nursing"
    },
    {
        "title": "Maternal-Newborn Nursing",
        "publish_date": "Jun 26, 2024",
        "last_update": "Jun 25, 2024",
        "authors": [
            "Amy Giles, Baylor University",
            "Regina Prusinski, Otterbein University",
            "Laura Wallace, Brenau University",
            "Leah Elliott, Bakersfield College",
            "Rachel Hill, California State University, Sacramento",
            "Debra Hrelic, University of North Carolina Wilmington",
            "Kelly LaMonica, Penn Medicine Princeton Health",
            "Emily Langley, Johns Hopkins All Children’s Hospital",
            "Rachael Mooney, Northwood Technical College",
            "JoAnn Peterson, University of Kansas",
            "Courtney Watson, Georgetown University",
            "Nicole Wheeler, Wayne State University"
        ],
        "subjects": [
            "Nursing",
            "Maternal-Newborn Nursing"
        ],
        "image": null,
        "description": "Maternal-Newborn Nursing introduces students to the concepts and skills related to pregnancy, birth, postpartum, newborn care, reproductive health, and social determinants related to those topics. Written and thoroughly reviewed by experienced nurse educators, the material focuses on patient safety, mental health, and inclusive care, and offers robust real-world scenarios and situational patient education experiences to apply concepts to practice. Maternal-Newborn Nursing builds on the students’ existing knowledge and skills and expands their learning to new concepts and considerations. Students will be able to implement the Clinical Judgement Measurement Model to recognize, analyze, prioritize, create, act on, and evaluate outcomes throughout the many conditions presented across the life stages. The offering integrates core frameworks such as QSEN, and its robust sets of practice questions, unfolding case studies, and additional resources support the Next Generation NCLEX.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-43-3",
        "source": "https://openstax.org/details/books/maternal-newborn-nursing"
    },
    {
        "title": "Medical-Surgical Nursing",
        "publish_date": "Oct 16, 2024",
        "last_update": "Sep 20, 2024",
        "authors": [
            "Christy Bowen, Chamberlain University",
            "Bridget Carey, Holy Family University",
            "Jessica Palozie, University of Connecticut",
            "Maren Reinholdt, University of Rochester School of Nursing"
        ],
        "subjects": [
            "Nursing",
            "Medical-Surgical Nursing"
        ],
        "image": null,
        "description": "Medical-Surgical Nursing is a comprehensive and engaging resource for nursing students, equipping them with the essential knowledge and skills required to provide high-quality care. Building on the foundational knowledge and skills acquired in previous nursing courses, this textbook expands students’ learning with concepts in medical-surgical nursing. The offering provides the background to ensure that nursing students are well-versed in both the science and art of nursing, capable of critical thinking, clinical judgment, and compassionate care. Medical-Surgical Nursing encompasses a broad range of patient-care situations, from managing chronic conditions to providing postoperative care. The material includes concise explanations to facilitate understanding, as well as rich reviews of pathophysiology, ensuring students grasp essential concepts without becoming overwhelmed. Beyond theoretical knowledge, the text emphasizes the development of practical skills and competencies, and incorporates evidence-based best practices into each of its 38 chapters.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-40-2",
        "source": "https://openstax.org/details/books/medical-surgical-nursing"
    },
    {
        "title": "Nutrition for Nurses",
        "publish_date": "Mar 20, 2024",
        "last_update": "May 15, 2024",
        "authors": [
            "Emerald Charity Bilbrew, Fayetteville Technical Community College",
            "Jody Vogelzang, Fairfield University",
            "Kelli Whittington, Southern Illinois University",
            "Amy B. Britt, Bon Secours Mercy Health",
            "Millie Hepburn, Sacred Heart University",
            "Lisa R. McDonald, Capella University",
            "Lee Anne Oliver, Beaufort County Community College",
            "Marygrace Piskorowski, SUNY at Buffalo",
            "Sharon R. Simon, Shenandoah University",
            "Miranda Smith, The University of Alabama in Huntsville",
            "Nicole M. Stephens, Galveston College",
            "Cynthia Wagner, University of North Georgia"
        ],
        "subjects": [
            "Nursing",
            "Nutrition and Pharmacology"
        ],
        "image": null,
        "description": "Nutrition for Nurses is structured to support the flexible integration of nutrition content across both system-based and nursing competency-based curricula. It can be used whether nutrition is taught as a standalone course or part of another nursing course. The table of contents for Nutrition for Nurses presents content in 20 chapters, organized into 9 thematic units. The text emphasizes evidence-based practice and holistic assessment to facilitate the integration of nutritional awareness for pre-licensure nursing students in the provision of client-centered care. Nutrition for Nurses helps students develop sound clinical judgment as well as a deep understanding of the impact of nutrition on body systems across the lifespan. Written and reviewed by highly experienced faculty, Nutrition for Nurses includes a detailed narrative, extensive features and learning resources, and ample student support. The presentation utilizes concepts promoting the development of clinical judgment by building upon the systematic model developed by the National Council of State Boards of Nursing (NCSBN).",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-38-9",
        "source": "https://openstax.org/details/books/nutrition"
    },
    {
        "title": "Pharmacology for Nurses",
        "publish_date": "May 29, 2024",
        "last_update": "May 15, 2024",
        "authors": [
            "Tina Barbour-Taylor, University of West Florida",
            "Leah Mueller (Sabato), Middle Tennessee State University",
            "Donna Paris, Texas Tech University Health Sciences Center School of Nursing",
            "Dorie Weaver, Francis Marion University",
            "Stacey Amick, Midlands Technical College",
            "Patty Bartzak, Lahey Hospital & Medical Center",
            "Amy B. Britt, Bon Secours Mercy Health",
            "Brenda Brown, Georgia Department of Public Health",
            "Jake Bush, University of West Florida",
            "Denise E. King, Dominican University",
            "Jennifer Richter, University of West Florida",
            "Marjorie G. Webb, Metropolitan State University",
            "Adam Wood, Nova Southeastern University"
        ],
        "subjects": [
            "Nursing",
            "Nutrition and Pharmacology"
        ],
        "image": null,
        "description": "Pharmacology for Nurses is intended for nursing students in an introductory program. It provides a fundamental understanding of the therapeutic use of drugs, so the nurse can provide safe and effective care to the client. Along with a discussion of each body system, the text also reviews the pathophysiology of various disease processes and medications used in treatment. The table of contents presents 40 chapter topics, organized into 11 units. The first unit, consisting of 3 chapters, provides a broad overview of pharmacology, with the following 10 units focused on specific body systems. Pharmacology for Nurses helps students prepare for the licensing exam and their careers by offering applicable, real-life content in short, manageable sections. The material focuses on common client conditions that nurses will encounter throughout their career and embraces a skills orientation (what does a nurse do). The text presents information in a holistic manner that ties the disease process to its pharmacological treatment. As a result, Pharmacology for Nurses will give students the confidence to safely administer medications to clients, as well as provide medication education to clients and their caregivers.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-37-2",
        "source": "https://openstax.org/details/books/pharmacology"
    },
    {
        "title": "Population Health for Nurses",
        "publish_date": "May 15, 2024",
        "last_update": "May 15, 2024",
        "authors": [
            "Jessica Ochs, Endicott College",
            "Sherry L. Roper, California State University, Stanislaus",
            "Susan M. Schwartz, Widener University",
            "Emily Berkowitz, Texas Woman’s University",
            "Paul Thomas Clements, Texas A & M University",
            "Donna S. Guerra, University of Alabama in Huntsville",
            "Linda A. Havey, Vermont State University",
            "Millie Hepburn, Sacred Heart University",
            "Jamie Hunsicker, Ohio Northern University",
            "Michael L. Jones, East Carolina University",
            "L. Michelle McClave, Morehead State University",
            "Heather Moore, Xavier University",
            "Brenna Morse, MGH Institute of Health Professions",
            "Amy M. Richards, Rogers State University",
            "Angelina Silko, Galen College of Nursing",
            "Susan Solecki, Drexel University"
        ],
        "subjects": [
            "Nursing",
            "Population and Community Health"
        ],
        "image": null,
        "description": "Population Health for Nurses prepares nurses to develop interventions, policies, and practices that promote health equity and improved health outcomes across the health care delivery continuum. The text emphasizes the social determinants of health and how nurses can plan and implement health promotion and disease prevention interventions. It takes a holistic perspective, connecting human health behavior to the dynamic, ongoing interactions of the person, social factors, and the physical environment in which people are born, live, learn, play, work, and age. OpenStax Population Health for Nurses uses a logical, thematic organization that breaks down content into manageable chunks. It presents the material in 35 chapters, organized into 7 thematic units. The text defines and distinguishes among the interrelated nursing areas of population health, public health, and community health nursing, providing both historical context and up-to-date research to help students make connections across content that can inform practice. The result is a holistic approach that applies theoretical concepts to the practical assessment, diagnosis, planning, implementation, and evaluation steps of client care and community-tailored interventions.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-39-6",
        "source": "https://openstax.org/details/books/population-health"
    },
    {
        "title": "Psychiatric-Mental Health Nursing",
        "publish_date": "Jun 12, 2024",
        "last_update": "Jun 25, 2024",
        "authors": [
            "Rebecca Puchkors, Baylor University",
            "Jeanne Saunders, Daytona State College",
            "David Sharp, Mississippi College",
            "Lenore Cortez, Angelo State University",
            "Celeste Dunnington, Shorter University",
            "Victoria Haynes, University of North Dakota School of Medicine and Health Sciences",
            "Kimberly Johnson, Baylor College of Medicine",
            "Laura Logan, Austin State University, DeWitt School of Nursing",
            "Stacy Mikel, Jacksonville State University",
            "Lynn Rew, The University of Texas at Austin",
            "Leigh Waldron, Western Governors University",
            "Pamela Herbig Wall, Rosalind Franklin University"
        ],
        "subjects": [
            "Nursing",
            "Psychiatric-Mental Health Nursing"
        ],
        "image": null,
        "description": "Psychiatric-Mental Health Nursing is designed to support a one-semester psychiatric-mental health nursing course offered at both two-year and four-year institutions. Serving students specializing in psychiatric nursing and those from other health disciplines, this learning resource integrates evidence-based practices with practical strategies for communication, readying students to build therapeutic relationships with patients and caregivers. Psychiatric-Mental Health Nursing uses a logical, thematic organization that breaks content down into manageable sections. Each unit is designed to foster a deep understanding of the biological, psychological, and social dimensions of mental health. The content helps students make meaningful connections between various psychiatric conditions and the corresponding nursing approaches. By focusing on tailored psychiatric interventions and emphasizing patient-centered approaches, Psychiatric-Mental Health Nursing equips students with the knowledge and skills necessary to navigate diverse mental health settings.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-42-6",
        "source": "https://openstax.org/details/books/psychiatric-mental-health"
    }
]