[
    {
        "title": "Introduction to Philosophy",
        "publish_date": "Jun 15, 2022",
        "last_update": "Mar 01, 2024",
        "authors": [
            "Nathan Smith, Houston Community College",
            "Gregory Browne, Eastern Michigan University",
            "Parish Conkling, Houston Community College",
            "Naomi Friedman, University of North Carolina, Asheville",
            "Allison Fritz, Chadron State College",
            "Daniel Garro, Rider University",
            "Jeremy Gallegos, Friends University",
            "Jon Gill, Gustavus Adolphus College",
            "Gayle Horton, Santa Fe College",
            "Maryellen Lo Bosco, Suffolk Community College",
            "Rebecca A. Longtin, State University of New York, New Paltz",
            "Corey McCall, The Cornell Prison Education Program",
            "Kurt Stuke, New England College"
        ],
        "subjects": [
            "Humanities",
            "Philosophy"
        ],
        "image": null,
        "description": "Designed to meet the scope and sequence of your course, Introduction to Philosophy surveys logic, metaphysics, epistemology, theories of value, and history of philosophy thematically. To provide a strong foundation in global philosophical discourse, diverse primary sources and examples are central to the design, and the text emphasizes engaged reading, critical thinking, research, and analytical skill-building through guided activities.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-59-6",
        "source": "https://openstax.org/details/books/introduction-philosophy"
    },
    {
        "title": "U.S. History",
        "publish_date": "Dec 30, 2014",
        "last_update": "Sep 19, 2024",
        "authors": [
            "P. Scott Corbett, Ventura College",
            "Volker Janssen, California State University, Fullerton",
            "John M. Lund, Keene State College",
            "Todd Pfannestiel, Clarion University",
            "Sylvie Waskiewicz",
            "Paul Vickery, Oral Roberts University"
        ],
        "subjects": [
            "Humanities",
            "U.S. History"
        ],
        "image": null,
        "description": "U.S. History is designed to meet the scope and sequence requirements of most introductory courses. The text provides a balanced approach to U.S. history, considering the people, events, and ideas that have shaped the United States from both the top down (politics, economics, diplomacy) and bottom up (eyewitness accounts, lived experience). U.S. History covers key forces that form the American experience, with particular attention to issues of race, class, and gender.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-947172-08-1",
        "source": "https://openstax.org/details/books/us-history"
    },
    {
        "title": "World History, Volume 1: to 1500",
        "publish_date": "Apr 19, 2023",
        "last_update": "Jul 03, 2024",
        "authors": [
            "Ann Kordas, Johnson & Wales University",
            "Ryan J. Lynch, Columbus State University",
            "Brooke Nelson, formerly California State University",
            "Julie Tatlock, Mount Mary University",
            "Chris Bingley, UCLA",
            "Celeste Chamberland, Roosevelt University",
            "Scott Corbett, Ventura College",
            "Rick Gianni, Grand Canyon University",
            "Jennifer Lawrence, Tarrant County College",
            "Jamie McCandless, Kennesaw State University",
            "Cristina Mehrtens, University of Massachusetts Dartmouth",
            "Anthony Miller, Hanover College",
            "Abigail Owen, Carnegie Mellon University",
            "David Price, Santa Fe College",
            "Kim Richardson, University of South Carolina Lancaster",
            "Christopher S Rose, Our Lady of the Lake University",
            "Joseph Snyder, Southeast Missouri State University",
            "Christopher Thrasher, National Park College",
            "David Toye, Northeast State Community College",
            "Alexander Wathen, University of Houston-Downtown",
            "Grace Hunt Watkinson, Kennesaw State University",
            "Joel Webb, Auburn University"
        ],
        "subjects": [
            "Humanities",
            "World History"
        ],
        "image": null,
        "description": "World History, Volume 1: to 1500 is designed to meet the scope and sequence of a world history course to 1500 offered at both two-year and four-year institutions. Suitable for both majors and non majors World History, Volume 1: to 1500 introduces students to a global perspective of history couched in an engaging narrative. Concepts and assessments help students think critically about the issues they encounter so they can broaden their perspective of global history. A special effort has been made to introduce and juxtapose people’s experiences of history for a rich and nuanced discussion. Primary source material represents the cultures being discussed from a firsthand perspective whenever possible. World History, Volume 1: to 1500 also includes the work of diverse and underrepresented scholars to ensure a full range of perspectives.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-67-1",
        "source": "https://openstax.org/details/books/world-history-volume-1"
    },
    {
        "title": "World History, Volume 2: from 1400",
        "publish_date": "Dec 14, 2022",
        "last_update": "Jul 03, 2024",
        "authors": [
            "Ann Kordas, Johnson & Wales University",
            "Ryan J. Lynch, Columbus State University",
            "Brooke Nelson, formerly California State University",
            "Julie Tatlock, Mount Mary University",
            "Chris Bingley, UCLA",
            "Celeste Chamberland, Roosevelt University",
            "Scott Corbett, Ventura College",
            "Rick Gianni, Grand Canyon University",
            "Jennifer Lawrence, Tarrant County College",
            "Jamie McCandless, Kennesaw State University",
            "Cristina Mehrtens, University of Massachusetts Dartmouth",
            "Anthony Miller, Hanover College",
            "Abigail Owen, Carnegie Mellon University",
            "David Price, Santa Fe College",
            "Kim Richardson, University of South Carolina Lancaster",
            "Christopher S Rose, Our Lady of the Lake University",
            "Joseph Snyder, Southeast Missouri State University",
            "Christopher Thrasher, National Park College",
            "David Toye, Northeast State Community College",
            "Alexander Wathen, University of Houston-Downtown",
            "Grace Hunt Watkinson, Kennesaw State University",
            "Joel Webb, Auburn University"
        ],
        "subjects": [
            "Humanities",
            "World History"
        ],
        "image": null,
        "description": "World History, Volume 2: from 1400 is designed to meet the scope and sequence of a world history course from 1400 offered at both two-year and four-year institutions. Suitable for both majors and non majors World History, Volume 2: from 1400 introduces students to a global perspective of history couched in an engaging narrative. Concepts and assessments help students think critically about the issues they encounter so they can broaden their perspective of global history. A special effort has been made to introduce and juxtapose people’s experiences of history for a rich and nuanced discussion. Primary source material represents the cultures being discussed from a firsthand perspective whenever possible. World History, Volume 2: from 1400 also includes the work of diverse and underrepresented scholars to ensure a full range of perspectives.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-62-6",
        "source": "https://openstax.org/details/books/world-history-volume-2"
    },
    {
        "title": "Writing Guide with Handbook",
        "publish_date": "Dec 21, 2021",
        "last_update": "Dec 19, 2023",
        "authors": [
            "Michelle Bachelor Robinson, Spelman College",
            "Maria Jerskey, City University of New York",
            "featuring Toby Fulwiler, Emeritus, University of Vermont",
            "Michelle Baker, Principal, Conservation Writing Pro",
            "Mark Bernheim, Emeritus, Miami University",
            "Sheila Carter-Tod, University of Denver",
            "Brian Flynn, Midlands Technical College",
            "Victoria Friedrich, Writer and Curriculum Designer",
            "William Gary, Henderson Community College",
            "Carol Hollar-Zwick, Writer and Curriculum Designer",
            "Craig A. Meyer, Jackson State University",
            "Cynthia Mwenja, University of Montevallo",
            "Susie Thurman, retired from Henderson Community College"
        ],
        "subjects": [
            "Humanities",
            "Writing Guide with Handbook"
        ],
        "image": null,
        "description": "Writing Guide with Handbook aligns to the goals, topics, and objectives of many first-year writing and composition courses. It is organized according to relevant genres, and focuses on the writing process, effective writing practices or strategies—including graphic organizers, writing frames, and word banks to support visual learning—and conventions of usage and style. The text includes an editing and documentation handbook, which provides information on grammar and mechanics, common usage errors, and citation styles. Writing Guide with Handbook breaks down barriers in the field of composition by offering an inviting and inclusive approach to students of all intersectional identities. To meet this goal, the text creates a reciprocal relationship between everyday rhetoric and the evolving world of academia. Writing Guide with Handbook builds on students’ life experiences and their participation in rhetorical communities within the familiar contexts of personal interaction and social media. The text seeks to extend these existing skills by showing students how to construct a variety of compelling compositions in a variety of formats, situations, and contexts. The authors conceived and developed Writing Guide with Handbook in 2020; its content and learning experiences reflect the instructional, societal, and individual challenges students have faced. The authors invite students and instructors to practice invitational discussions even as they engage in verbal and written argument. Instructors will be empowered to emphasize meaning and voice and to teach empathy as a rhetorical strategy. Students will be empowered to negotiate their identities and their cultures through language as they join us in writing, discovering, learning, and creating. If you have encountered a white screen while accessing your OpenStax textbook, our developers suggest closing all of your OpenStax.org tabs and then loading the book again.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-47-3",
        "source": "https://openstax.org/details/books/writing-guide"
    }
]