[
    {
        "title": "Think Data Structures: Algorithms and Information Retrieval in Java",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Allen B. Downey"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTUyLCJwdXIiOiJibG9iX2lkIn19--af79af919a1e52a35fa44e082319c359c3da301d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ThiDatStr.png",
        "description": "Data structures and algorithms are among the most important inventions of the last 50 years, and they are fundamental tools software engineers need to know. But in my opinion, most of the books on these topics are too theoretical, too big, and too bottom-up:Too theoretical: Mathematical analysis of algorithms is based on simplifying assumptions that limit its usefulness in practice. Many presentations of this topic gloss over the simplifications and focus on the math. In this book I present the most practical subset of this material and eliminate the rest.Too big: Most books on these topics are at least 500 pages, and some are more than 1000. By focusing on the topics I think are most useful for software engineers, I kept this book under 250 pages.Too bottom-up: Many data structures books focus on how data structures work (the implementations), with less about how to use them (the interfaces). In this book, I go “top down”, starting with the interfaces. Readers learn to use the structures in the Java Collections Framework before getting into the details of how they work.Finally, many present this material out of context and without motivation: it’s just one damn data structure after another!I try to alleviate the boredom by organizing the topics around an application—web search—that uses data structures extensively, and is an interesting and important topic in its own right.This application also motivates some topics that are not usually covered in an introductory data structures class, including persistent data structures, with Redis, and streaming algorithms.This book also presents basic aspects of software engineering practice, including version control and unit testing. Each chapter ends with an exercise that allows readers to apply what they have learned. Each exercise includes automated tests that check the solution. And for most exercises, I present my solution at the beginning of the next chapter.This book is intended for college students in computer science and related fields, as well as professional software engineers, people training in software engineering, and people preparing for technical interviews.I assume that the reader knows Java at an intermediate level, but I explain some Java features along the way, and provide pointers to supplementary material.People who have readThink JavaorHead First Javaare prepared for this book.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-data-structures-algorithms-and-information-retrieval-in-java"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Bulgarian) - Version 2.1.58-28-g132fc121,",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYwNiwicHVyIjoiYmxvYl9pZCJ9fQ==--91ad53445fee969e62cbe1e90b5c201c35cd6d09/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Bulgarian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-2014"
    },
    {
        "title": "The Shallow and the Deep: A biased introduction to neural networks and old school machine learning",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Michael Biehl, University of Groningen"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAwNzcsInB1ciI6ImJsb2JfaWQifX0=--d12a918868e594d582f6d091f5f991ec0c6cc74c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_130_126_coverImage_en_US_t.jpg",
        "description": "The Shallow and the Deepis a collection of lecture notes that offers an accessible introduction to neural networks and machine learning in general. However, it was clear from the beginning that these notes would not be able to cover this rapidly changing and growing field in its entirety. The focus lies on classical machine learning techniques, with a bias towards classification and regression. Other learning paradigms and many recent developments in, for instance, Deep Learning are not addressed or only briefly touched upon.Biehl argues that having a solid knowledge of the foundations of the field is essential, especially for anyone who wants to explore the world of machine learning with an ambition that goes beyond the application of some software package to some data set. Therefore, The Shallow and the Deep places emphasis on fundamental concepts and theoretical background. This also involves delving into the history and pre-history of neural networks, where the foundations for most of the recent developments were laid. These notes aim to demystify machine learning and neural networks  without losing the appreciation for their impressive power and versatility.",
        "publisher": "University of Groningen Press",
        "language": "English",
        "isbn13": "9789403430270",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-shallow-and-the-deep-a-biased-introduction-to-neural-networks-and-old-school-machine-learning"
    },
    {
        "title": "Think Bayes: Bayesian Statistics Made Simple",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Allen B. Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjI5LCJwdXIiOiJibG9iX2lkIn19--e348f188f8d45caa76d6e62fe9baa49df41d7704/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781449370787.png",
        "description": "Think Bayesis an introduction to Bayesian statistics using computational methods.The premise of this book, and the other books in the Think X series, is that if you know how to program, you can use that skill to learn other topics.Most books on Bayesian statistics use mathematical notation and present ideas in terms of mathematical concepts like calculus. This book uses Python code instead of math, and discrete approximations instead of continuous mathematics. As a result, what would be an integral in a math book becomes a summation, and most operations on probability distributions are simple loops.I think this presentation is easier to understand, at least for people with programming skills. It is also more general, because when we make modeling decisions, we can choose the most appropriate model without worrying too much about whether the model lends itself to conventional analysis. Also, it provides a smooth development path from simple examples to real-world problems.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": "9781449370787",
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-bayes-bayesian-statistics-made-simple"
    },
    {
        "title": "A Tale of Two Systems",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "René Reitsma, Oregon State University",
            "Kevin Krueger, Oregon State University"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTExMSwicHVyIjoiYmxvYl9pZCJ9fQ==--3cc6334b8a7f653584361437a830a89639e152d0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/taleOfTwoSys.jpg",
        "description": "This is the story of a web-based information system rebuild. The system in question is www.teachengineering.org, a digital library of K-12 engineering curriculum that was built from the ground up with established technology and which for 13 years enjoyed lasting support from its growing user community and its sponsors. These 13 years, however, cover the period during which smart phones and tablets became commonplace, during which the Internet of Things started replacing the Semantic Web, during which NoSQL databases made their way out of the research labs and into everyday development shops, during which we collectively started moving IT functions and services into ‘the cloud,’ and during which computing performance doubled a few times, yet again. During this same period, TeachEngineering’s user base grew from a few hundred to more than 3 million users annually, its collection size quadrupled, it went through several user interface renewals, and significant functionality was added while having an exemplary service record, and it enjoyed continued financial support from its sponsors.In this monograph we provide a side-by-side of this rebuild. We lay out the choices made in the old architecture —we refer to it asTE 1.0— and compare and contrast them with the choices made forTE2.0. We explain why both the 1.0 and 2.0 choices were made and discuss the advantages and disadvantages associated with them.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-tale-of-two-systems-reitsma"
    },
    {
        "title": "An Introduction to Computer Networks - Second Edition",
        "copyright_year": "2014",
        "last_update": "2020",
        "authors": [
            "Peter Lars Dordal, Loyola University of Chicago"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTM3MiwicHVyIjoiYmxvYl9pZCJ9fQ==--1739d769953632a8829a284acea2ee5e2b70a70e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/cover.png",
        "description": "An Introduction to Computer Networksis a free and open general-purpose computer-networking textbook, complete with diagrams and exercises.It covers the LAN, internetworking and transport layers, focusing primarily on TCP/IP. Particular attention is paid to congestion; other special topics include queuing, real-time traffic, network management, security and the ns simulator.The book is suitable as the primary text for an undergraduate or introductory graduate course in computer networking, as a supplemental text for a wide variety of network-related courses, and as a reference work.",
        "publisher": "Peter L Dordal",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-introduction-to-computer-networks"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Azerbaijani) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxOCwicHVyIjoiYmxvYl9pZCJ9fQ==--08e1be2a891907824a03124a54e2cdf0bf6f3a7a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Azerbaijani",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-azerbaijani"
    },
    {
        "title": "Algorithms and Data Structures With Applications to Graphics and Geometry",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Jurg Nievergelt, ETH Zurich",
            "Klaus Hinrichs, University of Muenster"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI4LCJwdXIiOiJibG9iX2lkIn19--65e52defbc450ae4a042b4527b2bcd3746a87021/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000AlgoDataS.png",
        "description": "An introductory coverage of algorithms and data structures with application to graphics and geometry.",
        "publisher": "Global Text Project",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/algorithms-and-data-structures-with-applications-to-graphics-and-geometry"
    },
    {
        "title": "Aprendizaje Colaborativo Apoyado por Computador",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "César Collazos, Universidad del Cauca",
            "Jaime Muñoz",
            "Yosly Hernández"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQ1LCJwdXIiOiJibG9iX2lkIn19--b970f3c292a1e596cc35a1c97b9e24d7249661b2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000AprColApo.png",
        "description": "Comunidad creada para compartir experiencias en torno al uso de Tecnologías de la Información como apoyo a procesos de enseñanza-aprendizaje usando modelos de aprendizaje colaborativo",
        "publisher": "LATIn Project",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/aprendizaje-colaborativo-apoyado-por-computador"
    },
    {
        "title": "Programming Fundamentals - A Modular Structured Approach using C++",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "Kenneth Leroy Busbee, Houston Community College"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI2LCJwdXIiOiJibG9iX2lkIn19--e1adc02bd796410f8f72ede702898794c0da2506/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ProgFundC.png",
        "description": "Programming Fundamentals - A Modular Structured Approach using C++is written by Kenneth Leroy Busbee, a faculty member at Houston Community College in Houston, Texas. The materials used in this textbook/collection were developed by the author and others as independent modules for publication within the Connexions environment. Programming fundamentals are often divided into three college courses: Modular/Structured, Object Oriented and Data Structures. This textbook/collection covers the first of those three courses.The learning modules of this textbook/collection were written as standalone modules. Students using a collection of modules as a textbook will usually view it contents by reading the modules sequentially as presented by the author of the collection.The learning modules of this textbook/collection were, for the most part, written without consideration of a speci??c programming language. In many cases the C++ language is discussed as part of the explanation of the concept. Often the examples used for C++ are exactly the same for the Java programming language. However, some modules were written speci??cally for the C++ programming language. This could not beavoided as the C++ language is used in conjunction with this textbook/collection by the author in teaching college courses.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/programming-fundamentals-a-modular-structured-approach-using-c"
    },
    {
        "title": "Think Python: How to Think Like a Computer Scientist - 2e",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Allen B. Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzQsInB1ciI6ImJsb2JfaWQifX0=--18824d2afd2485e56cb1f44a3bcba6c49ab9d7a7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781491939369.png",
        "description": "Think Pythonis a concise introduction to software design using the Python programming language. Intended for people with no programming experience, this book starts with the most basic concepts and gradually adds new material. Some of the ideas students find most challenging, like recursion and object-oriented programming, are divided into a sequence of smaller steps and introduced over the course of several chapters.This textbook has been used in classes at Bard College, Olin College of Engineering, University of California, Santa Barbara, University of Maine, University of Northern Colorado.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": "9781491939369",
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-python-how-to-think-like-a-computer-scientist"
    },
    {
        "title": "Inteligencia Artificial",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Julio Ponce, Universidad Autonoma de Aguascalientes",
            "Aurora Torres Soto",
            "Fátima Sayuri Quezada"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQxLCJwdXIiOiJibG9iX2lkIn19--eaae83df93bbe780adb51a9d5847eaebd51efb86/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntelArti.png",
        "description": "Este libro es una introducción al area de la Inteligencia Artificial y presenta algunas de las aplicaciones que puede tener en la vida real en diversos campos de aplicación, El libro esta compuesto de ocho capítulos los cuales abarcan los antededentes, algunos conceptos importantes para la resolución de problemas como es la representación de conocimiento, el planteamiento de los problemas. Asimismo se menciona la teoría de agentes por un lado y por otro lo que es el aprendizaje computacional. Otra area que se aborta es la computación evolutivo y los algoritmos bioinspirados para la resolución de problemas, dandole enfasis a los problemas de optimizacion. Por ultimo se menciona una nueva tendencia en el area de las ciencias computacionales como es el uso de las GPUs para trabajar de una manera mas rapida al realizar el procesamiento en paralelo.",
        "publisher": "LATIn Project",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/inteligencia-artificial"
    },
    {
        "title": "Java with BlueJ Part 2",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Ron McFadyen, University of Winnipeg"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzcwLCJwdXIiOiJibG9iX2lkIn19--12e5784ab05de6c1076e3c9004c8a09a337f564f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000JavWitBl2.png",
        "description": "This book is Part II of a two-part set that introduces the Java programming language. The text assumes the student will be using the BlueJ development environment and provides some introductory BlueJ material. Our experience has been that BlueJ is easy to learn and provides a good programming environment for the beginner programmer.",
        "publisher": "Ron McFadyen",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/java-with-bluej-part-2"
    },
    {
        "title": "Programación Web del Frontend al Backend",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Ricardo Javier Celí Párraga, Esmeraldas, Ecuador",
            "Miguel Fabricio Boné Andrade, Esmeraldas, Ecuador",
            "Aldo Patricio Mora Olivero, Esmeraldas, Ecuador"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDY2NiwicHVyIjoiYmxvYl9pZCJ9fQ==--1acef9f7f8c359f061057b3436c76796e6af210c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_18_18_coverImage_es_ES.jpg",
        "description": "En este libro se investigó los fundamentos de la programación web, así como las tecnologías esenciales para lograr crear aplicaciones web, tales como HTML y CSS. Se documentó los conceptos básicos de la programación Frontend utilizando el lenguaje de programación JavaScript, se documentó también los conceptos de la programación Backend utilizando el lenguaje de programación PHP. Este libro tiene como objetivo involucrarse en la programación web iniciando con el estudio del Frontend hasta el Backend con los conceptos básicos, códigos y ejemplos, utilizando tecnologías de programación gratuitas accesibles para cualquier estudiante, para llegar a crear aplicaciones dinámicas con acceso a base de datos. Como resultado se obtuvo que se puede llegar a crear aplicaciones web complejas utilizando tecnologías actuales gratuitas, con un diseño agradable, diseñándolo fácilmente con un Framework CSS como Bootstrap, y utilizando JQuery como una librería para crear rápidamente aplicaciones con JavaScript. Se utilizó además PHP por ser uno de los lenguajes más utilizados para crear aplicaciones conectadas a bases de datos MySQL.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942701459",
        "source": "https://open.umn.edu/opentextbooks/textbooks/programacion-web-del-frontend-al-backend"
    },
    {
        "title": "Artificial Intelligence and Librarianship - 3rd Edition",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Martin Frické, The University of Arizona"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI1MTMsInB1ciI6ImJsb2JfaWQifX0=--d5309484ca7d7ef3fa5bf4f99e355bebfb6cd2b8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/AICoverPeale3.jpg",
        "description": "Courses on Artificial Intelligence (AI) and Librarianship in ALA-accredited Masters of Library and Information (MLIS) degrees are rare. We have all been surprised by ChatGPT and similar Large Language Models. Generative AI is an important new area for librarianship. It is also developing so rapidly that no one can really keep up. Those trying to produce AI courses for the MLIS degree need all the help they can get. This book is a gesture of support. It consists of about 100,000 words on the topic, with a 4-500 item bibliography.The third edition has changes and additions. These include:a new Chapter 6 on evaluation and the futurenew materials in Chapter 5 on current large language and multimodal modelsscattered revisions, corrections, and updates.",
        "publisher": "SoftOption",
        "language": "English",
        "isbn13": "9780473722944",
        "source": "https://open.umn.edu/opentextbooks/textbooks/artificial-intelligence-and-librarianship"
    },
    {
        "title": "The Little Book of Semaphores",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Allen B. Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjksInB1ciI6ImJsb2JfaWQifX0=--a001fcd2fe9f37c3154f5f756fab54063eb1ae3a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Faux02.png",
        "description": "The Little Book of Semaphoresis a free (in both senses of the word) textbook that introduces the principles of synchronization for concurrent programming.In most computer science curricula, synchronization is a module in an Operating Systems class. OS textbooks present a standard set of problems with a standard set of solutions, but most students don't get a good understanding of the material or the ability to solve similar problems.The approach of this book is to identify patterns that are useful for a variety of synchronization problems and then show how they can be assembled into solutions. After each problem, the book offers a hint before showing a solution, giving students a better chance of discovering solutions on their own.The book covers the classical problems, including 'Readers-writers,' 'Producer-consumer', and 'Dining Philosophers.' In addition, it collects a number of not-so-classical problems, some written by the author and some by other teachers and textbook writers. Readers are invited to create and submit new problems.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-little-book-of-semaphores"
    },
    {
        "title": "Agent-Based Evolutionary Game Dynamics",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Luis R. Izquierdo, University of Burgos",
            "Segismundo S. Izquierdo, University of Valladolid",
            "William H. Sandholm, University of Wisconsin-Madison"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjI5LCJwdXIiOiJibG9iX2lkIn19--ae2621b3e4b59522af398040415fe6f7dcd89351/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000AgeEvoGam.jpg",
        "description": "This book is a guide to implement and analyze simple agent-based evolutionary models using NetLogo.All the models we implement are agent-based, i.e. individual agents and their interactions are explicitly represented in the models. To formalise agents’ interactions we use the basic framework of Evolutionary Game Theory.NetLogo is a multi-agent programmable modeling environment used by hundreds of thousands of students, teachers and researchers all around the globe. No coding experience is necessary to fully understand the contents of this book.",
        "publisher": "University of Wisconsin - Madison",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/agent-based-evolutionary-game-dynamics"
    },
    {
        "title": "Foundations of Computation",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Carol Critchlow, Hobart and William Smith Colleges",
            "David Eck, Hobart and William Smith Colleges"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTM4LCJwdXIiOiJibG9iX2lkIn19--3fcc601571a044e49e7d905c14b7c3d7af31ee09/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000FounCompu.png",
        "description": "Foundations of Computationis a free textbook for a one-semester course in theoretical computer science. It has been used for several years in a course at Hobart and William Smith Colleges. The course has no prerequisites other than introductory computer programming. The first half of the course covers material on logic, sets, and functions that would often be taught in a course in discrete mathematics. The second part covers material on automata, formal languages, and grammar that would ordinarily be encountered in an upper level course in theoretical computer science.",
        "publisher": "Carol Crichlow and David Eck",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/foundations-of-computation"
    },
    {
        "title": "Building User Interfaces for Modern Web Applications: React Programming",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Cheer-Sun Yang, West Chester University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE2ODEsInB1ciI6ImJsb2JfaWQifX0=--0dab005f64582dc7f14338ecf4e786faaf52adee/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Yang_BuildingUserInterfaces-767x1024.png",
        "description": "Since Facebook released React as an open-source software library for front-end programming in 2013, React has gain popularity quickly. Although there are other frameworks or libraries, React is considered a programmer-friendly JavaScript library using the functional programming approach for the front-end web application development. Teaching and learning React can provide training in Functional Programming, Software Engineering Principles, and the Event-Driven Programming Paradigm. The ultimate goal of this eTextbook is to provide a timely support for teaching the state-of-the-art technology as the React ecosystem evolves.In this eTextbook, the prerequisite concepts about HTML/CSS, JavaScript, and Bootstrap/React-Bootstrap are introduced first, followed by the main React language features. Finally, the Software Engineering Principles are introduced from the design, development, to debugging and maintenance. The main objectives are threefold: (1) provide concepts about JavaScript Programming, (2) introduce the concepts of modularity, functional programming, and (3) teach the concept of reusable User Interface (UI) as the front-end of modern model-view-controller (MVC) web applications.Although learning other technologies in the React ecosystem is imminent, it is the hope that this book paves the groundwork for the future learning and growing in the field of modern UI development.",
        "publisher": "The Pennsylvania Alliance for Design of Open Textbooks (PA-ADOPT)",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-user-interfaces-for-modern-web-applications-react-programming"
    },
    {
        "title": "Eloquent JavaScript: A Modern Introduction to Programming",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Marijn Haverbeke"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTkwLCJwdXIiOiJibG9iX2lkIn19--807840095ab9f279aae1a0763b836372bf5c86c4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781593275846.jpg",
        "description": "JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications.This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track.",
        "publisher": "No Starch Press",
        "language": "English",
        "isbn13": "9781593275846",
        "source": "https://open.umn.edu/opentextbooks/textbooks/eloquent-javascript-a-modern-introduction-to-programming"
    },
    {
        "title": "The Joy of Cryptography",
        "copyright_year": "2017",
        "last_update": "2021",
        "authors": [
            "Mike Rosulek, Oregon State University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMwMiwicHVyIjoiYmxvYl9pZCJ9fQ==--511dc08d58210065e7ce9ad88caa030a53ae9e24/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/joycrypto.png",
        "description": "The pedagogical approach is anchored in formal definitions/proof of security, but in a way that I believe is more accessible than what is 'traditional' in crypto. All security definitions are written in a unified and simplified 'game-based' style. For an example of what security definitions look like in this style, see the index of security definitions (which will make more sense after reading chapters 2 & 4).",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-joy-of-cryptography"
    },
    {
        "title": "Introduction to Autonomous Robots",
        "copyright_year": "2016",
        "last_update": "2020",
        "authors": [
            "Nikolaus Correll, University of Colorado at Boulder"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjU2LCJwdXIiOiJibG9iX2lkIn19--ba2d9dec3174a8f833dd9bd037d88ce46b61461b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781493773077.png",
        "description": "This book introduces concepts in mobile, autonomous robotics to 3rd-4th year students in Computer Science or a related discipline. The book covers principles of robot motion, forward and inverse kinematics of robotic arms and simple wheeled platforms, perception, error propagation, localization and simultaneous localization and mapping. The cover picture shows a wind-up toy that is smart enough to not fall off a table just using intelligent mechanism design and illustrate the importance of the mechanism in designing intelligent, autonomous systems. This book is open source, open to contributions, and released under a creative common license.",
        "publisher": "Nikolaus Correll",
        "language": "English",
        "isbn13": "9780692700877",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-autonomous-robots"
    },
    {
        "title": "Mastering Enterprise Networks",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Mathew J. Heath Van Horn, Embry-Riddle Aeronautical University"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIxMDMsInB1ciI6ImJsb2JfaWQifX0=--00bca8e9586513e3cc0d270711f0bdc8924cb392/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/1-and-0-fighting-350x400.jpg",
        "description": "Mastering Enterprise Networks, is a comprehensive guide to building, defending, and attacking enterprise networks. It covers a wide range of topics, from network fundamentals to advanced security concepts. The book is well-organized and easy to follow, making it a valuable resource for both beginners and experienced network professionals.One of the strengths of this book is its focus on hands-on learning. The book includes 50 chapters of labs that allow readers to practice the concepts they have learned. These labs are a great way to reinforce your understanding of enterprise networks while developing practical skills.",
        "publisher": "Embry-Riddle Aeronautical University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/mastering-enterprise-networks"
    },
    {
        "title": "Understanding Document Accessibility",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "The Chang School Digital Education Strategies"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTM0MiwicHVyIjoiYmxvYl9pZCJ9fQ==--7af1f17029e70cd6dce8c5351674e41043549cf7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/unddocacc.png",
        "description": "With much of the world gone digital, learning to create documents that are accessible to everyone is becoming a necessary skill. Intended for a general audience, this free resource reviews a wide range of document authoring applications, including the tools they contain for creating accessible documents, and tests them to ensure they do not contain potential barriers. Learn how to create accessible word processed documents, spreadsheets, presentation slides, and PDF documents, among others, so they are accessible to everyone.",
        "publisher": "Ryerson University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/understanding-document-accessibility"
    },
    {
        "title": "Earth, Space, and Environmental Science Explorations with ArcGIS Pro - Second Edition",
        "copyright_year": null,
        "last_update": null,
        "authors": [
            "Wing Cheung, San Marcos, CA"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQzNywicHVyIjoiYmxvYl9pZCJ9fQ==--20149257be20422f6eb38483f30ae3b3faa846c2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-01-09%20at%209.38.47%20AM.png",
        "description": "When I first started teaching Geographic Information Systems (GIS) over 15 years ago, there were only a handful of GIS tutorial books on the market. While a few of them focused on a particular theme, many of them were mainly technical publications with no unifying theme. These publications are perfect for teaching new users about basic GIS operations and continue to be invaluable to many users today. However, these publications consisted of tutorials focusing on vastly different real-world scenarios, and felt a little disjointed to integrate into a class that focuses on a specific field (e.g. Environmental Science, Geography, Urban Planning). Since then, I am happy to see that there has been a proliferation of publications that are not only focused on introducing the technology, but also provide an introduction to a specific field as well as GIS.It is with this consideration in mind that I wrote this book to not only introduce students to the tools in ArcGIS Pro, but also to provide a glimpse into some of the topics that may be covered in an introductory course in Geography, Environmental Science, or related disciplines. I aimed to achieve a balance of technical instruction and information about Earth, Space, and Environmental Sciences, to make this publication helpful for new GIS learners, as well as students who may be interested in learning about the applications of GIS in the Earth, Space, and Environmental Sciences.Before you begin with the book, please download and unzip the data for the book athttps://tinyurl.com/ESESGIS. Each chapter will begin with a list of the technical objectives for the lab exercise, which is particularly useful to refer to should you need a refresher on how to perform a particular task at a later date. The list of technical objectives is followed by a short introduction that provides the context for the exercise. Subsequently, you will find the step-by-step directions for the exercises with questions embedded throughout (in yellow highlight) to ensure that you are on the right track. To obtain a copy of the answer key for the questions, please email me atwcheung@palomar.eduwith a copy of your current faculty identification or other forms of professional identification.To complete the exercises in this book, you will need access to ArcGIS Pro 3.0 (and ArcGIS Online with credits for some chapters). Please remember to first download the exercise data for the book athttps://tinyurl.com/ESESGIS.I wish you a wonderful time exploring various topics in GIS and Earth, Space, and Environmental Sciences in this book.",
        "publisher": "Wing Cheung",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/earth-space-and-environmental-science-explorations-with-arcgis-pro"
    },
    {
        "title": "Computer Networking : Principles, Protocols and Practice",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Olivier Bonaventure, Universite catholique de Louvain"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjkxLCJwdXIiOiJibG9iX2lkIn19--c4ecac785eeef9fb97363b2acb68c21f2fb449e1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ComNetwor.png",
        "description": "This open textbook aims to fill the gap between the open-source implementations and the open-source network specifications by providing a detailed but pedagogical description of the key principles that guide the operation of the Internet.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/computer-networking-principles-protocols-and-practice"
    },
    {
        "title": "Introduction to MIPS Assembly Language Programming",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Charles Kann, Gettysburg College"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDI1LCJwdXIiOiJibG9iX2lkIn19--4f96e4b284da8f20e93afd0e03932cbfb6071e06/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntroMIPS.png",
        "description": "This book was written to introduce students to assembly language programming in MIPS. As with all assemblylanguage programming texts, it covers basic operators and instructions, subprogram calling, loading andstoring memory, program control, and the conversion of the assembly language program into machine code.However this book was not written simply as a book on assembly language programming. The larger purposeof this text is to show how concepts in Higher Level Languages (HLL), such as Java or C/C++, arerepresented in assembly. By showing how program constructs from these HLL map into assembly, theconcepts will be easier to understand and use when the programmer implements programs in languages likeJava or C/C++. Concepts such as references and variables, registers, binary and Boolean operations, subprogram execution, memory types (heap, stack, and static), and array processing are covered to clarify thedecisions made when implementing HLL. Program control is presented using a mapping from structuredprograms in pseudo code to help students understand structured programming, and why it exists. Memoryaccess in assembly is presented to high light the difference between references (pointers) and values, and howthese impact HLL.This book has numerous code examples, and many problems at the end of each chapter, and it is appropriate for a class in Assembly Language, or as a extra resource for a class in Computer Organization.",
        "publisher": "Charles W. Kann III",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-mips-assembly-language-programming"
    },
    {
        "title": "Java, Java, Java: Object-Oriented Problem Solving",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Ralph Morelli, Trinity College",
            "Ralph Walde, Trinity College"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTc4LCJwdXIiOiJibG9iX2lkIn19--bd4faba467e42bc38e41c9bec482bf03658fcc23/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000JavaJavaJ.png",
        "description": "We have designed this third edition of Java, Java, Java to be suitable for a typical Introduction to Computer Science (CS1) course or for a slightly more advanced Java as a Second Language course. This edition retains the “objects first” approach to programming and problem solving that was characteristic of the first two editions. Throughout the text we emphasize careful coverage of Java language features, introductory programming concepts, and object-oriented design principles.The third edition retains many of the features of the first two editions, including:Early Introduction of ObjectsEmphasis on Object Oriented Design (OOD)Unified Modeling Language (UML) DiagramsSelf-study Exercises with AnswersProgramming, Debugging, and Design Tips.From the Java Library SectionsObject-Oriented Design SectionsEnd-of-Chapter ExercisesCompanion Web Site, with Power Points and other ResourcesThe In the Laboratory sections from the first two editions have been moved onto the book's Companion Web Site. Table 1 shows the Table of Contents for the third edition.",
        "publisher": "Ralph Morelli, Ralph Walde",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/java-java-java-object-oriented-problem-solving"
    },
    {
        "title": "Introduction to Data Science Using Python",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Afrand Agah, West Chester University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIwNjgsInB1ciI6ImJsb2JfaWQifX0=--20bf5e68a1757815a065cd7f3c18a9751370eb60/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Agah_DataSciencePython-1-767x1024.png",
        "description": "This book contains two parts, the first is designed to be used in an introductory programming course for students looking to learn Python, without having any prior experience with programming. Basic programming concepts are discussed, explained, and illustrated with a Python program. Ample programming questions are provided for practice. The second part of the book utilizes machine-learning concepts and statistics to accomplish data-driven resolutions. Python programs are provided to apply scientific computing to conclude statistically driven results.",
        "publisher": "The Pennsylvania Alliance for Design of Open Textbooks (PA-ADOPT)",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-data-science-using-python"
    },
    {
        "title": "Blueprints: Creating, Describing, and Implementing Designs for Larger-scale Software Projects - version 2.5",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Stephen Davies, University of Mary Washington"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE3NDMsInB1ciI6ImJsb2JfaWQifX0=--0c1e4ad172d610855116fa5321da17746b3c3dd0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/front_cover.png",
        "description": "Blueprints is a concise yet comprehensive coverage of Object-Oriented Analysis and Design concepts, suitable for a second programming course in Computer Science. It introduces and teaches application development in a command-line environment, and assumes basic expertise with the Java programming language.",
        "publisher": "University of Mary Washington",
        "language": "English",
        "isbn13": "9798331222161",
        "source": "https://open.umn.edu/opentextbooks/textbooks/blueprints-creating-describing-and-implementing-designs-for-larger-scale-software-projects-davis"
    },
    {
        "title": "Delftse Foundations of Computation - 2nd Edition",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Stefan Hugtenburg",
            "Neil Yorke-Smith"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk3MCwicHVyIjoiYmxvYl9pZCJ9fQ==--2147c5dac61fdacaa325ba833dde0201dda2b056/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-09-01%20at%2012.29.43%20PM.png",
        "description": "DELFTSE FOUNDATIONS OF COMPUTATION is a textbook for a one-quarter introductory course in theoretical computer science. It includes top-ics from propositional and predicate logic, proof techniques, discrete structures, set theory and the theory of computation, along with practical applications to computer science. It has no prerequisites other than a general familiarity with computer programming.This book is derived from Foundations of Computation by Carol Critchlow and David Eck, Version 2.3 (Summer 2011), which is licensed under CC BYNC-SA 4.0. Critchlow and Eck are not associated with the TU Delft editions. This book also uses some material from Wikipedia (English) (en.wikipedia. org), which is licensed under CC BY-SA 3.0. The authors of the TU Delft editions are responsible for any errors, and welcome bug reports and suggestions by email or in person.Thanks to M. de Jong, T. Klos, I. van Kreveld, F. Mulder, H. Tonino, E. Walraven, and all students who reported bugs or provided exercise solutions. This work can be redistributed in unmodified form, or in modified form with proper attribution and under the same licence as the original, for noncommercial uses only, as specified by the Creative Commons Attribution-Noncommercial-ShareAlike 4.0 Licence (creativecommons.org/licenses/by-ncsa/4.0/).",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463665988",
        "source": "https://open.umn.edu/opentextbooks/textbooks/delftse-foundations-of-computation"
    },
    {
        "title": "Defend Dissent",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Glencora Borradaile, Oregon State University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE4NywicHVyIjoiYmxvYl9pZCJ9fQ==--df3750147667e20d45b076cb5963483e4a54d2e5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Title-Page-Defend-Dissent-350x453.png",
        "description": "Defend Dissentis an introduction to cryptography paired with the social impacts of surveillance and the protective potential of encryption, with a focus on US social movements. Each chapter ends with a story that brings social context to the material—from surveillance used against contemporary US protests to the African National Congress’s use of partially manual encryption in fighting apartheid in South Africa in the 80s.This book can be read linearly, or you can pick and choose what you would like to learn about. Each chapter is prefaced with what you should read first (for background) and concludes with what you might want to read next.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": "9781955101059",
        "source": "https://open.umn.edu/opentextbooks/textbooks/defend-dissent"
    },
    {
        "title": "Nature of Geographic Information Systems",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "David DiBiase, Pennsylvania State University"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzU3LCJwdXIiOiJibG9iX2lkIn19--b4fbeb7798f571161300b5695debbdcf343372d6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000NatGeoInf.png",
        "description": "The purpose of this text is to promote understanding of the Geographic Information Science and Technology enterprise (GIS&T, also known as “geospatial”).",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/nature-of-geographic-information-systems"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Slovenian) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYyMCwicHVyIjoiYmxvYl9pZCJ9fQ==--7a3118f886903020058dd411476536cd2964fbc8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Slovenian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-slovenian"
    },
    {
        "title": "First Semester in Numerical Analysis with Python",
        "copyright_year": null,
        "last_update": null,
        "authors": [
            "Yaning Liu, University of Colorado Denver"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTY1MywicHVyIjoiYmxvYl9pZCJ9fQ==--5c62bc2558ad896ff74a1077a2bebdfa5eef586a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Numerical%20analysis.PNG",
        "description": "The book is based on “First semester in Numerical Analysis with Julia”, written by Giray Ökten. The contents of the original book are retained, while all the algorithms are implemented in Python (Version 3.8.0). Python is an open source (under OSI), interpreted, general-purpose programming language that has a large number of users around the world. Python is ranked the third in August 2020 by the TIOBE programming community index, a measure of popularity of programming languages, and is the top-ranked interpreted language. We hope this book will better serve readers who are interested in a first course in Numerical Analysis, but are more familiar with Python for the implementation of the algorithms.The first chapter of the book has a self-contained tutorial for Python, including how to set up the computer environment. Anaconda, the open-source individual edition, is recommended for an easy installation of Python and effortless management of Python packages, and the Jupyter environment, a web-based interactive development environment for Python as well as many other programming languages, was used throughout the book and is recommended to the readers for easy code development, graph visualization and reproducibility.",
        "publisher": "Auraria Institutional Repository",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/first-semester-in-numerical-analysis-with-python"
    },
    {
        "title": "Squeak by Example",
        "copyright_year": "2009",
        "last_update": null,
        "authors": [
            "Andrew P. Black, Portland State University",
            "Stéphane Ducasse, INRIA Lille",
            "Oscar Nierstrasz, University of Bern",
            "Damien Pollet, University of Lille"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjUzLCJwdXIiOiJibG9iX2lkIn19--36209ea513ea54183c42535ead9d8f7335538a0e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9783952334102.png",
        "description": "Squeak is a modern open-source development environment for the classic Smalltalk-80 programming language. Despite being the first purely object-oriented language and environment, Smalltalk is in many ways still far ahead of its successors in promoting a vision of an environment where everything is an object, and anything can change at run-time.Squeak by Example, intended for both students and developers, will guide you gently through the Squeak language and environment by means of a series of examples and exercises. The book helps you get started with A Quick Tour of Squeak and guides you through A First Application. The Smalltalk language is introduced in three chapters on Syntax in a Nutshell, Understanding Message Syntax and The Smalltalk Object Model.Development with Squeak is covered in The Squeak Programming Environment and SUnit. Several of the key classes are presented in chapters on Basic Classes, Collections, Streams and Morphic.The first edition of the book concludes with chapters on Classes and Metaclasses and Frequently Asked Questions.",
        "publisher": "University of Bern",
        "language": "English",
        "isbn13": "9783952334102",
        "source": "https://open.umn.edu/opentextbooks/textbooks/squeak-by-example"
    },
    {
        "title": "Essentials of Geographic Information Systems",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Jonathan Campbell, UCLA",
            "MIchael Shin, UCLA"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTMsInB1ciI6ImJsb2JfaWQifX0=--36d3c5a0d7763888fab84825121485a6169c2678/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453321966.png",
        "description": "Essentials of Geographic Information Systemsintegrates key concepts behind the technology with practical concerns and real-world applications. Recognizing that many potential GIS users are nonspecialists or may only need a few maps, this book is designed to be accessible, pragmatic, and concise.Essentials of Geographic Information Systemsalso illustrates how GIS is used to ask questions, inform choices, and guide policy. From the melting of the polar ice caps to privacy issues associated with mapping, this book provides a gentle, yet substantive, introduction to the use and application of digital maps, mapping, and GIS.In today's world, learning involves knowing how and where to search for information. In some respects, knowing where to look for answers and information is arguably just as important as the knowledge itself. BecauseEssentials of Geographic Information Systemsis concise, focused, and directed, readers are encouraged to search for supplementary information and to follow up on specific topics of interest on their own when necessary.Essentials of Geographic Information Systemsprovides the foundations for learning GIS, but readers are encouraged to construct their own individual frameworks of GIS knowledge. The benefits of this approach are two-fold. First, it promotes active learning through research. Second, it facilitates flexible and selective learning—that is, what is learned is a function of individual needs and interest.Since GIS and related geospatial and navigation technology change so rapidly, a flexible and dynamic text is necessary in order to stay current and relevant. Though essential concepts in GIS tend to remain constant, the situations, applications, and examples of GIS are fluid and dynamic. Though this book is intended for use in introductory GIS courses,Essentials of Geographic Information Systemswill also appeal to the large number of certificate, professional, extension, and online programs in GIS that are available today. In addition to providing readers with the tools necessary to carry out spatial analyses, Essentials of Geographic Information Systems outlines valuable cartographic guidelines for maximizing the visual impact of your maps. The book also describes effective GIS project management solutions that commonly arise in the modern workplace.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453321966",
        "source": "https://open.umn.edu/opentextbooks/textbooks/essentials-of-geographic-information-systems"
    },
    {
        "title": "Introduction to the Modeling and Analysis of Complex Systems",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [
            "Hiroki Sayama, State University of New York at Binghamton"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTg5LCJwdXIiOiJibG9iX2lkIn19--a45bf6a9790a75b1ba3f7fb05c39d5df5f5b687b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781942341093.png",
        "description": "Introduction to the Modeling and Analysis of Complex Systemsintroduces students to mathematical/computational modeling and analysis developed in the emerging interdisciplinary field of Complex Systems Science. Complex systems are systems made of a large number of microscopic components interacting with each other in nontrivial ways. Many real-world systems can be understood as complex systems, where critically important information resides in the relationships between the parts and not necessarily within the parts themselves.This textbook offers an accessible yet technically-oriented introduction to the modeling and analysis of complex systems. The topics covered include: fundamentals of modeling, basics of dynamical systems, discrete-time models, continuous-time models, bifurcations, chaos, cellular automata, continuous field models, static networks, dynamic networks, and agent-based models. Most of these topics are discussed in two chapters, one focusing on computational modeling and the other on mathematical analysis. This unique approach provides a comprehensive view of related concepts and techniques, and allows readers and instructors to flexibly choose relevant materials based on their objectives and needs. Python sample codes are provided for each modeling example.",
        "publisher": "Open SUNY",
        "language": "English",
        "isbn13": "9781942341093",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-the-modeling-and-analysis-of-complex-systems"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Dutch) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxOSwicHVyIjoiYmxvYl9pZCJ9fQ==--90729e269f744dde744b797fdd54c697089462c1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Dutch; Flemish",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-dutch"
    },
    {
        "title": "How to Think Like a Computer Scientist: C Version",
        "copyright_year": "1999",
        "last_update": null,
        "authors": [
            "Allen B. Downey",
            "Thomas Scheffler"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTUxLCJwdXIiOiJibG9iX2lkIn19--66948fed68b79cc26ecbff6c871af14109711146/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/0000HowComCve.PNG",
        "description": "The goal of this book is to teach you to think like a computer scientist. I like the way computer scientists think because they combine some of the best features of Mathematics, Engineering, and Natural Science. Like mathematicians, computer scientists use formal languages to denote ideas (specifically computations). Like engineers, they design things, assembling components into systems and evaluating trade offs among alternatives. Like scientists, they observe the behavior of complex systems, form hypotheses, and test predictions.The single most important skill for a computer scientist is problem-solving. By that I mean the ability to formulate problems, think creatively about solutions, and express a solution clearly and accurately. As it turns out, the process of learning to program is an excellent opportunity to practice problem-solving skills. That’s why this chapter is called “The way of the program.”",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/how-to-think-like-a-computer-scientist-c-version-1999"
    },
    {
        "title": "Graphic Design and Print Production Fundamentals",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [
            "Wayne Collins, British Columbia Institute of Technology",
            "Alex Haas, Emily Carr University",
            "Ken Jeffery, British Columbia Institute of Technology",
            "Alan Martin, British Columbia Institute of Technology",
            "Roberto Medeiros, Ricoh Canada",
            "Steven Tomljanovic, British Columbia Institute of Technology"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjgzLCJwdXIiOiJibG9iX2lkIn19--d6565578cb171c57f8e11d96a6d7862f50447ce4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000GraphicDe.png",
        "description": "This textbook -- written by a group of select experts with a focus on different aspects of the design process, from creation to production -- addresses the many steps of creating and then producing physical, printed, or other imaged products that people interact with on a daily basis. It covers the concept that, while most modern graphic design is created on computers using design software, the ideas and concepts don't stay on the computer. The ideas need to be completed in the computer software, then progress to an imaging (traditionally referred to as printing) process. Keywords are highlighted throughout and summarized in a Glossary at the end of the book, and each chapter includes exercises and suggested readings.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/graphic-design-and-print-production-fundamentals"
    },
    {
        "title": "Introduction to Programming using Fortran 95/2003/2008",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Ed Jorgensen, University of Nevada"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjgwLCJwdXIiOiJibG9iX2lkIn19--94a6928950ef9a742bc476af7e397cf3b4950911/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ProFortra.png",
        "description": "Computers are everywhere in our daily lives. Between the desktop, laptop, phone, bank, and vehicle, it is difficult to completely get away from computers. It only makes sense to learn a little about how a computer really works.This text provides an introduction to programming and problem solving using the Fortran 95/2003/2008 programming language. This introduction is geared for non-computer science majors. The primary focus is on an introduction to problem solving and algorithm development. As such, many details of the Fortran 95/2003/2008 language are omitted.",
        "publisher": "Ed Jorgensen",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-programming-using-fortran-95-2003-2008"
    },
    {
        "title": "Research Data Management in the Canadian Context",
        "copyright_year": "2023",
        "last_update": "2024",
        "authors": [
            "Emily Carlisle-Johnston, Western University",
            "Danielle Dennie, Concordia University",
            "Émilie Fortin, Université Laval",
            "Elizabeth Hill, Western University",
            "Kristi Thompson, Western University"
        ],
        "subjects": [
            "Computer Science",
            "Databases"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE0NzIsInB1ciI6ImJsb2JfaWQifX0=--7eb76c6438ccd6096914294feda84de95da84062/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/RDM-Text-Book-Cover-Design-English88-350x467.jpg",
        "description": "Research Data Management is a term for all the things that researchers do to structure, organize and maintain data before, during and after doing research. RDM is also an emerging discipline that is concerned with researching and developing ways to manage research data more effectively. But what is research data? Where is the push towards formal Research Data Management coming from? What are the requirements of good data management? Research Data Management in the Canadian Context: A Guide for Practitioners and Learners looks at these questions and more, all with a focus on Canadian guidelines, regulations and infrastructure.",
        "publisher": "Western University",
        "language": "English",
        "isbn13": "9780771431876",
        "source": "https://open.umn.edu/opentextbooks/textbooks/research-data-management-in-the-canadian-context"
    },
    {
        "title": "Implementing a One Address CPU in Logisim",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Charles W. Kann, Gettysburg College"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTE2LCJwdXIiOiJibG9iX2lkIn19--96a724ca59f20c8465d809af81cc88cf3e84a66b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ImpOneAdd.png",
        "description": "Most computer users have an incorrect, but useful, cognitive metaphor for computers in which the user says (or types or clicks) something and a mystical, almost intelligent or magical, behavior happens. It is not a stretch to describe computer users as believing computers follow the laws of magic, where some magic incantation is entered, and the computer responds with an expected, but magical, behavior. This magic computer does not actually exist. In reality computer are machines, and every action a computer performs reduces to a set of mechanical operations. In fact the first complete definition of a working computer was a mechanical machine designed by Charles Babbage in 1834, and would have run on steam power. Probably the biggest success of Computer Science (CS) in the 20th century was the development of abstractions that hide the mechanical nature of computers. The fact that average people use computers without ever considering that they are mechanistic is a triumph of CS designers. This purpose of this monograph is to break the abstract understanding of a computer, and to explain a computer's behavior in completely in mechanistic terms. It will deal specifically with the Central Processing Unit (CPU) of the computer, as this is where the magic happens. All other parts of a computer can be seen as just providing information for the CPU to operate on. This monograph will deal with a specific type of CPU, a one-address CPU, and will explain this CPU using only standard gates, specifically AND, OR, NOT, NAND and XOR gates, and 4 basic Integrated Circuits (ICs), the Decoder, Multiplexer, Adder, and Flip Flop. All of these gates and components can be described as mechanical transformations of input data to output data, and the overall CPU can then be seen as a mechanical device.",
        "publisher": "A.T. Still University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/implementing-a-one-address-cpu-in-logisim"
    },
    {
        "title": "High Performance Computing",
        "copyright_year": "2010",
        "last_update": "2021",
        "authors": [
            "Charles Severance",
            "Kevin Dowd"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDgzLCJwdXIiOiJibG9iX2lkIn19--1c5ebc84fb76f1b19a561c98df87f6b514344b42/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000HigPerCom.png",
        "description": "The purpose of this book is to teach new programmers and scientists about the basics of High Performance Computing. Too many parallel and high performance computing books focus on the architecture, theory and computer science surrounding HPC. This book speaks to the practicing chemistry student, physicist, or biologist who need to write and run their programs as part of their research.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/high-performance-computing"
    },
    {
        "title": "Making Sense of Digital Humanities",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Julian Chambliss, East Lansing, MI",
            "Ellen Moll, East Lansing, MI"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM2OCwicHVyIjoiYmxvYl9pZCJ9fQ==--6edd5bec3e20eaf6cd6b1e204916eebabe1633d9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Making-Sense-of-Digital-Humanities-683x1024.jpeg",
        "description": "Taking up the challenge of navigating the complex world of digital humanities,Making Sense of Digital Humanitiesoffers readers an exploration of the many ways scholars have employed the diverse toolkit of digital humanities to create a better understanding of the synergies and disruptions created by technological change. Rooted in a concern for the daunting tasks associated with teaching and learning about the digital humanities, this volume hopes to provide easy entry into a complex topic while highlighting how an understanding of digital humanities can transform our thinking about technology in the modern world.",
        "publisher": "Michigan State University",
        "language": "English",
        "isbn13": "9781626101210",
        "source": "https://open.umn.edu/opentextbooks/textbooks/making-sense-of-digital-humanities"
    },
    {
        "title": "The Crystal Ball Instruction Manual Volume Two: Foundations For Data Science",
        "copyright_year": "2020",
        "last_update": "2024",
        "authors": [
            "Stephen Davies, University of Mary Washington"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyODEsInB1ciI6ImJsb2JfaWQifX0=--50b7886e3cd93b318f478dbfb2951705c3ca91c0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/tcb.jpg",
        "description": "Welcome to Volume Two of the Crystal Ball series: Foundations for Data Science! I titled the first volume “Introduction to Data Science” because it led you through a dip-your-toes-in-the-water experience. You took a brief tour through the various elements in this diverse field and got a feel for what it was all about.Since you’re still reading, this means you’re still interested, and ready to explore the next level. In Foundations, we’ll solidify your growing knowledge so that you have a firm base on which to build everything else. Future volumes in this series will cover applications, advanced techniques, and some special data types that require special treatment. But it all ultimately rests on the skill set you’ll have built in Volumes One and Two of this series.",
        "publisher": "University of Mary Washington",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-crystal-ball-instruction-manual-volume-two-foundations-for-data-science"
    },
    {
        "title": "x86-64 Assembly Language Programming with Ubuntu",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Ed Jorgensen, University of Nevada"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Njc4LCJwdXIiOiJibG9iX2lkIn19--37c88a8474067b4db1dea8df8e264800603306db/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000AssemblyU.png",
        "description": "The purpose of this text is to provide a reference for University level assembly language and systems programming courses. Specifically, this text addresses the x86-64 instruction set for the popular x86-64 class of processors using the Ubuntu 64-bit Operating System (OS). While the provided code and various examples should work under any Linux-based 64-bit OS, they have only been tested under Ubuntu 14.04 LTS (64-bit). The x86-64 is a Complex Instruction Set Computing (CISC) CPU design. This refers to the internal processor design philosophy. CISC processors typically include a wide variety of instructions (sometimes overlapping), varying instructions sizes, and a wide range of addressing modes. The term was retroactively coined in contrast to Reduced Instruction Set Computer (RISC3).",
        "publisher": "Ed Jorgensen",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/x86-64-assembly-language-programming-with-ubuntu"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Russian) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxMiwicHVyIjoiYmxvYl9pZCJ9fQ==--4bc36370109c49de0cff9cbd56d865a8136995c5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Russian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-russian"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Korean) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxMSwicHVyIjoiYmxvYl9pZCJ9fQ==--030f5815088f0fc1d313003e3c20a7f8ca67b204/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Korean",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-korean"
    },
    {
        "title": "An Introduction to Matlab and Mathcad",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Troy Siemers, Virginia Military Institute"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjIyLCJwdXIiOiJibG9iX2lkIn19--1359a8d80ce3d4e5b6184c5c6c91600a456a5adb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000MatLabCad.png",
        "description": "This textbook, or really a “coursebook” for a college freshman-level class, has been updated for Spring 2014 and provides an introduction to programming and problem solving using both Matlab and Mathcad. We provide a balanced selection of introductory exercises and real-world problems (i.e. no “contrived” problems). We include many examples and screenshots to guide the reader. We assume no prior knowledge of Matlab or Mathcad.",
        "publisher": "APEX Calculus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-introduction-to-matlab-and-mathcad"
    },
    {
        "title": "Think Complexity: Exploring Complexity Science with Python - 2e",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Allen B. Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjMwLCJwdXIiOiJibG9iX2lkIn19--fd7ac721e1fff0ad624a02d509ccb01fc8b77e3f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781449314637.png",
        "description": "Complexity Science is an interdisciplinary field—at the intersection of mathematics, computer science, and natural science—that focuses on discrete models of physical and social systems. In particular, it focuses on complex systems, which are systems with many interacting components.Complex systems include networks and graphs, cellular automatons, agent-based models and swarms, fractals and self-organizing systems, chaotic systems and cybernetic systems.This book is primarily about complexity science, but studying complexity science gives you a chance to explore topics and ideas you might not encounter otherwise, practice programming in Python, and learn about data structures and algorithms.This book picks up where Think Python leaves off. I assume that you have read that book or have equivalent knowledge of Python. As always, I try to emphasize fundamental ideas that apply to programming in many languages, but along the way you will learn useful features that are specific to Python.The models and results in this book raise a number of questions relevant to the philosophy of science, including the nature of scientific laws, theory choice, realism and instrumentalism, holism and reductionism, and Bayesian epistemology.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": "9781449314637",
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-complexity-exploring-complexity-science-with-python"
    },
    {
        "title": "Game Based and Adaptive Learning Strategies",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Carrie Lewis Miller, Mankato, MN",
            "Odbayar Batsaikhan, Mankato, MN",
            "Elizabeth Pluskwik, Mankato, MN"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk4OCwicHVyIjoiYmxvYl9pZCJ9fQ==--b57c88ca473480ba40c491ec91dc91bacadf2118/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Game-Based-and-Adaptive-Learning-Strategies-768x1024.png",
        "description": "This book is designed to accompany a graduate-level instructional design course:Game-Based and Adaptive Learning,but could also be used for undergraduate teacher education or instructional design courses.The original texts and material for this book came from the development of a course for Brandeis University as part of their MS in Learner Experience Design program. This material can be used to teach pre-service teachers, in-service teachers, and instructional designers about game-based and adaptive learning.  Assessments used in the actual Game-based and Adaptive Learning course are included in the final chapter and serve as recommendations for assessments of the learning outcomes. The material in this book pairs well withUsing Game-Based Learning Online – A Cookbook of Recipesby The EGG.The Faculty Showcase materials were developed by dedicated faculty during the course of a year-long game development workshop in which faculty were introduced to GBL, developed game prototypes, played a variety of games, and finally playtested their designs. The work they continue to do in the area of GBL is part of the inspiration for this book. If you would like to contribute your own case study, please contact me at carrie.miller@mnsu.edu for consideration.Carrie Lewis Miller, Ph.D.- editor/author- Instructional Designer, Minnesota State University, Mankato",
        "publisher": "Minnesota State Colleges and Universities",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/game-based-and-adaptive-learning-strategies"
    },
    {
        "title": "Patterns for Beginning Programmers",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "David Bernstein, James Madison University"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzczNCwicHVyIjoiYmxvYl9pZCJ9fQ==--4e5fef9e763bba59835efbde53da3cbf37d81533/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/cover-1-768x993.png",
        "description": "Programming patterns are solutions to problems that require the creation of a small fragment of code that will be part of a larger program. Hence, this book is about teaching you how to write such fragments of code. However, it is not about teaching you the syntax of the statements in the fragments, it assumes that you already know the syntax. Instead, it is about finding solutions to problems that arise when first learning to program.",
        "publisher": "James Madison University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/patterns-for-beginning-programmers"
    },
    {
        "title": "Deep into Pharo",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "Alexandre Bergel, University of Chile",
            "Damien Cassou, University of Lille 1",
            "Stéphane Ducasse, INRIA Lille",
            "Jannik Laval, University of Lyon"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjU1LCJwdXIiOiJibG9iX2lkIn19--a7424ca2d6be04e4f8ee1487d5b8bcb792313d86/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9783952334164.png",
        "description": "Pharo is a clean, innovative, open-source, live-programming environment.Deep into Pharois the second volume of a series of books covering Pharo. Whereas the first volume is intended for newcomers, this second volume covers deeper topics.You will learn about Pharo frameworks and libraries such as Glamour, PetitParser, Roassal, FileSystem, Regex, and Socket.You will explore the language with chapters on exceptions, blocks, small integers, and floats.You will discover tools such as profilers, Metacello and Gofer.",
        "publisher": "Square Bracket Associates",
        "language": "English",
        "isbn13": "9783952334164",
        "source": "https://open.umn.edu/opentextbooks/textbooks/deep-into-pharo"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Español) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYwNywicHVyIjoiYmxvYl9pZCJ9fQ==--2eee7c113e0145abe97bdb699502a0bac7bce563/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-espanol"
    },
    {
        "title": "Prealgebra via Python Programming: First Steps to Perform Large Scale Computational Tasks in the Sciences and Engineerings",
        "copyright_year": "2018",
        "last_update": "2024",
        "authors": [
            "Sergio Rojas, Universidad Simón Bolívar"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQyOSwicHVyIjoiYmxvYl9pZCJ9fQ==--b172bb0681a2206c609b0016ce0b884d2209bfbc/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-22%20at%2010.22.25%20PM.png",
        "description": "This book was written for students and instructors who want to learn how to use a computer for other than the most common uses, such as web browsing, document creation, or paying bills online. This book is for anyone who wants to perform computational tasks that they design. In other words, if you wish to learn how to program a computer, this book is for you.Because prealgebra is a subject that practically everyone is supposed to learn in grade school, it provides a platform to introduce basic computer programming concepts. Consequently, this book should also be of interest to students in middle or high school who want to learn how to program, and who are willing to invest the time and effort in learning a programming language that they could continue using throughout their schooling and in their professional life. Similarly, this book could also be of interest to pre-service and in-service mathematics teachers wishing to have at their disposal a complementary tool to assist in fostering understanding, competency, and interest in mathematics among their students. This book can be integrated with the teachers’ curriculum as way to tackle non-traditional math problems using an inexpensive modern computer language. By the end of the book, a reader will have learned enough to be able to write a preliminary, step-by-step one variable equation solver that can be expanded in the future to use with more complex equations. In other words, by the end of the book, you will be able to write code that programs their machines to solve equations. This code is foundational and readers are ecouraged to learn on their own how to build on it to suit their mathematics learning needs.",
        "publisher": "Sergio Rojas",
        "language": "English",
        "isbn13": "9789801801238",
        "source": "https://open.umn.edu/opentextbooks/textbooks/prealgebra-via-python-programming-first-steps-to-perform-large-scale-computational-tasks-in-the-sciences-and-engineerings"
    },
    {
        "title": "The Crystal Ball Instruction Manual - version 1.1 Volume One: Introduction to Data Science",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Stephen Davies, University of Mary Washington"
        ],
        "subjects": [
            "Computer Science",
            "Databases",
            "Information Systems",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE4OCwicHVyIjoiYmxvYl9pZCJ9fQ==--d726493174b50f2f954ef9182a5ea3bac512ea0f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/cover-trim-no-fold-front_cover-62fb6749-f75d-4235-a460-e936fec93c10.jpg",
        "description": "A perfect introduction to the exploding field of Data Science for the curious, first-time student. The author brings his trademark conversational tone to the important pillars of the discipline: exploratory data analysis, choices for structuring data, causality, machine learning principles, and introductory Python programming using open-source Jupyter Notebooks. This engaging read will allow any dedicated learner to build the skills necessary to contribute to the Data Science revolution, regardless of background.",
        "publisher": "University of Mary Washington",
        "language": "English",
        "isbn13": "9781715320041",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-crystal-ball-instruction-manual-volume-one-introduction-to-data-science"
    },
    {
        "title": "Java with BlueJ",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Ron McFadyen, University of Winnipeg"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzY5LCJwdXIiOiJibG9iX2lkIn19--22eb11c65b00a078cd57ec14242f0db185c527ef/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000JavWitBlu.png",
        "description": "This book is Part I of a two-part set that introduces the Java programming language. The text assumes the student will be using the BlueJ development environment and provides some introductory BlueJ material. Our experience has been that BlueJ is easy to learn and provides a good programming environment for the beginner programmer.",
        "publisher": "Ron McFadyen",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/java-with-bluej"
    },
    {
        "title": "Database Design - 2nd Edition",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Adrienne Watt, City University"
        ],
        "subjects": [
            "Computer Science",
            "Databases"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQyNCwicHVyIjoiYmxvYl9pZCJ9fQ==--5ae3bf9271b5d6a9ec9975fbbd7d3a334cac473c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/datbase.jpg",
        "description": "This second edition ofDatabase Designbook covers the concepts used in database systems and the database design process. Topics include:The history of databasesCharacteristics and benefits of databasesData modelsData modellingClassification of database management systemsIntegrity rules and constraintsFunctional dependenciesNormalizationDatabase development processNew to this edition are more examples, highlighted and defined key terms, both throughout and at the end of each chapter, and end-of-chapter review exercises. Two new chapters have been added on SQL, along with appendices that include a data model example, sample ERD exercises and SQL lab with solutions.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/database-design-2nd-edition"
    },
    {
        "title": "Computer Science I - Version 1.3.7",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Chris Bourke, University of Nebraska–Lincoln"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjI2NiwicHVyIjoiYmxvYl9pZCJ9fQ==--bebe5324704b51479b38acdcc4bd61ba239dd0b8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/CSI%201.JPG",
        "description": "Thistextbookcovers the traditional introductory Computer Science I topics but takes a unique approach. Topics are covered in a language-agnostic manner in the first part with supplemental parts that cover the same concepts in a specific language. The current version covers C, Java, and PHP. Thistextbookas been used in several Computer Science I sections over multiple years at the University of Nebraska-Lincoln",
        "publisher": "Chris Bourke",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/computer-science-i"
    },
    {
        "title": "Information Systems - A Manager's Guide to Harnessing Technology",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk2NCwicHVyIjoiYmxvYl9pZCJ9fQ==--209b4d603d2242425068556bf7c12ef562b93407/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Information-Systems-683x1024.jpg",
        "description": "Information Systems: A Manager's Guide to Harnessing Technologyis intended for use in undergraduate and/or graduate courses in Management Information Systems and Information Technology.The teaching approach inInformation Systems: A Manager's Guide to Harnessing Technologycan change this. The text offers a proven approach that has garnered student praise, increased IS enrollment, and engaged students to think deeper and more practically about the space where business and technology meet. Every topic is related to specific business examples, so students gain an immediate appreciation of its importance. Rather than lead with technical topics, the book starts with strategic thinking, focusing on big-picture issues that have confounded experts but will engage students. And while chapters introduce concepts, cases on approachable, exciting firms across industries further challenge students to apply what they've learned, asking questions like:Why was Netflix able to repel Blockbuster and WalMart? How did Harrah's Casino's become twice as profitable as comparably-sized Caesar's, enabling the former to acquire the latter? How does Spain's fashion giant Zara, a firm that shuns the sort of offshore manufacturing used by every other popular clothing chain, offer cheap fashions that fly off the shelves, all while achieving growth rates and profit margins that put Gap to shame? Why do technology markets often evolve into winner-take-all or winner take-most scenarios? And how can managers compete when these dynamics are present? Why is Google more profitable than Disney? How much is Facebook really worth?The teaching approach in this text encourages students to think deeper and more practically about the space where business and technology meet. Every topic is related to specific business examples, so students gain an immediate appreciation of its importance. Rather than starting with technical topics, the book starts with strategic thinking, focusing on big-picture issues that interest students.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135124",
        "source": "https://open.umn.edu/opentextbooks/textbooks/information-systems-a-manager-s-guide-to-harnessing-technology"
    },
    {
        "title": "The Spec UI framework",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Johan Fabry, University of Chile",
            "Stephane Ducasse, Cristal laboratory University of Lille"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQ4LCJwdXIiOiJibG9iX2lkIn19--a2fe986a5a834c7235a59c51747d48433682969f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781326927462.png",
        "description": "Spec is the default UI framework for Pharo. To build UI's in Spec existing widgets or even complete UI's are reused and configured to form a new UI.This book first shows the basics of Spec and how it enables reuse of UIs. It then treats UI layout in detail before moving on to explaining the management of windows. Some of the more advanced widgets are also discussed as well as the dynamic features of Spec. Lastly, the book also contains a chapter with tips and tricks.",
        "publisher": "Square Bracket Associates",
        "language": "English",
        "isbn13": "9781326927462",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-spec-ui-framework"
    },
    {
        "title": "Yet Another Introductory Number Theory Textbook (Cryptology Emphasis Version)",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Jonathan A. Poritz"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjE3LCJwdXIiOiJibG9iX2lkIn19--c135223b353db201633704e27c7d3d27aeab8c1a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000YetAnoCry.png",
        "description": "This version of YAINTT has a particular emphasis on connections to cryptology. The cryptologic material appears in Chapter 4 and §§5.5 and 5.6, arising naturally (I hope) out of the ambient number theory. The main cryptologic applications – being the RSA cryptosystem, Diffie-Hellman key exchange, and the ElGamal cryptosystem – come out so naturally from considerations of Euler’s Theorem, primitive roots, and indices that it renders quite ironic G.H. Hardy’s assertion [Har05] of the purity and eternal inapplicability of number theory. Note, however, that once we broach the subject of these cryptologic algorithms, we take the time to make careful definitions for many cryptological concepts and to develop some related ideas of cryptology which have much more tenuous connections to the topic of number theory. This material therefore has something of a different flavor from the rest of the text – as is true of all scholarly work in cryptology (indeed, perhaps in all of computer science), which is clearly a discipline with a different culture from that of “pure”mathematics. Obviously, these sections could be skipped by an uninterested reader, or remixed away by an instructor for her own particular class approach.",
        "publisher": "Jonathan Poritz",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/yet-another-introductory-number-theory-textbook-cryptology-emphasis-version"
    },
    {
        "title": "Introduction to Computer Graphics",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "David J. Eck, Hobart and William Smith Colleges"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzQ5LCJwdXIiOiJibG9iX2lkIn19--60242d630a9a4cf9b1ba4078607b63ffb4ec8640/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000CompGraph.png",
        "description": "Introduction to Computer Graphicsis a free, on-line textbook covering the fundamentals of computer graphics and computer graphics programming. This book is meant for use as a textbook in a one-semester course that would typically be taken by undergraduate computer science majors in their third or fourth year of college.",
        "publisher": "David J. Eck",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-computer-graphics"
    },
    {
        "title": "Inteligencia Artificial Aplicada con técnicas de Procesamiento de Lenguaje Natural y Machine Learning en el campo de la salud.",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Eleanor Alexandra Varela-Tapia, Universidad de Guayaquil",
            "Ivan Leonel Acosta-Guzmán, Universidad de Guayaquil",
            "Jorge Alberto Oviedo-Peñafiel, Universidad de Guayaquil"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyNjMsInB1ciI6ImJsb2JfaWQifX0=--5476f863c7a1c54d193b9e3393fcfe7414e9b59f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_83_83_coverImage_es_ES.jpg",
        "description": "La Inteligencia Artificial (IA), el Procesamiento del Lenguaje Natural (NLP) y el Aprendizaje Automático (ML) han jugado un papel crucial en la lucha contra la pandemia de Covid-19, proporcionando herramientas tecnológicas valiosas para el diagnóstico, seguimiento y control de la enfermedad, implementándose soluciones con IA para mitigar sus efectos. Se propone el diseño de un modelo de ML aplicando técnicas NLP en el preprocesamiento de texto para poder evaluar la eficacia del análisis de datos en conversaciones de personas contagiadas del coronavirus SARS-CoV-2. Se recopiló información de redes sociales como Twitter y Facebook, y encuestas a contagiados de Covid-19 en la Zona 8 de la provincia del Guayas. Con estos datos, se entrenó un sistema de clasificación textual utilizando los algoritmos de Soporte de Máquina Vectorial y Random Forest. El estudio resultó en una precisión del 96% en ambos modelos, demostrando su viabilidad para la creación e implementación de clasificadores de texto. Se logró mejorar el rendimiento del modelo, reduciendo las categorías con más de 200 ocurrencias, lo que resultó en una precisión más elevada sin diferencias significativas entre ambos modelos. Por último, se desarrolló un sitio web capaz de clasificar correctamente los síntomas y recomendaciones comentadas por los pacientes.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651389",
        "source": "https://open.umn.edu/opentextbooks/textbooks/inteligencia-artificial-aplicada-con-tecnicas-de-procesamiento-de-lenguaje-natural-y-machine-learning-en-el-campo-de-la-salud"
    },
    {
        "title": "Microprocesadores Fundamentos y Aplicaciones",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Carlos Valdivieso",
            "Ronald M. Solís"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM3LCJwdXIiOiJibG9iX2lkIn19--8cbdaa7079b2f19ace59031205e81c4c8435471c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9789942142962.png",
        "description": "Este trabajo ha sido desarrollado gracias a la interacción como docente universitario en la enseñanza teórica y práctica de la materia de microprocesadores con diversos grupos de estudiantes por alrededor de 15 años. Es con sus exigencias, cuestionamientos y colaboraciones con sus proyectos prácticos implementados en los cursos dictados, que se ha podido construir una guía comprensiva, que trate de responder de una forma adecuada las múltiples dudas de los estudiantes en su proceso de aprendizaje. La disponibilidad de tiempo en el aula de clase muchas veces no es suficiente para responder las inquietudes de los estudiantes; así que, se espera que con este trabajo se contribuya a proporcionar al lector un cúmulo de información que le ayuden de una manera práctica y escalonada a comprender la base teórica de los microprocesadores de Intel y sus derivados (capítulos 1 al 15), con implementaciones prácticas básicas (capítulo 16). Al final se citan libros de referencia que pueden consultarse para profundizar los temas tratados.",
        "publisher": "LATIn Project",
        "language": "Spanish; Castilian",
        "isbn13": "9789942142962",
        "source": "https://open.umn.edu/opentextbooks/textbooks/microprocesadores-fundamentos-y-aplicaciones"
    },
    {
        "title": "An Open Guide to Data Structures and Algorithms",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Paul W. Bible, DePauw University",
            "Lucas Moser, Marian University",
            "Mia M. Scarlato"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAzMjQsInB1ciI6ImJsb2JfaWQifX0=--f361efb41bbf2fd105d95e93835c873f090724f9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Open-Guide-to-Data-Structures-mockup-6-x-9-350x525.jpg",
        "description": "This textbook serves as a gentle introduction for undergraduates to theoretical concepts in data structures and algorithms in computer science while providing coverage of practical implementation (coding) issues. The field of computer science (CS) supports a multitude of essential technologies in science, engineering, and communication as a social medium. The varied and interconnected nature of computer technology permeates countless career paths making CS a popular and growing major program. Mastery of the science behind computer science relies on an understanding of the theory of algorithms and data structures. These concepts underlie the fundamental tradeoffs that dictate performance in terms of speed, memory usage, and programming complexity that separate novice programmers from professional practitioners.",
        "publisher": "PALNI",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-open-guide-to-data-structures-and-algorithms"
    },
    {
        "title": "Python for Everybody: Exploring Data Using Python 3",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Charles Severance, University of Michigan"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjc2LCJwdXIiOiJibG9iX2lkIn19--3da6740b2a9593fdbe0bec9ac81ad9478fb71dc6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781530051120.png",
        "description": "I never seemed to find the perfect data-oriented Python book for my course, so I set out to write just such a book. Luckily at a faculty meeting three weeks before I was about to start my new book from scratch over the holiday break, Dr. Atul Prakash showed me theThink Pythonbook which he had used to teach his Python course that semester. It is a well-written Computer Science text with a focus on short, direct explanations and ease of learning.The overall book structure has been changed to get to doing data analysis problems as quickly as possible and have a series of running examples and exercises about data analysis from the very beginning.Chapters 2–10 are similar to theThink Pythonbook, but there have been major changes. Number-oriented examples and exercises have been replaced with data- oriented exercises. Topics are presented in the order needed to build increasingly sophisticated data analysis solutions. Some topics like try and except are pulled forward and presented as part of the chapter on conditionals. Functions are given very light treatment until they are needed to handle program complexity rather than introduced as an early lesson in abstraction. Nearly all user-defined functions have been removed from the example code and exercises outside of Chapter 4. The word “recursion”1 does not appear in the book at all.In chapters 1 and 11–16, all of the material is brand new, focusing on real-world uses and simple examples of Python for data analysis including regular expressions for searching and parsing, automating tasks on your computer, retrieving data across the network, scraping web pages for data, object-oriented programming, using web services, parsing XML and JSON data, creating and using databases using Structured Query Language, and visualizing data.The ultimate goal of all of these changes is a shift from a Computer Science to an Informatics focus is to only include topics into a first technology class that can be useful even if one chooses not to become a professional programmer.",
        "publisher": "Charles Severance",
        "language": "English",
        "isbn13": "9781530051120",
        "source": "https://open.umn.edu/opentextbooks/textbooks/python-for-everybody-exploring-data-using-python-3"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (English) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYwNSwicHVyIjoiYmxvYl9pZCJ9fQ==--7e715b81dff357ed1a6f4c91e0d5a5e0c8435f60/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git"
    },
    {
        "title": "Pharo by Example 5.0",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Stéphane Ducasse, INRIA Lille",
            "Dmitri Zagidulin",
            "Nicolai Hess",
            "Dimitris Chloupis"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjU0LCJwdXIiOiJibG9iX2lkIn19--9554736475f215063999450ff9e209fec291a928/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781365654596.png",
        "description": "Pharo is an open-source, elegant and pure object-oriented language that supports truly immersive and life programming experience. Pharo offers excellent tools such as hot-debuggers and on the fly code update that change the programming experience. More at http://www.pharo.org.Pharo is a powerful language and IDE that companies use to deliver complex business-effective applications. More at: http://www.pharo.org/successIn Pharo everything is an object, and anything can change at run-time under your fingers. Pharo is written in itself you can explore a complete world. You can feel and talk to objects. But Pharo does not stop there, with Pharo you can improve your object-oriented skills by rediscovering the essence of object-oriented programming. Pharo by Example 50, intended for both students and developers, will guide you gently through the Pharo language and environment by means of a series of examples and exercises. This book is available under the Creative Commons Attribution-ShareAlike 3.0 license.",
        "publisher": "Stéphane Ducasse",
        "language": "English",
        "isbn13": "9781365654596",
        "source": "https://open.umn.edu/opentextbooks/textbooks/pharo-by-example-5-0"
    },
    {
        "title": "A Person-Centered Guide to Demystifying Technology: Working together to observe, question, design, prototype, and implement/reject technology in support of people's valued beings and doings - 2nd Edition",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Martin Wolske, University of Illinois at Urbana Champaign"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAyNDcsInB1ciI6ImJsb2JfaWQifX0=--3d12371e49fe52113e3ffaa7e039d59a973432a5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Wolske-ed2_FinalPB-350x453.jpg",
        "description": "Digital technologies old and new are not objects that can be packed inside a box. They are a seamless, indivisible combination of people, organizations, policies, economies, histories, cultures, knowledge, and material things that are continuously shaped and reshaped. Every one of us innovates-in-use our everyday technologies; we just do not always know it. We are shaped by the networked information tools in our midst, and we shape them and thereby shape others. While many of the chapters in this book can be approached as standalone explorations, as many around the world have done, its full potential comes when collaboratively taken as a journey through twelve sessions. Each session in this second, revised edition includes two thematically linked chapters, one more socially oriented and one more technically oriented. Sessions are brought together into three larger generative themes that are built from three decades of participatory design in and with community, and from the teaching of these concepts and practices in courses and workshops. Approached within a community of practice, learning outcomes include discovering ways to advance power, both power within and power with others; advancing our technical skills, but also and even more, our progressive community engagement skills, our critical sociotechnical skills, and our cognitive, information, and social-emotional skills; and progressing our culturally competent collective leadership through social justice storytelling within a framing of reciprocity. In so doing, this textbook seeks to address the call placed by the Rev. Dr. Martin Luther King, Jr. – to rapidly shift from a ‘thing-oriented’ society to a ‘person-oriented’ society.",
        "publisher": "University of Illinois Library - Urbana",
        "language": "English",
        "isbn13": "9781946011138",
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-person-centered-guide-to-demystifying-technology-working-together-to-observe-question-design-prototype-and-implement-reject-technology-in-support-of-people-s-valued-beings-and-doings"
    },
    {
        "title": "Think Stats: Probability and Statistics for Programmers - 2e",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Allen B. Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjI4LCJwdXIiOiJibG9iX2lkIn19--62e1641c08ae6865c34a3e155cfaed5cf6da0f56/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781491907337.png",
        "description": "Think Statsis an introduction to Probability and Statistics for Python programmers.Think Statsemphasizes simple techniques you can use to explore real data sets and answer interesting questions. The book presents a case study using data from the National Institutes of Health. Readers are encouraged to work on a project with real datasets.If you have basic skills in Python, you can use them to learn concepts in probability and statistics. Think Stats is based on a Python library for probability distributions (PMFs and CDFs). Many of the exercises use short programs to run experiments and help readers develop understanding.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": "9781491907337",
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-stats-probability-and-statistics-for-programmers"
    },
    {
        "title": "Computer Networks: A Systems Approach",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Larry Peterson, Princeton University",
            "Bruce Davie, VMWare"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkxNywicHVyIjoiYmxvYl9pZCJ9fQ==--b848594058900ba40e7655f54c696134fcb44c70/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/peterson-cover-med.jpg",
        "description": "Suppose you want to build a computer network, one that has the potential to grow to global proportions and to support applications as diverse as teleconferencing, video on demand, electronic commerce, distributed computing, and digital libraries. What available technologies would serve as the underlying building blocks, and what kind of software architecture would you design to integrate these building blocks into an effective communication service? Answering this question is the overriding goal of this book—to describe the available building materials and then to show how they can be used to construct a network from the ground up.",
        "publisher": "Larry Peterson and Bruce Davie",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/computer-networks-a-systems-approach"
    },
    {
        "title": "Programming Languages: Application and Interpretation - Version Second Edition",
        "copyright_year": "2007",
        "last_update": "2017",
        "authors": [
            "Shriram Krishnamurthi, Brown University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "Unlike some other textbooks, this one does not follow a top-down narrative. Rather it has the flow of a conversation, with backtracking. We will often build up programs incrementally, just as a pair of programmers would. We will include mistakes, not because I don't know the answer, but because this is the best way for you to learn. Including mistakes makes it impossible for you to read passively: you must instead engage with the material, because you can never be sure of the veracity of what you're reading.At the end, you'll always get to the right answer. However, this non-linear path is more frustrating in the short term (you will often be tempted to say, “Just tell me the answer, already!”), and it makes the book a poor reference guide (you can't open up to a random page and be sure what it says is correct). However, that feeling of frustration is the sensation of learning. I don't know of a way around it.At various points you will encounter this:ExerciseThis is an exercise. Do try it.This is a traditional textbook exercise. It's something you need to do on your own. If you're using this book as part of a course, this may very well have been assigned as homework. In contrast, you will also find exercise-like questions that look like this:Do Now!There's an activity here! Do you see it?When you get to one of these, stop. Read, think, and formulate an answer before you proceed. You must do this because this is actually an exercise, but the answer is already in the book—most often in the text immediately following (i.e., in the part you're reading right now)—or is something you can determine for yourself by running a program. If you just read on, you'll see the answer without having thought about it (or not see it at all, if the instructions are to run a program), so you will get to neither (a) test your knowledge, nor (b) improve your intuitions. In other words, these are additional, explicit attempts to encourage active learning. Ultimately, however, I can only encourage it; it's up to you to practice it.The main programming language used in this book isRacket. Like with all operating systems, however, Racket actually supports a host of programming languages, so you must tell Racket which language you're programming in.This textbook has been used in classes at:Brown University, Cal Poly, Columbus State University, Northeastern University, NYU, Reed College, UC-San Diego, UC-Santa Cruz, University of Rhode Island, University of Utah, Westmont College, Williams College, Worcester Polytechnic Institute.",
        "publisher": "Brown University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/programming-languages-application-and-interpretation"
    },
    {
        "title": "Tutorials of Visual Graphic Communication Programs for Interior Design",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Yongyeon Cho, Iowa State University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkxNiwicHVyIjoiYmxvYl9pZCJ9fQ==--082d831e3fd50bb1b57cdc6911fc189794f63bc6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Book-cover_01-1-683x1024.jpg",
        "description": "This book is for the beginning level of both architecture and interior design students who learn computer graphic communication software. The author developed multiple tutorials to teach three computer graphic applications, AutoCAD, Revit, and Enscape. AutoCAD is an essential computer drafting software which is 2D drawing software. Revit is a Building Information Modeling software, which is 3D based modeling software. Lastly, Enscape is a real-time rendering, animation, and virtual reality plug-in for users' 4D experiences.",
        "publisher": "Iowa State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/tutorials-of-visual-graphic-communication-programs-for-interior-design"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (French) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYwOCwicHVyIjoiYmxvYl9pZCJ9fQ==--a1767b63dc5bf37192ce82f30887fa1b7146b118/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository",
        "publisher": "Apress",
        "language": "French",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-french"
    },
    {
        "title": "Embedded Controllers Using C and Arduino - 2e",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "James M. Fiore"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDk1LCJwdXIiOiJibG9iX2lkIn19--dda64faab36c7a890e167b1123280f05873dfae0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000EmbConUCA.png",
        "description": "This text is designed to introduce and expand upon material related to the C programming language and embedded controllers, and specifically, the Arduino development system and associated Atmel ATmega microcontrollers. It is intended to fit the time constraints of a typical 3 to 4 credit hour course for electrical engineering technology and computer engineering technology programs, although it could also fit the needs of a hardware-oriented course in computer science. As such, the text does not attempt to cover every aspect of the C language, the Arduino system or Atmel AVR microcontrollers. The first section deals with the C language itself. It is assumed that the student is a relative newcomer to the C language but has some experience with another high level language, for example, Python. This means concepts such as conditionals and iteration are already familiar and the student can get up and running fairly quickly. From there, the Arduino development environment is examined. Unlike the myriad Arduino books now available, this text does not simply rely on the Arduino libraries. As convenient as the libraries may be, there are other, sometimes far more efficient, ways of programming the boards. Many of the chapters examine library source code to see “what's under the hood”. This more generic approach means it will be easier for the student to use other processors and development systems instead of being tightly tied to one platform.There is alab manualfor this textbook.",
        "publisher": "dissidents",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/embedded-controllers-using-c-and-arduino-2e"
    },
    {
        "title": "How to Think Like a Computer Scientist: Learning with Python",
        "copyright_year": "2008",
        "last_update": null,
        "authors": [
            "Allen Downey, Franklin W. Olin College of Engineering",
            "Jeff Elkner, Yorktown High School",
            "Chris Meyers, Lane Community College"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjYsInB1ciI6ImJsb2JfaWQifX0=--ed51a3cecad85724e47f0abb3ade3d051493fef1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000HowTCSPD.png",
        "description": "How to Think Like a Computer Scientist: Learning with Python is an introduction to programming using Python.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/how-to-think-like-a-computer-scientist-learning-with-python"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Greek) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYwOSwicHVyIjoiYmxvYl9pZCJ9fQ==--cb128cb1524759c4b6789e3cd510c9ab97172eee/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Greek, Modern (1453-)",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-greek"
    },
    {
        "title": "Business Information Systems: Design an App for That",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Raymond Frost, Ohio University",
            "Jacqueline Pike, Duquesne University",
            "Lauren Kenyo, Ohio University",
            "Sarah Pels, Ohio University"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzcsInB1ciI6ImJsb2JfaWQifX0=--aba6a0e856a1517433a682d186bad082eb68dd79/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453311578.png",
        "description": "We set out to design an introductory course governed by four themes:Give students a good idea of what a career in MIS looks like by doing MIS.Enhance the professionalism of deliverables by teaching design and usability concepts.Promote creativity by assigning projects that demand it.Teach students about cloud computing by having them do cloud computing.Students in an introductory Management Information Systems (MIS) course often ask what a career in MIS looks like. Lacking a clear vision, they make their own assumptions. Often they assume the career involves programming with little human interaction. That MIS is a technical field could not be further from the truth. MIS job descriptions typically require candidates to be able to collaborate, communicate, analyze needs and gather requirements. They also list the need for excellent written and communication skills. In other words, MIS workers are constantly interacting with other people both inside and outside the organization. They are coming up with creative solutions to business problems.This course is designed to help students get a feel for what a career in MIS would be like. Our students report that they learn more about information systems from their internships than from their IS courses. Consequently, we designed a course that looks very much like an internship—an introduction to the field followed by a substantial project.Chapter 1 begins by introducing the information systems landscape. Here we discuss all the usual suspects: the information systems triangle, the systems development life cycle, transaction systems (ERP, SCM, CRM), collaboration systems, and business intelligence systems. Other aspects of the landscape such as usability, outsourcing, database concepts and so forth are introduced throughout chapter in Chapter 2 where they fit in naturally with the flow of the project.Chapter 2 is the substantial project which runs over a number of chapters. Over the course of the semester, students plan, build, and develop a proposal for an iPhone application. They develop a very realistic mockup. They also build a website to help market and support the app. Students are engaged because the project is fun and feels real. However, they are simultaneously learning business concepts and MIS skills. Prior to the existence of this course, we were only able to give such an interesting project at the senior level. Now, even as freshmen, students have a real experience of MIS in operation.A by product of creating an engaging course is increased enrollment in the MIS major. Even students who have never heard of MIS become excited about the major and either switch majors or add it as a double major or minor.Many other books have students study tools and then do a case. By contrast, most of this book is a case. Much like the real world, we introduce tools when needed, and only to the extent needed, to get at each part of the case.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453311578",
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-information-systems-design-an-app-for-that"
    },
    {
        "title": "An Introduction to Python Jupyter Notebooks for College Math Teachers",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Paul Isihara, Wheaton College",
            "Claire Wagner, Wheaton College",
            "Peter Jantsch, Wheaton College",
            "Thomas VanDrunen, Wheaton College"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyNTMsInB1ciI6ImJsb2JfaWQifX0=--b5d8e9117aab1bece91657a524761c793dd38a3f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/aitpjn.jpg",
        "description": "This book is an introduction to the use of Python Jupyter Notebooks (JNBs) for college math teachers and their students. The book is an evolving work in progress, but we hope this 1st Edition may already be quite useful to a college math teacher who is interested to use Jupyter Notebooks in their courses. Each section of the book has been written in the form of a Jupyter Notebook and can be downloaded using the download button at the top menu bar. In some cases, additional data files or image files may need to be downloaded as well. All the files are available in the src folder of the github repositoryhttps://github.com/timothyprojectGiG/JB_Math_TextbookEach chapter contains a JNB lab with solutions. Experienced teachers can modify these labs and create new labs tailored to their courses. The chapters were written by different authors/authorship teams, and as such, vary in style. Each chapter essentially can be read independently of the others as long as one has the pre-requisite mathematical knowledge. Some effort has been made to standardize the chapter formats, and the index may help the reader find specific topics of interest. There is virtually no limit to what can be done with JNBs, and we hope this work serves as a useful starting point for teachers and students to enrich and enliven the study of mathematics using this tool.The JNBs used to create this book contain special markdown code which are needed to produce features such as indexing, referencing, and highlight boxes in the Jupyter Book. Some editing of a downloaded JNB may may make it more suitable for classroom use.",
        "publisher": "Paul Isihara, Claire Wagner, Peter Jantsch, and Thomas VanDrunen",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-introduction-to-python-jupyter-notebooks-for-college-math-teachers"
    },
    {
        "title": "Professional Web Accessibility Auditing Made Easy",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Digital Education Strategies"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjI2LCJwdXIiOiJibG9iX2lkIn19--b7f36b2c8e95d50d518257c28e097f5a6b6e549d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ProWebAcc.png",
        "description": "Digital accessibility skills are in high demand, as the world becomes more aware of barriers in digital content that prevent some people from participating in a digital society. These are essential skills for web developers, and essential knowledge for organizations that want to ensure their web content is reaching the broadest audience possible.",
        "publisher": "Ryerson University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/professional-web-accessibility-auditing-made-easy"
    },
    {
        "title": "Signal Computing: Digital Signals in the Software Domain",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Michael D. Stiber, University of Washington Bothell",
            "Bilin Zhang Stiber, University of Washington Bothell",
            "Eric C. Larson, Southern Methodist University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE1NDUsInB1ciI6ImJsb2JfaWQifX0=--dbfcbd68073ec8986710d3a5b8d754d7ff410358/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/SignalComputing.jpg",
        "description": "In this book, you will learn how digital signals are captured, represented, processed, communicated, and stored in computers. The specific topics we will cover include: physical properties of the source information (such as sound or images), devices for information capture (microphones, cameras), digitization, compression, digital signal representation (JPEG, MPEG), digital signal processing (DSP), signal analysis and feature extraction via re-representation as functions of frequency, and network communication. By the end of this book, you should understand the problems and solutions facing signal computing systems development in the areas of data structures and algorithms, data analytics, feature extraction, information retrieval, user interfaces, and communications.",
        "publisher": "Michael Stiber, Eric Larson",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/signal-computing-digital-signals-in-the-software-domain"
    },
    {
        "title": "Combinatorics - Version 2.1",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Joy Morris, University of Lethbridge"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzkwNywicHVyIjoiYmxvYl9pZCJ9fQ==--a4fd75c0fd1617f499f53bb2ba85cc2abd7ece6b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-08-16%20at%203.12.10%20PM.png",
        "description": "Combinatoricsis an upper-level introductory course in enumeration, graph theory, and design theory.",
        "publisher": "Joy Morris",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/combinatorics"
    },
    {
        "title": "Computer Systems Security: Planning for Success",
        "copyright_year": null,
        "last_update": null,
        "authors": [
            "Ryan Tolboom, Newark, NJ"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "The text, labs, and review questions in this book are designed as an introduction to the applied topic of computer security. With these resources students will learn ways of preventing, identifying, understanding, and recovering from attacks against computer systems. This text also presents the evolution of computer security, the main threats, attacks and mechanisms, applied computer operation and security protocols, main data transmission and storage protection methods, cryptography, network systems availability, recovery, and business continuation procedures.",
        "publisher": "Ryan Tolboom",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/computer-systems-security-planning-for-success"
    },
    {
        "title": "Handbook of Software Engineering Methods - 2nd Edition",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Lara Letaw, Oregon State University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA1OTksInB1ciI6ImJsb2JfaWQifX0=--7584c74e0cac948c72afb69ded6e29c251b16020/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Software-Engineering-Methods-350x453.png",
        "description": "Software engineering can help people create sustainable, extensible programs that solve problems people care about.I won’t tell you how to be a software engineer; you’ll learn that over time by doing it. Instead, this book is about software engineering methods: Ways people achieve specific objectives in software engineering—that can save your project. My hope is that, after reading this book (or parts of it), you’ll feel better equipped for software engineering.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/handbook-of-software-engineering-methods"
    },
    {
        "title": "Mathematical Modeling and Simulation with MATLAB",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Sheldon Lee, La Crosse, WI",
            "Megan Buzby, Juneau, AK"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzgwNCwicHVyIjoiYmxvYl9pZCJ9fQ==--b098b6dbadbc0f3095d28c826b8451272b9ff681/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-07-07%20at%201.08.12%20PM.png",
        "description": "This textbook attempts to provide you with an overview of the commonly used basic mathematical models, as well as a wide range of applications. It offers a perspective that brings you back to the modeling process and the assumptions that go into it.",
        "publisher": "University of Alaska Southeast",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/mathematical-modeling-and-simulation-with-matlab"
    },
    {
        "title": "Making Games with Python & Pygame",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Al Sweigart"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjIzLCJwdXIiOiJibG9iX2lkIn19--85e1be9b513ace31872411323c7ae7c3f88b4d03/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781469901732.png",
        "description": "This book will teach you how to make graphical computer games in the Python programming language using the Pygame library.This book assumes you know a little bit about Python or programming in general. If you don’t know how to program, you can learn by downloading the free book 'Invent Your Own Computer Games with Python' from http://inventwithpython.com. Or you can jump right into this book and mostly pick it up along the way. This book is for the intermediate programmer who has learned what variables and loops are, but now wants to know, 'What do actual game programs look like?' There was a long gap after I first learned programming but didn’t really know how to use that skill to make something cool. It’s my hope that the games in this book will give you enough ideas about how programs work to provide a foundation to implement your own games.",
        "publisher": "Albert Sweigart",
        "language": "English",
        "isbn13": "9781469901732",
        "source": "https://open.umn.edu/opentextbooks/textbooks/making-games-with-python-pygame"
    },
    {
        "title": "Technology in Schools",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Gary L Ackerman, Greenfield, Massachusetts"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzc0MiwicHVyIjoiYmxvYl9pZCJ9fQ==--4f69db6c2729cbdef07035be26476c7b138ed307/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/TIS_web-2.png",
        "description": "My purpose in writing this book is to give readers a view into the work of managing information technology in schools. IT professionals will notice differences (some nuanced and some significant) between the needs and expectations of IT users in business and IT in school. With the more complete and more accurate concept the nature of the computing environment necessary for successful schooling, which I intend to provide through this book, IT professionals will be better prepared to meet those needs. Educators will also benefit from this book by clarifying the nature of their IT needs and how these may be different from those that are familiar to IT professionals who are hired to work in your school.",
        "publisher": "hackscience.education",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/technology-in-schools"
    },
    {
        "title": "Information Systems for Business and Beyond",
        "copyright_year": "2014",
        "last_update": "2019",
        "authors": [
            "David T. Bourgeois, Biola University",
            "James L. Smith",
            "Shouhong Wang",
            "Joseph Mortati"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE4OSwicHVyIjoiYmxvYl9pZCJ9fQ==--b9adc4fd35bc3c22f83fb6d106a6a8535f12af88/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/thumbnail.jpg",
        "description": "This book is written as an introductory text, meant for those with little or no experience with computers or information systems. While sometimes the descriptions can get a little bit technical, every effort has been made to convey the information essential to understanding a topic while not getting bogged down in detailed terminology or esoteric discussions.Information Systems for Business and Beyond was written by Dr. David Bourgeois and originally published in 2014 as part of the Open Textbook Challenge at the Saylor Foundation. Since then, it has been accessed thousands of time and used in many courses worldwide. This 2019 update to the textbook brings it up to date and adds many new topics. True to its open textbook roots, many of the updates have come from the community of instructors and practitioners who are passionate about information systems.Please note that the XML and MS Word links go to an earlier version.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/information-systems-for-business-and-beyond"
    },
    {
        "title": "Physical Modeling in MATLAB - Version 4.0",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Allen Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAyNzAsInB1ciI6ImJsb2JfaWQifX0=--ae3af7d16590843016706c6d6750ca8c4041be59/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-11-01%20at%203.00.55%20PM.png",
        "description": "Modeling and simulation are powerful tools for explaining the world, making predictions, designing things that work, and making them work better. Learning to use these tools can be difficult; this book is my attempt to make the experience as enjoyable and productive as possible.By reading this book — and working on the exercises — you will learn some programming, some modeling, and some simulation:With basic programming skills, you can create models for a wide range of physical systems.  My goal is to help you develop these skills in a way you can apply immediately to real-world problems.This book presents the entire modeling process, including model selection, analysis, simulation, and validation. I explain this process in Chapter 1, and there are examples throughout the book.Simulation is an approach to modeling that uses computer programs to implement models and generate predictions. This book shows how simulations are used to run experiments, answer questions, and guide decision-making.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/physical-modeling-in-matlab"
    },
    {
        "title": "Aprendiendo a Programar en Python con mi Computador: Primeros pasos rumbo a cómputos de gran escala en las Ciencias e Ingenierías",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Sergio Rojas, Universidad Simón Bolívar",
            "Héctor Fernández, Universidad de Oriente",
            "Juan Carlos Ruiz, Universidad de Oriente-Venezuela"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM4LCJwdXIiOiJibG9iX2lkIn19--e612ea97092db791c5f74a24f73cb395d643be46/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9789801286943.png",
        "description": "Este libro está dirigido, principalmente, a Estudiantes y Docentes que quieren aprender a programarcomo forma de fortalecer sus capacidades cognoscitivas y así obtener un beneficio adicional de su computador para lograr un mejor provecho de sus estudios. Dada la orientación del libro respecto a programar para resolver problemas asociados a las Ciencias e Ingenierías, el requisito mínimo de matemáticas que hemos elegido para presentar el contenido del mismo se cubre, normalmente, en el tercer año del bachillerato. No obstante, el requisito no es obligatorio para leer el libro en su totalidad y adquirir los conocimientos de programación obviando el contenido matemático.",
        "publisher": "LATIn Project",
        "language": "Spanish; Castilian",
        "isbn13": "9789801286943",
        "source": "https://open.umn.edu/opentextbooks/textbooks/aprendiendo-a-programar-en-python-con-mi-computador-primeros-pasos-rumbo-a-computos-de-gran-escala-en-las-ciencias-e-ingenierias"
    },
    {
        "title": "How to Think Like a Computer Scientist: C++ Version",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Allen B. Downey"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTUwLCJwdXIiOiJibG9iX2lkIn19--6443aaa5feb2ffb644bafec1f1ae284659ef7fe3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000HowComCpp.png",
        "description": "The goal of this book is to teach you to think like a computer scientist. I like the way computer scientists think because they combine some of the best features of Mathematics, Engineering, and Natural Science. Like mathematicians,computer scientists use formal languages to denote ideas (specifically computations). Like engineers, they design things, assembling components into systems and evaluating trade offs among alternatives. Like scientists, they observe the behavior of complex systems, form hypotheses, and test predictions.The single most important skill for a computer scientist is problem-solving. By that I mean the ability to formulate problems, think creatively about solutions, and express a solution clearly and accurately. As it turns out, the process of learning to program is an excellent opportunity to practice problem-solving skills. That’s why this chapter is called “The way of the program.”",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/how-to-think-like-a-computer-scientist-c-version"
    },
    {
        "title": "Inteligencia Artificial Aplicada a Procesamiento de Lenguaje Natural (NLP) con Python y Machine Learning.",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Lady Mariuxi Sangacha-Tapia, Instituto Superior Tecnológico del Azuay con condición de Superior Universitario",
            "Ricardo Javier Celi, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Ivan Leonel Acosta-Guzmán, Universidad de Guayaquil",
            "Eleanor Alexandra Varela-Tapia, Universidad de Guayaquil"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMyMzIsInB1ciI6ImJsb2JfaWQifX0=--58969e104ccdb5bfb59cddbd588eaec413a99391/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_88_88_coverImage_es_ES.png",
        "description": "Este libro refleja el trabajo realizado bajo investigación entre docentes investigadores con el afán de que sea útil al lector, el uso de predicciones al momento de entrenar un algoritmo clasificado de texto en procesamiento de lenguaje natural (PLN) basado en machine learning. Conformado de 4 capítulos con la utilidad para el inicio al mundo de la IA de la rama de procesamiento de lenguaje natural con Python en machine learning. El Capítulo 1 menciona conceptos y la evolución de las diferentes ramas de conocimiento que abarca la inteligencia artificial (AI), el entendimiento del NLP, machine learning, tipos de aprendizaje para resolver problemas como el supervisado, no supervisado y refuerzo. Capítulo 2 se profundiza el NLP conociendo los contenidos básicos de clasificación como: Las técnicas y diseño de LSTM, tokeización, stopword, lematización, bag of Word (part of speech tagging). Capítulo 3 es la estructuración de este capítulo el conocer las definiciones de los modelos de aprendizaje supervisado que son útiles en NLP orientado a la clasificación de texto. Capítulo 4 un caso de predicción o grado de asertividad del modelamiento de un algoritmo, la intención es demostrar la utilización de un modelo y varias técnicas aplicando NLP basado en machine learning.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651433",
        "source": "https://open.umn.edu/opentextbooks/textbooks/inteligencia-artificial-aplicada-a-procesamiento-de-lenguaje-natural-nlp-con-python-y-machine-learning"
    },
    {
        "title": "Ingeniería del Software II: Implementación, Pruebas y Mantenimiento",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Ricardo Javier Celi-Párraga, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Miguel Fabricio Boné-Andrade, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Aldo Patricio Mora-Olivero, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Juan Carlos Sarmiento-Saavedra, Universidad Técnica Luis Vargas Torres de Esmeraldas"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjY0MiwicHVyIjoiYmxvYl9pZCJ9fQ==--4850db82d0f4a43fb68a58d9e8aa65a22b5506a2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_20_20_coverImage_es_ES.jpg",
        "description": "En este libro se investigó los procesos de implementación, pruebas y mantenimiento de la ingeniería del software y se documentó los diferentes tipos de pruebas de software para validar el correcto funcionamiento de un software, se documentó también los procesos de evolución de un software para lograr un correcto mantenimiento del software. Este libro tiene como objetivo aplicar los conceptos y teorías de validación del software con el fin de crear de software de calidad, confiable, que se encuentre disponible, protegido y seguro, para que el profesional de sistemas informáticos sea capaz de gestionar con eficiencia y en ambientes éticos y de responsabilidad proyectos inmersos en la creación software. Se investigó varios libros llegando a realizar un compendio de las partes más importantes y se llegó a la conclusión de que la ingeniería del software proporciona varias técnicas para la evaluación y validación del software y varias metodologías para el desarrollo de software confiable y seguro que el profesional puede utilizar dependiendo las diferentes necesidades, situaciones o proyectos a desarrollar",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/ingenieria-del-software-ii-implementacion-pruebas-y-mantenimiento"
    },
    {
        "title": "Spatial Thinking in Planning Practice: An Introduction to GIS",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Yiping Fang, Portland State University, Portland, OR",
            "Vivek Shandas, Portland State University",
            "Eugenio Arriaga Cordero, Portland State University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkwLCJwdXIiOiJibG9iX2lkIn19--27178eaecf72c5539b1a2a032a4789dbc75ddcdc/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781312778986.png",
        "description": "The goals of this textbook are to help students acquire the technical skills of using software and managing a database, and develop research skills of collecting data, analyzing information and presenting results. We emphasize that the need to investigate the potential and practicality of GIS technologies in a typical planning setting and evaluate its possible applications. GIS may not be necessary (or useful) for every planning application, and we anticipate these readings to provide the necessary foundation for discerning its appropriate use. Therefore, this textbook attempts to facilitate spatial thinking focusing more on open-ended planning questions, which require judgment and exploration, while developing the analytical capacity for understanding a variety of local and regional planning challenges.While this textbook provides the background for understanding the concepts in GIS as applicable to urban and regional planning, it is best when accompanied by a hands-on tutorial, which will enable readers to develop an in-depth understanding of the specific planning applications of GIS. In the end of each chapter, we also provided several discussion questions, together with contextual applications through some web links.",
        "publisher": "Portland State University Library",
        "language": "English",
        "isbn13": "9781312778986",
        "source": "https://open.umn.edu/opentextbooks/textbooks/spatial-thinking-in-planning-practice-an-introduction-to-gis"
    },
    {
        "title": "Object-Oriented Reengineering Patterns",
        "copyright_year": "2008",
        "last_update": null,
        "authors": [
            "Serge Demeyer",
            "Stéphane Ducasse",
            "Oscar Nierstrasz"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTQ5LCJwdXIiOiJibG9iX2lkIn19--f9b1e10eabac83a2a8b249079e80eb94c3f1dcea/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000ObjReePat.png",
        "description": "The documentation is missing or obsolete, and the original developers have departed. Your team has limited understanding of the system, and unit tests are missing for many, if not all, of the components. When you fix a bug in one place, another bug pops up somewhere else in the system. Long rebuild times make any change difficult. All of these are signs of software that is close to the breaking point.Many systems can be upgraded or simply thrown away if they no longer serve their purpose. Legacy software, however, is crucial for operations and needs to be continually available and upgraded. How can you reduce the complexity of a legacy system sufficiently so that it can continue to be used and adapted at acceptable cost?Based on the authors' industrial experiences, this book is a guide on how to reverse engineer legacy systems to understand their problems, and then reengineer those systems to meet new demands. Patterns are used to clarify and explain the process of understanding large code bases, hence transforming them to meet new requirements. The key insight is that the right design and organization of your system is not something that can be evident from the initial requirements alone, but rather as a consequence of understanding how these requirements evolve.",
        "publisher": "Stéphane Ducasse",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/object-oriented-reengineering-patterns"
    },
    {
        "title": "Diseno e Implementación de Bases de Datos desde una Perspectiva Prática",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Héctor Cardona"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQyLCJwdXIiOiJibG9iX2lkIn19--187b0ab7be5260ad9516e0d91f22befeebe0d107/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000DisImpBas.png",
        "description": "Modelado Conceptual y Lógico de Bases de Datos a través de ejemplos",
        "publisher": "LATIn Project",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/diseno-e-implementacion-de-bases-de-datos-desde-una-perspectiva-pratica"
    },
    {
        "title": "Think DSP: Digital Signal Processing in Python",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Allen B. Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjMxLCJwdXIiOiJibG9iX2lkIn19--38d10feef65a363038817b2bd0b5556933814fdd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781491938454.png",
        "description": "Think DSPis an introduction to Digital Signal Processing in Python.The premise of this book (and the other books in the Think X series) is that if you know how to program, you can use that skill to learn other things. The author is writing this book because he thinks the conventional approach to digital signal processing is backward: most books (and the classes that use them) present the material bottom-up, starting with mathematical abstractions like phasors.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": "9781491938454",
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-dsp-digital-signal-processing-in-python"
    },
    {
        "title": "Relational Databases and Microsoft Access 365 - Version 4.0",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Ron McFadyen, University of Winnipeg"
        ],
        "subjects": [
            "Computer Science",
            "Databases"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE0MTQsInB1ciI6ImJsb2JfaWQifX0=--345c394fdeb91e2539e9a79a5f1c8967867d15c5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202024-03-25%20at%2011.44.47%20AM.png",
        "description": "This text is a free introductory text that introduces MS Access and relational database design. The motivation is to support an introductory database system course which, to the student, is either a service course providing an introduction to database concepts, or, as a prerequisite for more advanced study in the field.",
        "publisher": "Ron McFadyen",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/relational-databases-and-microsoft-access"
    },
    {
        "title": "Digital Circuit Projects: An Overview of Digital Circuits Through Implementing Integrated Circuits",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Charles W. Kann, Gettysburg College"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTg3LCJwdXIiOiJibG9iX2lkIn19--c1dd380e257c4ffa5a3c5fcdd923c7d093e85545/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000DigCirPro.png",
        "description": "Digital circuits, often called Integrated Circuits or ICs, are the central building blocks of a Central Processing Unit (CPU). To understand how a computer works, it is essential to understand the digital circuits which make up the CPU. This text introduces the most important of these digital circuits; adders, decoders, multiplexers, D flip-flops, and simple state machines.What makes this textbook unique is that it puts the ability to understand these circuits into the hands of anyone, from hobbyists to students studying Computer Science. This text is designed to teach digital circuits using simple projects the reader can implement. But unlike most lab manuals used in classes in Digital Circuits or Computer Organization classes, this textbook is designed to remove the barrier of a laboratory infrastructure needed in a face-to-face environment at a college or university. This textbook is designed to be used by the reader to create the circuits in their own homes. The textbook is free. The cost of the kits needed to do the labs is reasonable. And the projects are well documented and can be implemented by even novices to electronic projects.This text allows professors to add laboratory projects in digital circuits to students in online classes in Computer Organization. This enhances these classes with interesting and fun exercises that reinforce the classroom topics.This text can also be used by a hobbyist who wants to learn more about digital circuits and how computers work. The material is presented at a level that someone with no experience in digital circuits and electronics can successfully complete the projects, and gain an understanding of the circuits which go into making up a computer.",
        "publisher": "A.T. Still University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/digital-circuit-projects-an-overview-of-digital-circuits-through-implementing-integrated-circuits"
    },
    {
        "title": "The Discipline of Organizing: 4th Professional Edition",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "Robert J. Glushko"
        ],
        "subjects": [
            "Computer Science",
            "Databases",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTU3MCwicHVyIjoiYmxvYl9pZCJ9fQ==--d194a2f8a221da079e6bd5cdab0c423e48c10edb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/organize.jpg",
        "description": "We organize things, we organize information, we organize information about things, and we organize information about information. But even though “organizing” is a fundamental and ubiquitous challenge, when we compare these activities their contrasts are more apparent than their commonalities. We propose to unify many perspectives about organizing with the concept of an Organizing System, defined as an intentionally arranged collection of resources and the interactions they support. Every Organizing System involves a collection of resources, a choice of properties or principles used to describe and arrange resources, and ways of supporting interactions with resources. By comparing and contrasting how these activities take place in different contexts and domains, we can identify patterns of organizing. We can create a discipline of organizing in a disciplined way.The 4thedition builds a bridge between organizing and data science. It reframes descriptive statistics as organizing techniques, expands the treatment of classification to include computational methods, and incorporates many new examples of data-driven resource selection, organization, maintenance, and personalization. It introduces a new “data science” category of discipline-specific content, both in the chapter text and in endnotes, marked with [DS] in editions that contain endnotes.",
        "publisher": "University of California, Berkeley",
        "language": "English",
        "isbn13": "9780999797013",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-discipline-of-organizing-4th-professional-edition"
    },
    {
        "title": "MIPS Assembly Language Programming using QtSpim",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Ed Jorgensen, University of Nevada"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Njc5LCJwdXIiOiJibG9iX2lkIn19--d58e1a0054be2f52e442197d840f2be4fb2bd582/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000MIPSQTSPI.png",
        "description": "There are a number of excellent, comprehensive, and in-depth texts on MIPS assembly language programming. This is not one of them.The purpose of this text is to provide a simple and free reference for university level programming and architecture units that include a brief section covering MIPS assembly language programming. The text assumes usage of the QtSpim simulator. An appendix is included that covers the download, installation, and basic use of the QtSpim simulator.The scope of this text addresses basic MIPS assembly language programming including instruction set usage, stacks, procedure/function calls, QtSpim simulator system services, multiple dimension arrays, and basic recursion.",
        "publisher": "Ed Jorgensen",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/mips-assembly-language-programming-using-qtspim"
    },
    {
        "title": "Building Information - Representation and Management: Principles and Foundations for the Digital Era",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Alexander Koutamanis, Delft University of Technology"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzQ1MywicHVyIjoiYmxvYl9pZCJ9fQ==--4cad023823d7fdfe79a9513673212f288feded23/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_47_64_coverImage_en_US_t.png",
        "description": "The book presents a coherent theory of building information, focusing on its representation and management in the digital era. It addresses issues such as the information explosion and the structure of analogue building representations to propose a parsimonious approach to the deployment and utilization of symbolic digital technologies like BIM. It also considers the matching representation of AECO processes in terms of tasks, so as to connect to information processing and support both information management and decision taking.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463665155",
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-information-representation-and-management-principles-and-foundations-for-the-digital-era"
    },
    {
        "title": "Open Data Structures: An Introduction",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "Pat Morin, Carleton University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQzLCJwdXIiOiJibG9iX2lkIn19--1520472c7fea8a12a5a17731dec2f4d4157954b5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781927356388.png",
        "description": "Offered as an introduction to the field of data structures and algorithms,Open Data Structurescovers the implementation and analysis of data structures for sequences (lists), queues, priority queues, unordered dictionaries, ordered dictionaries, and graphs. Focusing on a mathematically rigorous approach that is fast, practical, and efficient, Morin clearly and briskly presents instruction along with source code.Analyzed and implemented in Java, the data structures presented in the book include stacks, queues, deques, and lists implemented as arrays and linked-lists; space-efficient implementations of lists; skip lists; hash tables and hash codes; binary search trees including treaps, scapegoat trees, and red-black trees; integer searching structures including binary tries, x-fast tries, and y-fast tries; heaps, including implicit binary heaps and randomized meldable heaps; graphs, including adjacency matrix and adjacency list representations; and B-trees.A modern treatment of an essential computer science topic,Open Data Structuresis a measured balance between classical topics and state-of-the art structures that will serve the needs of all undergraduate students or self-directed learners.",
        "publisher": "Athabasca University Press",
        "language": "English",
        "isbn13": "9781927356388",
        "source": "https://open.umn.edu/opentextbooks/textbooks/open-data-structures-an-introduction"
    },
    {
        "title": "Web Accessibility for Developers",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Digital Education Strategies"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjI0LCJwdXIiOiJibG9iX2lkIn19--b95d8b8f382f158f1cbb3efb2de171f8fc2bcf4c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000WebAccDev.jpg",
        "description": "Web Accessibility for Developers is a technical book aimed primarily at programmers. Learn how to develop accessible interactivity on the Web and gain expertise using WAI-ARIA, a W3C specification that enables optimal use of assistive technologies, like screen readers, when navigating the Web.",
        "publisher": "Ryerson University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/web-accessibility-for-developers"
    },
    {
        "title": "Unmanned Aircraft Systems in the Cyber Domain - Second Edition",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Randall K. Nichols, Kansas State University",
            "Hans C. Mumm, California University of Pennsylvania",
            "Wayne D. Lonstein, VFT Solutions"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzMywicHVyIjoiYmxvYl9pZCJ9fQ==--ad673d7e7d253ff928e3c2d2923066871160efe5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/cyberdomain.png",
        "description": "Unmanned Aircraft Systems are an integral part of the US national critical infrastructure. The authors have endeavored to bring a breadth and quality of information to the reader that is unparalleled in the unclassified sphere. This textbook will fully immerse and engage the reader / student in the cyber-security considerations of this rapidly emerging technology that we know as unmanned aircraft systems (UAS). The first edition topics covered National Airspace (NAS) policy issues, information security (INFOSEC), UAS vulnerabilities in key systems (Sense and Avoid / SCADA), navigation and collision avoidance systems, stealth design, intelligence, surveillance and reconnaissance (ISR) platforms; weapons systems security; electronic warfare considerations; data-links, jamming, operational vulnerabilities and still-emerging political scenarios that affect US military / commercial decisions.",
        "publisher": "New Prairie Press",
        "language": "English",
        "isbn13": "9781944548155",
        "source": "https://open.umn.edu/opentextbooks/textbooks/unmanned-aircraft-systems-in-the-cyber-domain-second-edition-nichols"
    },
    {
        "title": "Introduction to Statistical Thinking",
        "copyright_year": "2010",
        "last_update": null,
        "authors": [
            "Benjamin Yakir, The Hebrew University of Jerusalem"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjc4NSwicHVyIjoiYmxvYl9pZCJ9fQ==--67a8f85c4edd0ab5b62cc08469637e0675c9470a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Introwbdj.JPG",
        "description": "The target audience for this book is college students who are required to learn statistics, students with little background in mathematics and often no motivation to learn more. It is assumed that the students do have basic skills in using computers and have access to one. Moreover, it is assumed that the students are willing to actively follow the discussion in the text, to practice, and more importantly, to think.Teaching statistics is a challenge. Teaching it to students who are required to learn the subject as part of their curriculum, is an art mastered by few. In the past I have tried to master this art and failed. In desperation, I wrote this book.This book uses the basic structure of generic introduction to statistics course. However, in some ways I have chosen to diverge from the traditional approach. One divergence is the introduction of R as part of the learning process. Many have used statistical packages or spreadsheets as tools for teaching statistics. Others have used R in advanced courses. I am not aware of attempts to use R in introductory level courses. Indeed, mastering R requires much investment of time and energy that may be distracting and counterproductive for learning more fundamental issues. Yet, I believe that if one restricts the application of R to a limited number of commands, the benefits that R provides outweigh the difficulties that R engenders.Another departure from the standard approach is the treatment of probability as part of the course. In this book I do not attempt to teach probability as a subject matter, but only specific elements of it which I feel are essential for understanding statistics. Hence, Kolmogorov’s Axioms are out as well as attempts to prove basic theorems and a Balls and Urns type of discussion. On the other hand, emphasis is given to the notion of a random variable and, in that context, the sample space.",
        "publisher": "Benjamin Yakir",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-statistical-thinking"
    },
    {
        "title": "Think Raku: How to Think Like a Computer Scientist - 2nd edition",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Laurent Rosenfeld",
            "Allen B. Downey, Olin College"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQzNSwicHVyIjoiYmxvYl9pZCJ9fQ==--64ffe9a7435e0c38e4f1800c7b62aef490e8acb1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/thinkperl6.jpg",
        "description": "The title of this book was originallyThink Perl 6,but since Perl 6 has been renamed Raku, we have also changed the title of the book.Think Rakuis an introduction to computer science and programming intended for people with little or no experience.This aim of this book is not primarily to teach Raku, but instead to teach the art of programming, using the Raku language. After having  completed this book, you should hopefully be able  to write programs to solve relatively difficult problems in Raku, but my main aim is to teach computer science, software programming, and problem solving rather than solely to teach the Raku language itself.Think Rakuis a free book available under a Creative Commons license. Readers are free to copy and distribute the text; they are also free to modify it, which allows them to adapt the book to different needs, and to help develop new material.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": "9781491980552",
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-raku-how-to-think-like-a-computer-scientist-2nd-edition"
    },
    {
        "title": "Introduction to Programming Using Java - Eighth Edition",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [
            "David J. Eck, Hobart and William Smith Colleges"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Njg2LCJwdXIiOiJibG9iX2lkIn19--312b4241818dbe9ec563584b8e88ebdf09568d5c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ProUsiJav.png",
        "description": "Welcome to the Eighth Edition of Introduction to Programming Using Java, a free, on-line textbook on introductory programming, which uses Java as the language of instruction. This book is directed mainly towards beginning programmers, although it might also be useful for experienced programmers who want to learn something about Java. It is not meant to provide complete coverage of the Java language.The eighth edition requires Java 8 or later, and it uses JavaFX for GUI programming. Version 8.1 is a small update of Version 8.0. This version briefly covers some of the new features in Java 11 and makes it clearer how to use this book with Java 11 and later.",
        "publisher": "David J. Eck",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-programming-using-java-seventh-edition"
    },
    {
        "title": "Evolución del Computador desde el ABC de su Arquitectura hasta la Construcción de una PC Gamer",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Gerardo Alfredo Solano-Gutiérrez, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Luis Alfonso Núñez-Freire, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "José Javier Mendoza-Loor, Universidad Técnica Luis Vargas Torres de Esmeraldas"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjYzOCwicHVyIjoiYmxvYl9pZCJ9fQ==--d858c24b8b51a133e80222115818d09ca1710e27/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_24_24_coverImage_es_ES.jpg",
        "description": "El libro es una obra completa que aborda distintos aspectos importantes de la informática, desde la arquitectura y organización de la computadora hasta la construcción de una PC gamer. En el primer capítulo se explica de manera detallada la arquitectura y organización de los ordenadores, mientras que en el segundo se analizan las diferentes generaciones de ordenadores y su evolución a lo largo del tiempo, llegando hasta la inteligencia artificial. El tercer capítulo está dedicado a la memoria de la computadora y su funcionamiento, mientras que en el cuarto se explican las herramientas necesarias para el mantenimiento y la reparación de la PC, desde la clonación de discos duros hasta la construcción de dispositivos multi boot. Por último, el quinto capítulo se enfoca en las PC gamer's y ofrece una guía completa para los entusiastas de los juegos, brindando un procedimiento paso a paso para construir su propio PC gamer. Este libro es valioso tanto para estudiantes de sistemas como para profesionales de la computación, ya que cubre temas fundamentales como la arquitectura y organización de computadoras, historia y evolución, el diseño de computadoras, la memoria, las herramientas de mantenimiento y reparación de computadoras, y cómo armar una computadora de mayor rendimiento para usuarios jugadores. En resumen, esta obra ofrece información útil y completa sobre la evolución de la computadora, desde sus inicios hasta la actualidad, y brinda herramientas y consejos prácticos para su uso y mantenimiento",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942711915",
        "source": "https://open.umn.edu/opentextbooks/textbooks/evolucion-del-computador-desde-el-abc-de-su-arquitectura-hasta-la-construccion-de-una-pc-gamer"
    },
    {
        "title": "Operating Systems and Middleware: Supporting Controlled Interaction",
        "copyright_year": "2011",
        "last_update": "2019",
        "authors": [
            "Max Hailperin, Gustavus Adolphus College"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjU0LCJwdXIiOiJibG9iX2lkIn19--ee779c595746c9b3526124a5da920a2f7b57ef83/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000OpSysMidd.png",
        "description": "In this book, you will learn about all three kinds of interaction. In all three cases, interesting software techniques are needed in order to bring the computations into contact, yet keep them suffciently at arm's length that they don't compromise each other's reliability. The exciting challenge, then, is supporting controlled interaction. This includes support for computations that share a single computer and interact with one another, as your email and word processing programs do. It also includes support for data storage and network communication. This book describes how all these kinds of support are provided both by operating systems and by additional software layered on top of operating systems, which is known as middleware.Chapter 1 provides an overview of the text as a whole, explaining what an operating system is, what middleware is, and what sorts of support these systems provide for controlled interaction.The next nine chapters work through the varieties of controlled interac- tion that are exemplified by the scenario at the beginning of the preface: in- teraction between concurrent computations on the same system (as between your email program and your word processor), interaction across time (as between your word processor before your trip and your word processor after your trip), and interaction across space (as between your email program and your service provider's email server).The first of these three topics is controlled interaction between computa- tions operating at one time on a particular computer. Before such interaction can make sense, you need to understand how it is that a single computer can be running more than one program, such as an email program in one window and a word processing program in another. Therefore, Chapter 2 explains the fundamental mechanism for dividing a computer's attention between concurrent computations, known as threads. Chapter 3 continues with the related topic of scheduling. That is, if the computer is dividing its time between computations, it needs to decide which ones to work on at any moment.With concurrent computations explained, Chapter 4 introduces con- trolled interactions between them by explaining synchronization, which is control over the threads' relative timing. For example, this chapter explains how, when your email program sends a document to your word processor, the word processor can be constrained to read the document only after the email program writes it. One particularly important form of synchroniza- tion, atomic transactions, is the topic of Chapter 5. Atomic transactions are groups of operations that take place as an indivisible unit; they are most commonly supported by middleware, though they are also playing an increasing role in operating systems.Other than synchronization, the main way that operating systems con- trol the interaction between computations is by controlling their access to memory. Chapter 6 explains how this is achieved using the technique known as virtual memory. That chapter also explains the many other objectives this same technique can serve. Virtual memory serves as the foundation for Chapter 7's topic, which is processes. A process is the fundamental unit of computation for protected access, just as a thread is the fundamental unit of computation for concurrency. A process is a group of threads that share a protection environment; in particular, they share the same access to virtual memory.The next three chapters move outside the limitations of a single com- puter operating in a single session. First, consider the document stored before a trip and available again after it. Chapter 8 explains persistent storage mechanisms, focusing particularly on the file storage that operat- ing systems provide. Second, consider the interaction between your email program and your service provider's email server. Chapter 9 provides an overview of networking, including the services that operating systems make available to programs such as the email client and server. Chapter 10 ex- tends this discussion into the more sophisticated forms of support provided by communication middleware, such as messaging systems, RMI, and web services.Finally, Chapter 11 focuses on security. Because security is a pervasive issue, the preceding ten chapters all provide some information on it as well. Specifically, the final section of each chapter points out ways in which se- curity relates to that chapter's particular topic. However, even with that coverage distributed throughout the book, a chapter specifically on security is needed, primarily to elevate it out of technical particulars and talk about general principles and the human and organizational context surrounding the computer technology.The best way to use these chapters is in consecutive order. However, Chapter 5 can be omitted with only minor harm to Chapters 8 and 10, and Chapter 9 can be omitted if students are already suffciently familiar with networking.",
        "publisher": "Max Hailperin",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/operating-systems-and-middleware-supporting-controlled-interaction"
    },
    {
        "title": "Deleting Dystopia: Re-Asserting Human Priorities in the Age of Surveillance Capitalism",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Richard A. Slaughter, Foresight International"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjkwMCwicHVyIjoiYmxvYl9pZCJ9fQ==--7a0868c2c8811ca010b8b4ca98f371e8454724fc/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/T353650-Deleting-Dystopia-Book-Cover-683x1024.png",
        "description": "Deleting Dystopia confirms that the existential threats posted by the misuse of advanced digital technologies are real. But, in place of apathy and fatalism, Slaughter explores ways of understanding the threat, conceptualising solutions and identifying strategies that lead away from digital authoritarian futures towards those funded on humanly viable values and practices.",
        "publisher": "University of Southern Queensland",
        "language": "English",
        "isbn13": "9780648769873",
        "source": "https://open.umn.edu/opentextbooks/textbooks/deleting-dystopia-re-asserting-human-priorities-in-the-age-of-surveillance-capitalism"
    },
    {
        "title": "Culturally Responsive Computing: An Introduction into Computer Science, Security, and Technology",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Devan J. Walton, Northern Essex Community College"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI4NTksInB1ciI6ImJsb2JfaWQifX0=--7414fe1bdeb1d6ebb6316739228357e97a2bec30/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover_RotelProject_NECC_Cultural-Responsive_Computing-Walton-768x994.jpg",
        "description": "'Culturally Responsive Computing' is an essential textbook that explores the intricate relationship between technology and global societies. It gives students and professionals a deep understanding of how cultural contexts shape and are shaped by computing practices, from algorithm design to user interface development. This book equips readers with the knowledge and skills to create inclusive, ethical, and culturally sensitive technological solutions for our diverse world.",
        "publisher": "ROTEL",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/culturally-responsive-computing-an-introduction-into-computer-science-security-and-technology"
    },
    {
        "title": "Temas de Diseño en Interacción Humano-Computadora",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Jaime Muñoz Arteaga",
            "Yosly Caridad Hernández",
            "Viviana Bustos Amador"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQwLCJwdXIiOiJibG9iX2lkIn19--f34bf0fb43a0ed078a21fc9dc3e56eb136a44288/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000TemDisInt.png",
        "description": "El nivel académico que pretende abordar el libro es en las diferentes licenciaturas e ingenierías que consideren tópicos en el área de interacción humano computadora, así como los posgrados relacionados con la temática. El libro describe diferentes tipos de interacción que pueden ofrecer las aplicaciones interactivas donde a través de la interfaz gráfica es posible guiar y hacer fácil la tarea del usuario. Así pues, el lector puede encontrar diferentes trabajos que especifican desde los requerimientos del usuario hasta el diseño, programación y evaluación de distintas aplicaciones interactivas.",
        "publisher": "LATIn Project",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/temas-de-diseno-en-interaccion-humano-computadora"
    },
    {
        "title": "Ingeniería del Software I: Requerimientos y Modelado del Software",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Ricardo Javier Celi-Párraga, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Miguel Fabricio Boné-Andrade, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Aldo Patricio Mora-Olivero, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Juan Carlos Sarmiento-Saavedra, Universidad Técnica Luis Vargas Torres de Esmeraldas"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjY0MCwicHVyIjoiYmxvYl9pZCJ9fQ==--125ab21667728673cf8cfc477647691e1bf6302f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_21_21_coverImage_es_ES.jpg",
        "description": "En este libro se investigó los fundamentos de la ingeniería del software y se documentó los conceptos básicos del software y los procesos para la creación de software, se documentó también cómo llevar a cabo un análisis de requerimientos de software, cuáles son los tipos de requerimientos, cómo obtenerlos, documentarlos, validarlos y modelarlos mediante diferentes tipos de diagramas. Este libro tiene como objetivo aplicar los conceptos y teorías de administración para la creación de software de calidad mediante las diferentes metodologías, técnicas y herramientas de la ingeniería del software para que el profesional de sistemas informáticos sea capaz de gestionar con eficiencia y en ambientes éticos y de responsabilidad proyectos inmersos en la creación software. Se investigó varios libros llegando a realizar un compendio de las partes más importantes y se llegó a la conclusión de que la ingeniería del software proporciona varias metodologías para el desarrollo del software y varios modelos para el diseño de software que el profesional puede utilizar dependiendo las diferentes necesidades o las diferentes situaciones o proyectos a desarrollar.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/ingenieria-del-software-i-requerimientos-y-modelado-del-software"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Japanese) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxMCwicHVyIjoiYmxvYl9pZCJ9fQ==--c5b7a06712a9576fa170cebda41c7c7beeb680af/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Japanese",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-japanese"
    },
    {
        "title": "Fortalecimiento Metodológico de la Seguridad Informática en Posgrados: Análisis y Estrategias de Mejora",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Juan Antonio Picoy-Gonzales, Universidad Nacional de Huancavelica",
            "Rosaura Huarcaya-Taype, Universidad Nacional de Huancavelica",
            "Omar Hans Contreras-Canto, Universidad Nacional Hermilio Valdizan",
            "Amanda Omonte-Vilca, Universidad Nacional Hermilio Valdizan"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2MzAsInB1ciI6ImJsb2JfaWQifX0=--156915b3c04051053e7bf90c506e0026c539a707/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_56_56_coverImage_es_ES.jpg",
        "description": "El libro de investigación, contiene el informe sistematizado sobre el análisis de riesgos de la seguridad de la información para la Universidad Nacional Hermilio Valdizán de Huánuco, tuvo como objetivo realizar el análisis de riesgos que permita generar controles para minimizar la probabilidad de ocurrencia e impacto de los riesgos asociados con las vulnerabilidades y amenazas de seguridad de la información existentes en la Universidad Nacional Hermilio Valdizán de Huánuco. El método aplicado tuvo la finalidad de profundizar el análisis e interpretación de los resultados en donde se utilizó el tipo de investigación aplicada de diseño no experimental, descriptivo, se trabajó con una muestra total de los activos informáticos de la Universidad Nacional Hermilio Valdizán de Huánuco, seleccionados mediante el tipo de muestreo no probabilístico intencional. Para estimar los estadígrafos se usó la estadística descriptiva e inferencial. Obteniendo como resultado la disminución del riesgo actual de los activos informáticos a su nivel mínimo.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651129",
        "source": "https://open.umn.edu/opentextbooks/textbooks/fortalecimiento-metodologico-de-la-seguridad-informatica-en-posgrados-analisis-y-estrategias-de-mejora"
    },
    {
        "title": "Fast Fourier Transforms",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "C. Sidney Burrus, Rice University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjEyLCJwdXIiOiJibG9iX2lkIn19--7751c7455954fca99b081e4da75625dde1fb1355/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000FaFouTran.png",
        "description": "This book focuses on the discrete Fourier transform (DFT), discrete convolution, and, particularly, the fast algorithms to calculate them. These topics have been at the center of digital signal processing since its beginning, and new results in hardware, theory and applications continue to keep them important and exciting. This book uses an index map, a polynomial decomposition, an operator factorization, and a conversion to a filter to develop a very general and efficient description of fast algorithms to calculate the discrete Fourier transform (DFT). The work of Winograd is outlined, chapters by Selesnick, Pueschel, and Johnson are included, and computer programs are provided.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/fast-fourier-transforms"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Ukranian) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYyMSwicHVyIjoiYmxvYl9pZCJ9fQ==--dd5fb098efba99f54c48f8ee8beead2ededf7c13/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Ukrainian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-ukranian"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (Chinese) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scott Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxNCwicHVyIjoiYmxvYl9pZCJ9fQ==--229d0f7efdd0d775fe2e99c28a4eec3188348242/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "Chinese",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-chinese"
    },
    {
        "title": "Inventory Analytics",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Roberto Rossi, University of Edinburgh"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjQwNiwicHVyIjoiYmxvYl9pZCJ9fQ==--d4776ff53f9811ff3c9110d3d868413a3c447fb7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/inventory_analytics-min.jpg",
        "description": "Inventory Analytics provides a comprehensive and accessible introduction to the theory and practice of inventory control – a significant research area central to supply chain planning. The book outlines the foundations of inventory systems and surveys prescriptive analytics models for deterministic inventory control. It further discusses predictive analytics techniques for demand forecasting in inventory control and also examines prescriptive analytics models for stochastic inventory control.Inventory Analytics is the first book of its kind to adopt a practicable, Python-driven approach to illustrating theories and concepts via computational examples, with each model covered in the book accompanied by its Python code. Originating as a collection of self-contained lectures, Inventory Analytics will be an indispensable resource for practitioners, researchers, teachers, and students alike.",
        "publisher": "Roberto Rossi",
        "language": "English",
        "isbn13": "9781800641778",
        "source": "https://open.umn.edu/opentextbooks/textbooks/inventory-analytics"
    },
    {
        "title": "A Byte of Python",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "Swaroop C H"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTA0LCJwdXIiOiJibG9iX2lkIn19--c7854918d8c5eb4d328d3db4d744945f00510adb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000ByteOPyto.png",
        "description": "'A Byte of Python' is a free book on programming using the Python language. It serves as a tutorial or guide to the Python language for a beginner audience. If all you know about computers is how to save text files, then this is the book for you.",
        "publisher": "Swaroop C H",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-byte-of-python"
    },
    {
        "title": "A Primer for Computational Biology",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Shawn T. O'Neil, Oregon State University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMwMSwicHVyIjoiYmxvYl9pZCJ9fQ==--56e4ef31ad0e4fac674557ca6a92edb2da0fa8c7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/primercompbio.jpg",
        "description": "A Primer for Computational Biology aims to provide life scientists and students the skills necessary for research in a data-rich world. The text covers accessing and using remote servers via the command-line, writing programs and pipelines for data analysis, and provides useful vocabulary for interdisciplinary work. The book is broken into three parts:Introduction to Unix/Linux: The command-line is the “natural environment” of scientific computing, and this part covers a wide range of topics, including logging in, working with files and directories, installing programs and writing scripts, and the powerful “pipe” operator for file and data manipulation.Programming in Python: Python is both a premier language for learning and a common choice in scientific software development. This part covers the basic concepts in programming (data types, if-statements and loops, functions) via examples of DNA-sequence analysis. This part also covers more complex subjects in software development such as objects and classes, modules, and APIs.Programming in R: The R language specializes in statistical data analysis, and is also quite useful for visualizing large datasets. This third part covers the basics of R as a programming language (data types, if-statements, functions, loops and when to use them) as well as techniques for large-scale, multi-test analyses. Other topics include S3 classes and data visualization with ggplot2.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-primer-for-computational-biology"
    },
    {
        "title": "Producing Open Source Software: How to Run a Successful Free Software Project - 2nd Edition",
        "copyright_year": "2005",
        "last_update": null,
        "authors": [
            "Karl Fogel"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYyNiwicHVyIjoiYmxvYl9pZCJ9fQ==--ae3ff73915e9edbfe5ccc2216abeb0c73495f1dc/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJnaWYiLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--594557d36c3f508bc529db24c3db0a3a3db6d74d/producingoss-cover-small.gif",
        "description": "Producing Open Source Softwareis a book about the human side of open source development. It describes how successful projects operate, the expectations of users and developers, and the culture of free software. The book is released under anopen copyright. You can buy it in bookstores,order copies from O'Reilly Media, or browse and download it here.",
        "publisher": "Karl Fogel",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/producing-open-source-software-how-to-run-a-successful-free-software-project"
    },
    {
        "title": "The Missing Link: An Introduction to Web Development and Programming",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Michael Mendez"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTY2LCJwdXIiOiJibG9iX2lkIn19--494bb486f18b3295fc0557668ed25ec6c4bd6e65/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780989722650.png",
        "description": "Web development is an evolving amalgamation of languages that work in concert to receive, modify, and deliver information between parties using the Internet as a mechanism of delivery. While it is easy to describe conceptually, implementation is accompanied by an overwhelming variety of languages, platforms, templates, frameworks, guidelines, and standards. Navigating a project from concept to completion often requires more than mastery of one or two complementing languages, meaning today's developers need both breadth, and depth, of knowledge to be effective.This text provides the developer with an understanding of the various elements of web development by focusing on the concepts and fundamentals through the examples within, providing a foundation that allows easier transition to other languages and a better understanding of how to approach their work. The reader will be introduced to topics in a manner that follows most project development methods, from initial conceptualization and design through front end development, back end development, and introducing additional concepts like accessibility and security, while focusing on responsive design techniques. Each section of the text includes opportunities to practice the material and assess increased knowledge after examining the topics.",
        "publisher": "Open SUNY",
        "language": "English",
        "isbn13": "9781502447968",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-missing-link-an-introduction-to-web-development-and-programming"
    },
    {
        "title": "A First Course in Electrical and Computer Engineering",
        "copyright_year": "2009",
        "last_update": null,
        "authors": [
            "Louis Scharf, Colorado State University"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "This book was written for an experimental freshman course at the University of Colorado. The course is now an elective that the majority of our electrical and computer engineering students take in the second semester of their freshman year, just before their first circuits course. Our department decided to offer this course for several reasons:we wanted to pique student' interest in engineering by acquainting them with engineering teachers early in their university careers and by providing with exposure to the types of problems that electrical and computer engineers are asked to solve;we wanted students entering the electrical and computer engineering programs to be prepared in complex analysis, phasors, and linear algebra, topics that are of fundamental importance in our discipline;we wanted students to have an introduction to a software application tool, such as MATLAB, to complete their preparation for practical and efficient computing in their subsequent courses and in their professional careers;we wanted students to make early contact with advanced topics like vector graphics, filtering, and binary coding so that they would gain a more rounded picture of modern electrical and computer engineering.In order to introduce this course, we had to sacrifice a second semester of Pascal programming. We concluded that the sacrifice was worth making because we found that most of our students were prepared for high-level language computing after just one semester of programming.We believe engineering educators elsewhere are reaching similar conclusions about their own students and curriculums. We hope this book helps create a much needed dialogue about curriculum revision and that it leads to the development of similar introductory courses that encourage students to enter and practice our craft.Students electing to take this course have completed one semester of calculus, computer programming, chemistry, and humanities.Concurrently with this course, students take physics and a second semester of calculus, as well as a second semester in the humanities. By omitting the advanced topics marked by asterisks, we are able to cover Complex Numbers through Linear Algebra, plus two of the three remaining chapters. The book is organized so that the instructor can select any two of the three. If every chapter of this book is covered, including the advanced topics, then enough material exists for a two-semester course.The first three chapters of this book provide a fairly complete coverage of complex numbers, the functions e^x and e^j\u0002and phasors. Our department philosophy is that these topics must be understood if a student is to succeed in electrical and computer engineering. These three chapters may also be used as a supplement to a circuits course. A measured pace of presentation, taking between sixteen and eighteen lectures, is sufficient to cover all but the advanced sections in Complex Numbers through Phasors.The chapter on 'linear algebra' is prerequisite for all subsequent chapters. We use eight to ten lectures to cover it. We devote twelve to sixteen lectures to cover topics from Vector Graphics through Binary Codes. (We assume a semester consisting of 42 lectures and three exams.) The chapter on vector graphics applies the linear algebra learned in the previous chapter to the problem of translating, scaling, and rotating images. 'Filtering' introduces the student to basic ideas in averaging and filtering. The chapter on 'Binary Codes' covers the rudiments of binary coding, including Huffman codes and Hamming codes.If the users of this book find 'Vector Graphics' through 'Binary Codes' too confining, we encourage them to supplement the essential material in 'Complex Numbers' through 'Linear Algebra' with their own course notes on additional topics. Within electrical and computer engineering there are endless possibilities. Practically any set of topics that can be taught with conviction and enthusiasm will whet the student's appetite. We encourage you to write to us or to our editor, Tom Robbins, about your ideas for additional topics. We would like to think that our book and its subsequent editions will have an open architecture that enables us to accommodate a wide range of student and faculty interests.Throughout this book we have used MATLAB programs to illustrate key ideas. MATLAB is an interactive, matrix-oriented language that is ideally suited to circuit analysis, linear systems, control theory, communications, linear algebra, and numerical analysis. MATLAB is rapidly becoming a standard software tool in universities and engineering companies. (For more information about MATLAB, return the attached card in the back of this book to The MathWorks, Inc.) MATLAB programs are designed to develop the student's ability to solve meaningful problems, compute, and plot in a high-level applications language. Our students get started in MATLAB by working through “An Introduction to MATLAB,” while seated at an IBM PC (or look-alike) or an Apple Macintosh. We also have them run through the demonstration programs in 'Complex Numbers'. Each week we give three classroom lectures and conduct a one-hour computer lab session. Students use this lab session to hone MATLAB skills, to write programs, or to conduct the numerical experiments that are given at the end of each chapter. We require that these experiments be carried out and then reported in a short lab report that contains (i) introduction, (ii) analytical computations, (iii) computer code, (iv) experimental results, and (v) conclusions. The quality of the numerical results and the computer graphics astonishes students. Solutions to the chapter problems are available from the publisher for instructors who adopt this text for classroom use.We wish to acknowledge our late colleague Richard Roberts, who encouraged us to publish this book, and Michael Lightner and Ruth Ravenel, who taught 'Linear Algebra' and 'Vector Graphics' and offered helpful suggestions on the manuscript. We thank C. T. Mullis for allowing us to use his notes on binary codes to guide our writing of 'Binary Codes'. We thank Cédric Demeure and Peter Massey for their contributions to the writing of 'An Introduction to MATLAB' and 'The Edix Editor'. We thank Tom Robbins, our editor at Addison-Wesley, for his encouragement, patience, and many suggestions. We are especially grateful to Julie Fredlund, who composed this text through many drafts and improved it in many ways. We thank her for preparing an excellent manuscript for production.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-first-course-in-electrical-and-computer-engineering"
    },
    {
        "title": "Evidence-based Software Engineering",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Derek M. Jones"
        ],
        "subjects": [
            "Computer Science",
            "Databases"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzI4MywicHVyIjoiYmxvYl9pZCJ9fQ==--cd1f340cfd8195698a5bccbf4417c2a2445a6003/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/ESEUR-Cover_630-446.jpg",
        "description": "This book discusses what is currently known about software engineering, based on an analysis of all the publicly available data. This aim is not as ambitious as it sounds, because there is not a great deal of data publicly available.The intent is to provide material that is useful to professional developers working in industry; until recently researchers in software engineering have been more interested in vanity work, promoted by ego and bluster.The material is organized in two parts, the first covering software engineering and the second the statistics likely to be needed for the analysis of software engineering data.",
        "publisher": "Knowledge Software",
        "language": "English",
        "isbn13": "9781838291303",
        "source": "https://open.umn.edu/opentextbooks/textbooks/evidence-based-software-engineering"
    },
    {
        "title": "Programming Persistent Memory: A Comprehensive Guide for Developers",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Stteve Scargall"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxNywicHVyIjoiYmxvYl9pZCJ9fQ==--2240dd4e7b440f5a142b100dde288cb2ed6c7686/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-03-13%20at%201.09.35%20PM.png",
        "description": "Beginning and experienced programmers will use this comprehensive guide to persistent memory programming. You will understand how persistent memory brings together several new software/hardware requirements, and offers great promise for better performance and faster application startup times—a huge leap forward in byte-addressable capacity compared with current DRAM offerings.This revolutionary new technology gives applications significant performance and capacity improvements over existing technologies. It requires a new way of thinking and developing, which makes this highly disruptive to the IT/computing industry. The full spectrum of industry sectors that will benefit from this technology include, but are not limited to, in-memory and traditional databases, AI, analytics, HPC, virtualization, and big data.Programming Persistent Memorydescribes the technology and why it is exciting the industry. It covers the operating system and hardware requirements as well as how to create development environments using emulated or real persistent memory hardware. The book explains fundamental concepts; provides an introduction to persistent memory programming APIs for C, C++, JavaScript, and other languages; discusses RMDA with persistent memory; reviews security features; and presents many examples. Source code and examples that you can run on your own systems are included.What You’ll LearnUnderstand what persistent memory is, what it does, and the value it brings to the industryBecome familiar with the operating system and hardware requirements to use persistent memoryKnow the fundamentals of persistent memory programming: why it is different from current programming methods, and what developers need to keep in mind when programming for persistenceLook at persistent memory application development by example using the Persistent Memory Development Kit (PMDK)Design and optimize data structures for persistent memoryStudy how real-world applications are modified to leverage persistent memoryUtilize the tools available for persistent memory programming, application performance profiling, and debuggingWho This Book Is ForC, C++, Java, and Python developers, but will also be useful to software, cloud, and hardware architects across a broad spectrum of sectors, including cloud service providers, independent software vendors, high performance compute, artificial intelligence, data analytics, big data, etc.",
        "publisher": "Apress",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/programming-persistent-memory-a-comprehensive-guide-for-developers"
    },
    {
        "title": "Pro Git: Everything You Need to Know About Git (German) - Version 2.1.359-2-g27002dd",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Scottt Chacon",
            "Ben Straub"
        ],
        "subjects": [
            "Computer Science",
            "Information Systems"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxMywicHVyIjoiYmxvYl9pZCJ9fQ==--d0b688f61f189bf4b57856374b6c780d37ec9ac6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/progit2.png",
        "description": "The entire Pro Git book, written by Scott Chacon and Ben Straub and published by Apress, is available here. All content is licensed under theCreative Commons Attribution Non Commercial Share Alike 3.0 license. Print versions of the book are available onAmazon.com.The version found here has been updated with corrections and additions fromhundreds of contributors. If you see an error or have a suggestion, patches and issues are welcome in itsGitHub repository.",
        "publisher": "Apress",
        "language": "German",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pro-git-everything-you-need-to-know-about-git-german"
    },
    {
        "title": "Think Java: How To Think Like a Computer Scientist - 2e",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Chris Mayfield, James Madison University",
            "Allen Downey, Franklin W. Olin College of Engineering"
        ],
        "subjects": [
            "Computer Science",
            "Programming Languages"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI4NiwicHVyIjoiYmxvYl9pZCJ9fQ==--5da702750755ec223ec700426251837a528d4a72/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/think_java_covr_large.png",
        "description": "Think Javais a hands-on introduction to computer science and programming used by many universities and high schools around the world. Its conciseness, emphasis on vocabulary, and informal tone make it particularly appealing for readers with little or no experience. The book starts with the most basic programming concepts and gradually works its way to advanced object-oriented techniques.In this fully updated and expanded edition, authors Allen Downey and Chris Mayfield introduce programming as a means for solving interesting problems. Each chapter presents material for one week of a college course and includes exercises to help you practice what you’ve learned. Along the way, you’ll see nearly every topic required for the AP Computer Science A exam and Java SE Programmer I certification.",
        "publisher": "Green Tea Press",
        "language": "English",
        "isbn13": "9781491929568",
        "source": "https://open.umn.edu/opentextbooks/textbooks/think-java-how-to-think-like-a-computer-scientist"
    },
    {
        "title": "Enterprise Pharo a Web Perspective",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQ5LCJwdXIiOiJibG9iX2lkIn19--c12c1cd58fb2a62a3d8712dd0570029d2f19c17a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781326650971.png",
        "description": "Enterprise Pharo is the third volume of the series, following Pharo by Example and Deep into Pharo. It covers enterprise libraries and frameworks, and in particular those useful for doing web development. The book is structured in five parts.The first part talks about simple web applications, starting with a minimal web application in chapter 1 on Teapot and then a tutorial on building a more complete web application in chapter 2. Part two deals with HTTP support in Pharo, talking about character encoding in chapter 3, about using Pharo as an HTTP Client (chapter 4) and server (chapter 5), and about using WebSockets (chapter 6).In the third part we discuss the handling of data for the application. Firstly we treat data that is in the form of comma-separated values (CSV) in chapter 7. Secondly and thirdly, we treat JSON (chapter 8) and its Smalltalk counterpart STON (chapter 9). Fourthly, serialization and deserialization of object graphs with Fuel is treated in chapter 10. Lastly, we discuss the Voyage persistence framework and persisting to MongoDB databases in chapter 11. Part four deals with the presentation layer. Chapter 12 shows how to use Mustache templates in Pharo, and chapter 13 talks about programmatic generationof CSS files. The documentation of applications could be written in Pillar, which is presented in chapter 14. How to generate PDF files from the application with Artefact is shown in chapter 15. The fifth part deals with deploying the web application. This is explained in chapter 16 that talks not only about how to build and run the application, but also other important topics like monitoring.",
        "publisher": "Square Bracket Associates",
        "language": "English",
        "isbn13": "9781326650971",
        "source": "https://open.umn.edu/opentextbooks/textbooks/enterprise-pharo-a-web-perspective"
    },
    {
        "title": "The Unicode cookbook for linguists: Managing writing systems using orthography profiles",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Steven Moran",
            "Michael Cysouw"
        ],
        "subjects": [
            "Computer Science"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTcyLCJwdXIiOiJibG9iX2lkIn19--988d82584f60a134d00522610ad616253d8a2cf8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9783961100903.png",
        "description": "This text is a practical guide for linguists, and programmers, who work with data in multilingual computational environments. We introduce the basic concepts needed to understand how writing systems and character encodings function, and how they work together at the intersection between the Unicode Standard and the International Phonetic Alphabet. Although these standards are often met with frustration by users, they nevertheless provide language researchers and programmers with a consistent computational architecture needed to process, publish and analyze lexical data from the world's languages. Thus we bring to light common, but not always transparent, pitfalls which researchers face when working with Unicode and IPA. Having identified and overcome these pitfalls involved in making writing systems and character encodings syntactically and semantically interoperable (to the extent that they can be), we created a suite of open-source Python and R tools to work with languages using orthography profiles that describe author- or document-specific orthographic conventions. In this cookbook we describe a formal specification of orthography profiles and provide recipes using open source tools to show how users can segment text, analyze it, identify errors, and to transform it into different written forms for comparative linguistics research.",
        "publisher": "Language Science Press",
        "language": "English",
        "isbn13": "9783961100903",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-unicode-cookbook-for-linguists-managing-writing-systems-using-orthography-profiles"
    }
]