[
    {
        "title": "Engineering Statics: Open and Interactive",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Daniel W. Baker, Colorado State University",
            "William Haynes, Massachusetts Maritime Academy"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjc5MiwicHVyIjoiYmxvYl9pZCJ9fQ==--5444c8aebba7d4a49310aa02852f0f284ea42d2c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/sjdk.JPG",
        "description": "Engineering Staticsis a free, open-source textbook appropriate for anyone who wishes to learn more about vectors, forces, moments, static equilibrium, and the properties of shapes. Specifically, it has been written to be the textbook for Engineering Mechanics: Statics, the first course in the Engineering Mechanics series offered in most university-level engineering programs.This book’s content should prepare you for subsequent classes covering Engineering Mechanics: Dynamics and Mechanics of Materials. At its core,Engineering Staticsprovides the tools to solve static equilibrium problems for rigid bodies. The additional topics of resolving internal loads in rigid bodies and computing area moments of inertia are also included as stepping stones for later courses. We have endeavored to write in an approachable style and provide many questions, examples, and interactives for you to engage with and learn from.",
        "publisher": "Daniel Baker and William Haynes",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/engineering-statics-open-and-interactive"
    },
    {
        "title": "An Australian and New Zealand Human Resource Management Guide to Work Health and Safety",
        "copyright_year": "2023",
        "last_update": "2024",
        "authors": [
            "Lynnaire Sheridan, University of Otago"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMyMjQsInB1ciI6ImJsb2JfaWQifX0=--fb13b2ffc44e504330c65e309a3f471cf3242126/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/ANZ-Workplace-Health-Safety-Cover-350x495.jpg",
        "description": "An Australian and New Zealand Human Resource Management Guide to Work Health and Safety(WHS) is comprised of three sections: an historical overview, an introduction to theory, and a guide to WHS implementation via the adoption and enactment of a safety management system.The socio-historical review of human ‘labour’ outlines foundational knowledge on the intertwined origins of worker labour and safety rights, while contextualising the formation and role of unions in securing labour rights that, today, are standard in Australian and New Zealand contexts.  It enhances understanding of the historical origins of the contemporary disciplines of Employment Relations and WHS to explain their commonly shared assumptions and principles.The theoretical introduction defines key concepts for WHS management and outlines James Reasons’ Swiss Cheese Model of safety incident causation.  A systems-based approach to WHS management is proposed as a mechanism to identify, and actively resolve, latent factors before introducing organisational safety culture as fundamental to effective WHS management.The guide to implementation outlines the leadership commitment, policies, procedures, planning, and compliance competency required before a safety management system can begin.  It explores implementation of hazard identification, risk assessment, and hazard control procedures before emphasising that this should occur parallel to establishing effective emergency response procedures.  It concludes by outlining how to use measurement and evaluation to ‘close the loop’ ready for the next iteration of the safety management system cycle.This book affords Human Resource managers a comprehensive overview of Safety I approaches to WHS while outlining how theory and practice is shifting towards a more human-centric, Safety II, approach.  It puts workers, and their health, at the centre of WHS management while recognising the organisational constraints within which WHS practitioners operate.",
        "publisher": "University of Otago",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-australian-and-new-zealand-human-resource-management-guide-to-work-health-and-safety"
    },
    {
        "title": "Aviation Maintenance Technician Handbook – Airframe (FAA-H-8083-31B)",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "U.S. Department of Transportation Federal Aviation Administration"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTUwOCwicHVyIjoiYmxvYl9pZCJ9fQ==--204f33653046415529495d2659b665e72c05d979/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-09-08%20at%202.28.03%20PM.png",
        "description": "TheAviation Maintenance Technician Handbook—Airframe (FAA-H-8083-31B)is one of a series of three handbooks for persons preparing for certification as an airframe or powerplant mechanic. This handbook provides basic information on principles, fundamentals, and technical procedures in the subject matter areas relating to the airframe rating. It is designed to aid students enrolled in a formal course of instruction, as well as the individual who is studying on their own. Since the knowledge requirements for the airframe and powerplant ratings closely parallel each other in some subject areas, the chapters which discuss fire protection systems and electrical systems contain some material which is also duplicated in theAviation Maintenance Technician Handbook—Powerplant (FAA-H-8083-32B). This handbook contains information on airframe construction features, assembly and rigging, fabric covering, structural repairs, and aircraft welding. The handbook also contains an explanation of the units that make up the various airframe systems. Because there are so many different types of aircraft in use today, it is reasonable to expect that differences exist in airframe components and systems. To avoid undue repetition, the practice of using representative systems and units is carried out throughout the handbook. Subject matter treatment is from a generalized point of view and should be supplemented by reference to manufacturers’ manuals or other textbooks if more detail is desired. This handbook is not intended to replace, substitute for, or supersede official regulations or manufacturers’ instructions. Occasionally the word “must” or similar language is used where the desired action is deemed critical. The use of such language is not intended to add to, interpret, or relieve a duty imposed by Title 14 of the Code of Federal Regulations (14 CFR).",
        "publisher": "Federal Aviation Administration",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/aviation-maintenance-technician-handbook-airframe-faa-h-8083-31b"
    },
    {
        "title": "Introduction to Aerospace Structures and Materials",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "René Alderliesten"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTg1LCJwdXIiOiJibG9iX2lkIn19--37ba2f31452a6a42923f1bc01369f8eea6e6f0eb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9789463660754.jpg",
        "description": "This book provides an introduction to the discipline of aerospace structures and materials. It is the first book to date that includes all relevant aspects of this discipline within a single monologue. These aspects range from materials, manufacturing and processing techniques, to structures, design principles and structural performance, including aspects like durability and safety. With the purpose of introducing students into the basics of the entire discipline, the book presents the subjects broadly and loosely connected, adopting either a formal description or an informal walk around type of presentation. A key lessons conveyed within this book is the interplay between the exact science and engineering topics, like solid material physics and structural analysis, and the soft topics that are not easily captured by equations and formulas. Safety, manufacturability, availability and costing are some of these topics that are presented in this book to explain decisions and design solutions within this discipline.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-aerospace-structures-and-materials"
    },
    {
        "title": "Algoritmo de inteligencia artificial para la detección de cultivos de cacao (Teobroma cacao L.), banano (Musa paradisiaca L.) y palma africana (Elaeis guineensis J.).",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Oliver Michael Zambrano-Garcia, Universidad Técnica Estatal de Quevedo",
            "Lidia Vlassova, Universidad Técnica Estatal de Quevedo"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2NDUsInB1ciI6ImJsb2JfaWQifX0=--96c88c9478630c7462267bbc76a780b4b6eab39e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_61_61_coverImage_es_ES.jpg",
        "description": "Se analiza la expansión e intensificación de la agricultura no regulada e insostenible, principalmente en América Latina, enfocándose en Ecuador, donde la degradación del suelo está estrechamente relacionada con prácticas agrícolas insostenibles. Destaca la importancia de una planificación territorial exhaustiva y el uso de teledetección para evaluar cambios en el uso del suelo y la cobertura vegetal​​. La investigación se centra en la zona norte de las provincias del Guayas y de Los Ríos en Ecuador, enfocándose en el procesamiento de imágenes satelitales para detectar cultivos de banano, cacao y palma. Utiliza una metodología experimental y cuantitativa para comparar la efectividad de distintas metodologías de clasificación, evaluando la precisión del método de inteligencia artificial Bosques Aleatorios usando imágenes del satélite Sentinel-2. Los resultados del estudio incluyen el preprocesamiento de imágenes satelitales, el cálculo de índices espectrales NDVI y RESI, y la clasificación supervisada de las imágenes de Sentinel-2 utilizando los métodos de Máxima Verosimilitud y Bosques Aleatorios. Se realizaron análisis estadísticos detallados, incluyendo la validación de resultados mediante matrices de confusión y el cálculo del coeficiente Kappa​​. En conclusión, el manuscrito ofrece una comprensión profunda de cómo la teledetección y la inteligencia artificial pueden ayudar en la detección y clasificación de cultivos en áreas específicas, contribuyendo a la gestión agrícola y la planificación territorial sostenible​​.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651174",
        "source": "https://open.umn.edu/opentextbooks/textbooks/algoritmo-de-inteligencia-artificial-para-la-deteccion-de-cultivos-de-cacao-teobroma-cacao-l-banano-musa-paradisiaca-l-y-palma-africana-elaeis-guineensis-j"
    },
    {
        "title": "Analysis and Design of Elementary MOS Amplifier Stages",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "Boris Murmann, Stanford, CA"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQyMywicHVyIjoiYmxvYl9pZCJ9fQ==--6bdd089b9ae7c269ae6894cec61aba802b0458a5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-01-05%20at%207.39.53%20AM.png",
        "description": "Analyzes core linear analog circuit designs: common-source, common-gate, and common-drain stagesDesign-oriented approach; analyzes various circuits through examples and exercisesPart of the Modular Series of Microelectronic Device and Circuit DesignEach module in the series provides a brief fundamental look at a specific topic'As of November 1, 2022, National Technology and Science Press ('NTS') has discontinued publication of 'Analysis and Design of Elementary MOS Amplifier Stages.' Accordingly, NTS has returned all copyrights and attendant rights with respect to the work to Boris Murmann.'",
        "publisher": "Boris Murmann",
        "language": "English",
        "isbn13": "9781934891179",
        "source": "https://open.umn.edu/opentextbooks/textbooks/analysis-and-design-of-elementary-mos-amplifier-stages"
    },
    {
        "title": "AC Circuits",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Chad Davis, University of Oklahoma"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYwLCJwdXIiOiJibG9iX2lkIn19--e8c5a23672f0efd25d386d2abd368c9a85415b55/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ACCircuit.png",
        "description": "This eBook was written as the sequel to the eBook titled DC Circuits, which was written in 2016 by Chad Davis. This eBook covers Alternating Current (AC) circuit theory as well as a brief introduction of electronics. It is broken up into seven modules. Module 1 covers the basic theory of AC signals. Since only DC sources are used in the first eBook, details of AC signals such as sinusoidal waveforms (or sine waves), square waves, and triangle waves are provided. Module 2, titled AC Circuits Math Background, covers the mathematics background needed for solving AC circuit problems. The background material in Modules 1 and 2 are combined in Module 3 to solve circuits with AC sources that include resistors, inductors, and capacitors (RLC circuits).",
        "publisher": "University of Oklahoma Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/ac-circuits"
    },
    {
        "title": "Microwave and RF Design: Amplifiers and Oscillators",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Michael Steer, NC State"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzA5LCJwdXIiOiJibG9iX2lkIn19--f787195dced7f6505627f7900e800e6fc4614ce5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/978-1-4696-5699-1.jpg",
        "description": "Microwave and RF Design: Amplifiers and Oscillatorspresents the design of amplifiers and oscillators in a way that enables state-of-the-art designs to be realized. Detailed strategies and case studies are presented. Design of competitive microwave amplifiers and oscillators is particularly challenging as many trade-offs are required in design, and the design decisions cannot be reduced to a formulaic flow. The emphasis is on developing design skills. This book is suitable as both an undergraduate and graduate textbook, as well as a career-long reference book.",
        "publisher": "North Carolina State University Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/microwave-and-rf-design-amplifiers-and-oscillators"
    },
    {
        "title": "Direct Energy",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Andrea M. Mitofsky"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTMyLCJwdXIiOiJibG9iX2lkIn19--b50facfee78acab4867f446aaec3e60ff733c9ab/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000DirEneCon.png",
        "description": "Direct Energy Conversion discusses both the physics behind energy conversion processes and a wide variety of energy conversion devices. A direct energy conversion process converts one form of energy to another through a single process. The first half of this book surveys multiple devices that convert to or from electricity including piezoelectric devices, antennas, solar cells, light emitting diodes, lasers, thermoelectric devices, and batteries. In these chapters, physical effects are discussed, terminology used by engineers in the discipline is introduced, and insights into material selection is studied. The second part of this book puts concepts of energy conversion in a more abstract framework. These chapters introduce the idea of calculus of variations and illuminate relationships between energy conversion processes.",
        "publisher": "A.T. Still University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/direct-energy"
    },
    {
        "title": "Building User Interfaces for Modern Web Applications: React Programming",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Cheer-Sun Yang, West Chester University"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE2ODEsInB1ciI6ImJsb2JfaWQifX0=--0dab005f64582dc7f14338ecf4e786faaf52adee/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Yang_BuildingUserInterfaces-767x1024.png",
        "description": "Since Facebook released React as an open-source software library for front-end programming in 2013, React has gain popularity quickly. Although there are other frameworks or libraries, React is considered a programmer-friendly JavaScript library using the functional programming approach for the front-end web application development. Teaching and learning React can provide training in Functional Programming, Software Engineering Principles, and the Event-Driven Programming Paradigm. The ultimate goal of this eTextbook is to provide a timely support for teaching the state-of-the-art technology as the React ecosystem evolves.In this eTextbook, the prerequisite concepts about HTML/CSS, JavaScript, and Bootstrap/React-Bootstrap are introduced first, followed by the main React language features. Finally, the Software Engineering Principles are introduced from the design, development, to debugging and maintenance. The main objectives are threefold: (1) provide concepts about JavaScript Programming, (2) introduce the concepts of modularity, functional programming, and (3) teach the concept of reusable User Interface (UI) as the front-end of modern model-view-controller (MVC) web applications.Although learning other technologies in the React ecosystem is imminent, it is the hope that this book paves the groundwork for the future learning and growing in the field of modern UI development.",
        "publisher": "The Pennsylvania Alliance for Design of Open Textbooks (PA-ADOPT)",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-user-interfaces-for-modern-web-applications-react-programming"
    },
    {
        "title": "A Brief Introduction to Engineering Computation with MATLAB",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Serhat Beyenir"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDk4LCJwdXIiOiJibG9iX2lkIn19--355773b55736596448e9f522f0d425b32910ee6e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntMATLAB.png",
        "description": "A Brief Introduction to Engineering Computation with MATLAB is specifically designed for students with no programming experience. However, students are expected to be proficient in First Year Mathematics and Sciences and access to good reference books are highly recommended. Students are assumed to have a working knowledge of the Mac OS X or Microsoft Windows operating systems. The strategic goal of the course and book is to provide learners with an appreciation for the role computation plays in solving engineering problems. MATLAB specific skills that students are expected to be proficient at are: write scripts to solve engineering problems including interpolation, numerical integration and regression analysis, plot graphs to visualize, analyze and present numerical data, and publish reports.",
        "publisher": "Serhat Beyenir",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-brief-introduction-to-engineering-computation-with-matlab"
    },
    {
        "title": "Aviation Maintenance Technician Handbook – Powerplant (FAA-H-8083-32B)",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "U.S. Department of Transportation Federal Aviation Administration"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTM0MCwicHVyIjoiYmxvYl9pZCJ9fQ==--352bb0c9cd488803f78fb08d626355a2a57daff7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-18%20at%204.19.03%20PM.png",
        "description": "The Aviation Maintenance Technician Handbook–Powerplant (FAA-H-8083-32B)is one of a series of three handbooks for persons preparing for certification as a powerplant mechanic. It is intended that this handbook provide the basic information on principles, fundamentals, and technical procedures in the subject matter areas relating to the powerplant rating. It is designed to aid students enrolled in a formal course of instruction, as well as the individual who is studying on his or her own. Since the knowledge requirements for the airframe and powerplant ratings closely parallel each other in some subject areas, the chapters which discuss fire protection systems and electrical systems contain some material which is also duplicated in the Aviation Maintenance Technician Handbook–Airframe (FAA-H-8083-31B). This handbook contains an explanation of the units that make up each of the systems that bring fuel, air, and ignition together in an aircraft engine for combustion. It also contains information on engine construction features, lubrication systems, exhaust systems, cooling systems, cylinder removal and replacement, compression checks, and valve adjustments. Because there are so many different types of aircraft in use today, it is reasonable to expect that differences exist in airframe components and systems. To avoid undue repetition, the practice of using representative systems and units is carried out throughout the handbook. Subject matter treatment is from a generalized point of view and should be supplemented by reference to manufacturer's manuals or other textbooks if more detail is desired. This handbook is not intended to replace, substitute for, or supersede official regulations or the manufacturer’s instructions. Occasionally the word “must” or similar language is used where the desired action is deemed critical. The use of such language is not intended to add to, interpret, or relieve a duty imposed by Title 14 of the Code of Federal Regulations (14 CFR).",
        "publisher": "Federal Aviation Administration",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/aviation-maintenance-technician-handbook-powerplant-faa-h-8083-32b"
    },
    {
        "title": "Essential Mechanics - Statics and Strength of Materials with MATLAB and Octave",
        "copyright_year": "2020",
        "last_update": "2023",
        "authors": [
            "P. Venkataraman, Rochester Institute of Technology (Retired)"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTU4MiwicHVyIjoiYmxvYl9pZCJ9fQ==--833ea9432d97f11034674f9dd0b9051c62598fdd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/EmbeddedImage.jpg",
        "description": "Essential Mechanics - Statics and Strength of Materials with MATLAB and Octavecombines two core engineering science courses -  “Statics” and “Strength of Materials”  - in mechanical, civil, and aerospace engineering. It weaves together various essential topics from Statics and Strength of Materials to allow discussing structural design from the very beginning. The traditional content of these courses are reordered to make it convenient to cover rigid body equilibrium and extend it to deformable body mechanics.The e-book covers the most useful topics from both courses with computational support through MATLAB/Octave.  The traditional approach for engineering content is emphasized and is rigorously supported through graphics and analysis.  Prior knowledge of MATLAB is not necessary. Instructions for its use in context is provided and explained. It takes advantage of the numerical, symbolic, and graphical capability of MATLAB for effective problem solving. This computational ability provides a natural procedure for What if? exploration that is important for design. The book also emphasizes graphics to understand, learn, and explore design. The idea for this book, the organization, and the flow of content is original and new. The integration of computation, and the marriage of analytical and computational skills is a new valuable experience provided by this e-book. Most importantly the book is very interactive with respect to the code as it appears along with the analysis.",
        "publisher": "RIT Scholar Works",
        "language": "English",
        "isbn13": "9780988881129",
        "source": "https://open.umn.edu/opentextbooks/textbooks/essential-mechanics-statics-and-strength-of-materials-with-matlab-and-octave"
    },
    {
        "title": "Radio Systems Engineering - Revised First Edition",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Steven W. Ellingson, Virginia Tech"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAzNDgsInB1ciI6ImJsb2JfaWQifX0=--4620f9d0a35d5cfc24c2cc619ec89278cd3071e2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Cover%20-%20Radio%20Systems%20Engineering%201Re.png",
        "description": "Using a systems framework, this textbook provides a clear and comprehensive introduction to the performance, analysis, and design of radio systems for students and practicing engineers. Presented within a consistent framework, the first part of the book describes the fundamentals of the subject: propagation, noise, antennas, and modulation. The analysis and design of radios including RF circuit design and signal processing is covered in the second half of the book.Key featuresNumerous examples within the text involve realistic analysis and design activities, and emphasize how practical experiences may differ from theory or taught procedures.RF circuit design and analysis is presented with minimal involvement of Smith charts, enabling students to more readily grasp the fundamentals.Both traditional and software-defined/direct sampling technology are described with pros and cons of each strategy explained.Are you reviewing or adopting this book for a course? Please help us understand your use by filling out this form: https://bit.ly/interest_radiosystemsengineering_revised1stRadio Systems Engineering (Revised First Edition)was previously published by Cambridge University Press (2016) ISBN 9781107068285. This version is © Steven W. Ellingson and has been lightly updated to correct known errata, minor issues with text and figures, and to present examples in color highlight boxes and some figures in color. It is made freely available and under a Creative Commons Attribution NonCommercial International License (CC BY NC 4.0) with permission from Cambridge University Press.",
        "publisher": "Virginia Tech Publishing",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/radio-systems-engineering"
    },
    {
        "title": "Fundamentos de sistemas operativos",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [
            "Gunnar Wolf, Mexico City, Mexico",
            "Esteban Ruiz, Rosario, Argentina",
            "Federico Bergero, Rosario, Argentina",
            "Erwin Meza, Santander, Colombia"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU1NywicHVyIjoiYmxvYl9pZCJ9fQ==--bcc014cfbf68dbacaadcc08ad2d5f46d3305e590/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/portada_mini.jpeg",
        "description": "Todos los usuarios de equipos de cómputo (esto es, prácticamente cualquier persona del mundo) tienen contacto con un sistema operativo, y ciertas expectativas acerca de su funcionamiento. ¿Cómo es que un sistema operativo puede gestionar y compartir los recursos de cómputo?Hoy en día, a pesar de que menos de una decena es conocida por la población en general, hay cientos de sistemas operativos en uso y bajo un desarrollo activo. Cada uno de ellos persigue distintos fines, sea por la arquitectura o la capacidad de los equipos en que se ejecutará, características específicas que implementa, o persigue atraer un segmento distinto de la población. Todos ellos, sin embargo, realizan las mismas operaciones básicas, parten de los mismos fundamentos.Este libro, diseñado para servir como bibliografía para un curso de Sistemas Operativos para licenciatura, presenta las principales áreas en que se divide el trabajo de un sistema operativo.El libro está escrito nativamente en español, salvando las inconveniencias en que muchas veces incurren las traducciones técnicas. Los autores (uno mexicano, dos argentinos y uno colombiano) procuraron que el lenguaje y los términos empleados resulten lo más neutros y universales a la región latinoamericana.",
        "publisher": "Universidad Nacional Autónoma de México",
        "language": "English",
        "isbn13": "9786070265440",
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentos-de-sistemas-operativos"
    },
    {
        "title": "Interpretation of Metal Fab Drawings",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Cameren Moran, Linn-Benton Community College"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjIxMiwicHVyIjoiYmxvYl9pZCJ9fQ==--64be13b7626939fce3bb8a9266447d52d9b5d28c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Interpreting-Metal-Fab-Drawings-683x1024.jpg",
        "description": "Interpreting metal fab drawings is a course that introduces the principles of interpretation and application of industrial fabrication drawings. Basic principles and techniques of metal fabrication are introduced by planning and construction of fixtures used in fabrication from drawings. Basic tools and equipment for layout fitting of welded fabrications are utilized. Covers the use and application of the AWS welding symbols. This course will utilize blueprints and welding symbols and will apply them in classroom and in shop as practical assignments.",
        "publisher": "Open Oregon Educational Resources",
        "language": "English",
        "isbn13": "9781636350615",
        "source": "https://open.umn.edu/opentextbooks/textbooks/interpretation-of-metal-fab-drawings"
    },
    {
        "title": "Fundamentals of Infrastructure Management",
        "copyright_year": "2017",
        "last_update": "2019",
        "authors": [
            "Donald Coffelt, Carnegie Mellon University",
            "Chris Hendrickson, Carnegie Mellon University"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDUzLCJwdXIiOiJibG9iX2lkIn19--6f8d5b96c592ff3736c7a8adaf49f63fea2ef15d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000FunInfMan.png",
        "description": "The authors believe this free of charge book, Fundamentals of Infrastructure Management, will expand the impact of the material and help improve the practice of infrastructure management. By ‘free of charge,' we mean that the material can be freely obtained, but readers should devote time and effort to mastering the material. We have provided problem assignments for various chapters, and we strongly urge readers to undertake the problems as a learning experience.This book grew out of a decade of co-teaching a course entitled ‘Infrastructure Management' at Carnegie Mellon University. Our teaching philosophy was to prepare students for work in the field of infrastructure management. We believe that infrastructure management is a professional endeavor and an attractive professional career. The book is co-authored by two accomplished engineers - each representing professional practice, academic research and theoretical evaluation. Their collective strengths are presented throughout the text and serve to support both the practice of infrastructure management and a role for infrastructure management inquiry and search. Importantly, both co-authors have academic research interests (and a number of research publications) on various topics of infrastructure management. That said, the primary audience for this book is expected to be professionals intending to practice infrastructure management, and only secondarily individuals who intend to pursue a career of research in the area.The text draws examples and discusses a wide variety of infrastructure systems, including roadways, telecommunications, power generation, buildings and systems of infrastructure. We have found that some common fundamentals of asset management, analysis tools and informed decision-making are useful for a variety of such systems. Certainly, many infrastructure managers encounter a variety of infrastructure types during their professional careers. Moreover, due to the functional inter-dependencies of different infrastructure systems, it is certainly advantageous for managers of one infrastructure type to understand other types of infrastructure. For example, roadway managers rely upon the power grid for traffic signal operation.",
        "publisher": "Donald Coffelt and Chris Hendrickson",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-infrastructure-management"
    },
    {
        "title": "Ports and Waterways: Navigating the changing world",
        "copyright_year": null,
        "last_update": null,
        "authors": [
            "Mark van Koningsveld, TU Delft",
            "Henk Verheij, TU Delft",
            "Poonam Taneja, TU Delft",
            "Huib de Vriend, Delft University of Technology"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjg2OSwicHVyIjoiYmxvYl9pZCJ9fQ==--c69fe5284d355d5dfa6336580ea0dec7638c4455/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_43_60_coverImage_en_US_t.png",
        "description": "Before you lies the book ‘Ports and Waterways - Navigating the changing world’, written by the Ports and Waterways team, part of the Civil Engineering and Geosciences faculty at Delft University of Technology. It integrates the content of a number of separate lecture notes we used in our teaching activities and updates this information where relevant. The integration reflects our vision that ports and waterways should be viewed as parts of a coherent system that supports waterborne supply chains, and that their integral design and operation is essential.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463664448",
        "source": "https://open.umn.edu/opentextbooks/textbooks/ports-and-waterways-navigating-the-changing-world"
    },
    {
        "title": "Basic Engineering Science - A Systems, Accounting, and Modeling Approach",
        "copyright_year": "2001",
        "last_update": null,
        "authors": [
            "Donald E. Richards, Rose-Hulman Institute of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjg3MCwicHVyIjoiYmxvYl9pZCJ9fQ==--c0126cc42cc1163c747b5415024f956cdcf44c9e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/adsf.JPG",
        "description": "This textbook is based on a different paradigm for organizing an engineering science core --- a systems, accounting and modeling approach --- that emphasizes the common, underlying concepts of engineering science. Although this approach is not new, as most graduate students have been struck by this idea sometime during their graduate education, its use as the organizing principle for an undergraduate curriculum is new. By focusing on the underlying concepts and stressing the similarities between subjects that are often perceived by students (and taught by faculty) as unconnected topics, this approach provides engineering students a foundational framework for recognizing and building connections as they travel through their education.",
        "publisher": "Rose-Hulman Institute of Technology",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/basic-engineering-science-a-systems-accounting-and-modeling-approach"
    },
    {
        "title": "Unmanned Vehicle Systems & Operations on Air, Sea, Land",
        "copyright_year": "2020",
        "last_update": "2024",
        "authors": [
            "Randall K. Nichols, Kansas State University",
            "Hans C. Mumm, California University of Pennsylvania",
            "Wayne D. Lonstein, Pennsylvania State University",
            "Julie J.C.H Ryan, Wyndrose Technical Group",
            "Candice M. Carter, NASA"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzMDYsInB1ciI6ImJsb2JfaWQifX0=--53e97223af375762346152ee828843edf489c48a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/unman.jpg",
        "description": "This is our fourth textbook in a series previously covering the world of Unmanned Aircraft Systems (UAS) and Counter Unmanned Aircraft Systems (CUAS). The authors have expanded our purview beyond UAS / CUAS systems. Our title shows our concern for growth and unique operations for all unmanned vehicles in all theaters: Air, Sea and Land.",
        "publisher": "New Prairie Press",
        "language": "English",
        "isbn13": "9781944548308",
        "source": "https://open.umn.edu/opentextbooks/textbooks/unmanned-vehicle-systems-operations-on-air-sea-land"
    },
    {
        "title": "Aerodynamics and Aircraft Performance - 3rd edition",
        "copyright_year": "2004",
        "last_update": null,
        "authors": [
            "James F. Marchman III, Virginia Tech"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjczMSwicHVyIjoiYmxvYl9pZCJ9fQ==--c177a9fced79960cdc552be87dd5ebc83f46c010/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/A-AP-cover-PB-version-685x1024.png",
        "description": "Aerodynamics and Aircraft Performance, 3rd editionis a college undergraduate-level introduction to aircraft aerodynamics and performance. This text is designed for a course in Aircraft Performance that is taught before the students have had any course in fluid mechanics, fluid dynamics, or aerodynamics. The text is meant to provide the essential information from these types of courses that is needed for teaching basic subsonic aircraft performance, and it is assumed that the students will learn the full story of aerodynamics in other, later courses. The text assumes that the students will have had a university level Physics sequence in which they will have been introduced to the most fundamental concepts of statics, dynamics, fluid mechanics, and basic conservation laws that are needed to understand the coverage that follows. It is also assumed that students will have completed first year university level calculus sequence plus a course in multi-variable calculus. Separate courses in engineering statics and dynamics are helpful but not necessary. Any student who takes a course using this text after completing courses in aerodynamics or fluid dynamics should find the chapters of this book covering those subjects an interesting review of the material.The 236-page text was created specifically for use by undergraduate students in Aerospace Engineering and was based on Professor Marchman’s many years of experience teaching related subject matter as well as his numerous wind tunnel research projects related to aircraft aerodynamics and his personal experience as the owner and pilot of a general aviation airplane. It has been used at Virginia Tech and other universities.Instructors reviewing, adopting, or adapting parts or the whole of the text are requested to register their interest at:https://bit.ly/aerodynamics_interest.",
        "publisher": null,
        "language": "English",
        "isbn13": "9781949373639",
        "source": "https://open.umn.edu/opentextbooks/textbooks/aerodynamics-and-aircraft-performance"
    },
    {
        "title": "Bio-Inspired Sensory Systems",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Geoffrey Brooks, FSU Panama City"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjAyMSwicHVyIjoiYmxvYl9pZCJ9fQ==--2d4845984d18aed2eda28fb3db3a6afeb288f05e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/medium-7d446a247e46826e2e034dc43733b32b.png",
        "description": "Using natural sensory system concepts to develop and improve sensory systems will continue to thrive for many years to come. Technology advances rapidly (Moore’s Law) as does our understanding of biological principles and designs. These trends fuel the fertile grounds of bio-inspired sensory systems, a topic that is inherently multidisciplinary. This book will serve well as either an academic text on the subject or an introduction to the variety of proven bio-inspired designs. The focus is on sensory systems that interpret environmental stimuli. It introduces natural photo-, mechano-, and chemo-sensory systems across the animal kingdom and also summarizes various novel engineering ideas that glean ideas from these natural sensory systems.",
        "publisher": "Florida State University",
        "language": "English",
        "isbn13": "9781736577905",
        "source": "https://open.umn.edu/opentextbooks/textbooks/bio-inspired-sensory-systems"
    },
    {
        "title": "Elementary Differential Equations with Boundary Value Problems",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "William F. Trench, Trinity University"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQ1LCJwdXIiOiJibG9iX2lkIn19--b142e1942ba330b85432c48ce6ac7df648b9b0e6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000EleDiffer.png",
        "description": "Elementary Differential Equations with Boundary Value Problemsis written for students in science, engineering, and mathematics who have completed calculus through partial differentiation.An elementary text should be written so the student can read it with comprehension without too much pain. I have tried to put myself in the student's place, and have chosen to err on the side of too much detail rather than not enough.An elementary text can't be better than its exercises. This text includes 1695 numbered exercises, many with several parts. They range in difficulty from routine to very challenging.An elementary text should be written in an informal but mathematically accurate way, illustrated by appropriate graphics. I have tried to formulate mathematical concepts succinctly in language that students can understand. I have minimized the number of explicitly stated theorems and definitions, preferring to deal with concepts in a more conversational way, copiously illustrated by 250 completely worked out examples. Where appropriate, concepts and results are depicted in 144 figures.Although I believe that the computer is an immensely valuable tool for learning, doing, and writing mathematics, the selection and treatment of topics in this text reflects my pedagogical orientation along traditional lines. However, I have incorporated what I believe to be the best use of modern technology, so you can select the level of technology that you want to include in your course. The text includes 336 exercises – identified by the symbols C and C/G – that call for graphics or computation and graphics. There are also 73 laboratory exercises – identified by L – that require extensive use of technology. In addition, several sections include informal advice on the use of technology. If you prefer not to emphasize technology, simply ignore these exercises and the advice.",
        "publisher": "A.T. Still University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/elementary-differential-equations-with-boundary-value-problems"
    },
    {
        "title": "Biomedical Engineering Lab Manual Volume 1",
        "copyright_year": "2022",
        "last_update": "2023",
        "authors": [
            "Sarah Breen, University of Oklahoma"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQwNSwicHVyIjoiYmxvYl9pZCJ9fQ==--d427f372eb5b0860cc58513fa814627602b6df78/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-22%20at%208.20.16%20PM.png",
        "description": "The lab manual was written as the first installment that coincides with two lab courses taught at the University of Oklahoma (BME3171, BME3181). These courses are designed to provide Biomedical Engineering students with lab skills and experience in biomedical engineering research and clinical techniques. This manual is used with BME3171 Lab 1 and the following topics are covered in this lab manual; functional human models, musculoskeletal lever systems, bioimaging (ultrasound), bioelectricity (electromyography), & uni-axial testing.",
        "publisher": "SHAREOK",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/biomedical-engineering-lab-manual-volume-1"
    },
    {
        "title": "Aviation Maintenance Technician Handbook – General (FAA-H-8083-30B)",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "U.S. Department of Transportation Federal Aviation Administration"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTMzNywicHVyIjoiYmxvYl9pZCJ9fQ==--7068699576fb84a974ff19be962f8b606a1c2875/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-18%20at%204.02.37%20PM.png",
        "description": "The Aviation Maintenance Technician Handbook–General (FAA-H-8083-30B)was developed as one of a series of three handbooks for persons preparing for mechanic certification with airframe or powerplant ratings, or both. It is intended that this handbook will provide basic information on principles, fundamentals, and technical procedures in the subject matter areas common to both the airframe and powerplant ratings. Emphasis in this volume is on theory and methods of application. The handbook is designed to aid students enrolled in a formal course of instruction preparing for FAA certification as a maintenance technician as well as for current technicians who wish to improve their knowledge. This volume contains information on mathematics, aircraft drawings, weight and balance, aircraft materials, processes and tools, physics, electricity, inspection, ground operations, and FAA regulations governing the certification and work of maintenance technicians. New to this volume is a section addressing how successful aviation maintenance technicians incorporate knowledge and awareness of ethics, professionalism and human factors in the field",
        "publisher": "Federal Aviation Administration",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/aviation-maintenance-technician-handbook-general-faa-h-8083-30b"
    },
    {
        "title": "Alternativas de alimentación para rumiantes",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Jessica Elizabeth Cargua-Chávez, Instituto Superior Tecnológico Tsa´chila",
            "Adriana Isabel Carrillo-Cruz, Instituto Superior Tecnológico Tsa´chila",
            "Galo Alexander Cedeño-García, Escuela Superior Politécnica Agropecuaria de Manabí Manuel Félix López"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE1NjIsInB1ciI6ImJsb2JfaWQifX0=--3a7d14208cdb5e451a4a49bc8cc6260018b413f0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_72_72_coverImage_es_ES.jpg",
        "description": "Se examina estrategias para optimizar la alimentación de rumiantes mediante el cultivo y manejo de diferentes forrajes en Santo Domingo de los Tsáchilas, Ecuador. En el primer capítulo, se destaca cómo el encalado y la fertilización mejoran el rendimiento del maíz, enfatizando en dosis óptimas de nutrientes. El segundo capítulo aborda la fertilización orgánica del pasto Mombasa bajo sombra de naranja, resaltando la superioridad de la pollinaza en el incremento de rendimiento y calidad del forraje. Los capítulos siguientes se centran en la edad óptima de corte para maximizar la biomasa del pasto Cuba OM-22, el manejo del King Grass como alternativa forrajera para el sector ganadero, y el desarrollo del forraje verde hidropónico de sorgo y maíz a dos densidades de siembra, demostrando que técnicas específicas de manejo y cultivo pueden significativamente influir en la productividad y sostenibilidad de la alimentación rumiante. A través de estos estudios, el libro propone soluciones prácticas y sustentables para mejorar la nutrición de rumiantes en entornos tropicales.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651273",
        "source": "https://open.umn.edu/opentextbooks/textbooks/alternativas-de-alimentacion-para-rumiantes"
    },
    {
        "title": "Microwave and RF Design: Transmission Lines",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Michael Steer, NC State"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzA2LCJwdXIiOiJibG9iX2lkIn19--f2cf4e1a6ab0faadbde9277d34b2a12bb0615639/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/978-1-4696-5693-9.png",
        "description": "Microwave and RF Design: Transmission Linesbuilds on the concepts of forward- and backward-traveling waves. Many examples are included of advanced techniques for analyzing and designing transmission line networks with microstrip lines primarily used in design examples. Coupled-lines are an important functional element in microwave circuits, and circuit equivalents of coupled lines are introduced as fundamental building blocks in design. The text and examples introduce the often hidden design requirements of mitigating parasitic effects and eliminating unwanted modes of operation. This book is suitable as both an undergraduate and graduate textbook, as well as a career-long reference book.",
        "publisher": "North Carolina State University Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/microwave-and-rf-design-transmission-lines"
    },
    {
        "title": "Fundamentals of Math, Physics, and Statistics for Future Transportation Professionals",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Anurag Pande, California Polytechnic State University",
            "Peyton Ratto, California Polytechnic State University",
            "Ahmed Farid, California Polytechnic State University"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI5MzcsInB1ciI6ImJsb2JfaWQifX0=--7bcc9230d45a57905ad6c49876f0b1b4872e40c7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Copy-of-Transport-Cover-Cal-Poly-Final1-350x467.png",
        "description": "This textbook and OER material cover tools and basic knowledge required to master the prerequisite essentials of physics, mathematics, and statistics applied in transportation engineering. To our knowledge, no such textbook currently exists to build the KSTs (Knowledge, Skills, Tools) for college freshmen’ remedial courses required by most transportation engineering graduate programs that admit non-engineers (e.g., PHYS 141, MATH 142, STAT 321 at California Polytechnic State University, San Luis Obispo). The textbook modules are intended for students with undergraduate degrees in planning and other less technical fields who are interested in pursuing transportation careers where background engineering knowledge is required.This textbook is a product of the grant OERTransport: Enabling Transportation Planning Professional Advancement awarded to the University of Texas-Arlington (UTA) in consortium with California Polytechnic State University (Cal Poly) and the University of South Florida (USF). It was developed under an Open Textbooks Pilot grant from the Fund for the Improvement of Postsecondary Education (FIPSE), U.S. Department of Education. However, its contents do not necessarily represent the policy of the Department of Education, and no endorsement by the Federal Government should be assumed",
        "publisher": "Mavs Open Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-math-physics-and-statistics-for-future-transportation-professionals"
    },
    {
        "title": "Basic Blueprint Reading",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Ric Costin, Linn-Benton Community College"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjIxNywicHVyIjoiYmxvYl9pZCJ9fQ==--ad52e6c7f412a6d58bd30973113ac33b7d6bd933/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Basic-Blueprint-Reading-683x1024.jpg",
        "description": "This is an entry level blueprint reading book written for the first year welding student. The book will be used in the first term of a two year welding program to familiarize the student to sketching and reading blueprints.",
        "publisher": "Open Oregon Educational Resources",
        "language": "English",
        "isbn13": "9781636350318",
        "source": "https://open.umn.edu/opentextbooks/textbooks/basic-blueprint-reading"
    },
    {
        "title": "Open Signals and Systems Laboratory Exercises - Second Edition",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Aaron Fonseca, Iowa State University",
            "Julie A. Dickerson, Iowa State University"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyNDIsInB1ciI6ImJsb2JfaWQifX0=--aa3d82a7cd30cfa4ae856f3a0d84f7d6c2f447fe/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/opensignals.png",
        "description": "Open Signals and Systems Laboratory Exercisesis a collection of lab assignments that have been used in EE 224: Signals and Systems I in the Department of Electrical and Computer Engineering at Iowa State University. These lab exercises have been curated, edited, and presented in a consistent format to improve student learning.This second edition provides a thorough coverage of the MATLAB concepts needed to complete each exercise, and incorporates hardware descriptions and explanations into the exercises that had integrated new lab equipment. A ZIP file containing additional materials is also available.",
        "publisher": "Iowa State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/open-signals-and-systems-laboratory-exercises"
    },
    {
        "title": "Building Information Modeling using Revit for Architects and Engineers",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Atefe Makhmalbaf, Arlington, Texas"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDAwMCwicHVyIjoiYmxvYl9pZCJ9fQ==--b14506408f918e7fbaa64709a8c3c2afefea258e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Building-Information-Modeling-1-683x1024.jpeg",
        "description": "This book offers a web-based multimedia platform to enable students in Architecture, Civil Engineering, and Construction Engineering to learn fundamentals of BIM using Revit and be able to create building architectural, mechanical and structural models, develop construction documentation and analyze building performance. The platform include: book chapters on detailed Revit instructions and videos.",
        "publisher": "Mavs Open Press",
        "language": "English",
        "isbn13": "9781648160059",
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-information-modeling-using-revit-for-architects-and-engineers"
    },
    {
        "title": "Applied Fluid Mechanics Lab Manual",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Habib Ahmari, University of Texas at Arlington",
            "Shah Md Imran Kabir, University of Texas at Arlington",
            "Ginny Bowers"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEwOCwicHVyIjoiYmxvYl9pZCJ9fQ==--f1f8a931f2b7d1f3f08318db05d43727be673714/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/applied_fluid_mech.jpg",
        "description": "This lab manual provides students with the theory, practical applications, objectives, and laboratory procedure of ten experiments. The manual also includes educational videos showing how student should run each experiment and a workbook for organizing data collected in the lab and preparing result tables and charts.",
        "publisher": "Mavs Open Press",
        "language": "English",
        "isbn13": "9781648169977",
        "source": "https://open.umn.edu/opentextbooks/textbooks/applied-fluid-mechanics-lab-manual-ahmari"
    },
    {
        "title": "Engineering Mechanics: Statics",
        "copyright_year": null,
        "last_update": null,
        "authors": [
            "Elisabeth (Libby) Osgood, Charlottetown, Prince Edward Island",
            "Gayla Cameron, Charlottetown, Prince Edward Island",
            "Emma Christensen, Charlottetown, Prince Edward Island"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDI4MywicHVyIjoiYmxvYl9pZCJ9fQ==--035b79dc68ce8e3fa12f232ab3cbae98470d51de/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/cairn-5598199_1920-768x1024.jpeg",
        "description": "Introduction to engineering mechanics: statics, for those who love to learn. Concepts include: particles and rigid body equilibrium equations, distributed loads, shear and moment diagrams, trusses, method of joints and sections, & inertia.",
        "publisher": "Robertson Library Pressbooks",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/engineering-mechanics-statics"
    },
    {
        "title": "Fundamentals of Microwave and RF Design",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Michael Steer, NC State"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzA0LCJwdXIiOiJibG9iX2lkIn19--d3d4c41f6fc1996fa2ac723f882a61b72113da91/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/978-1-4696-5689-2.png",
        "description": "Fundamentals of Microwave and RF Designenables mastery of the essential concepts required to cross the barriers to a successful career in microwave and RF design. Extensive treatment of scattering parameters, that naturally describe power flow, and of Smith-chart-based design procedures prepare the student for success. The emphasis is on design at the module level and on covering the whole range of microwave functions available. The orientation is towards using microstrip transmission line technologies and on gaining essential mathematical, graphical and design skills for module design proficiency. This book is derived from a multi volume comprehensive book series,Microwave and RF Design, Volumes 1-5, with the emphasis in this book being on presenting the fundamental materials required to gain entry to RF and microwave design. This book closely parallels the companion series that can be consulted for in-depth analysis with referencing of the book series being familiar and welcoming.",
        "publisher": "North Carolina State University Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-microwave-and-rf-design"
    },
    {
        "title": "Traffic Flow Theory: An introduction with exercises",
        "copyright_year": "2018",
        "last_update": "2021",
        "authors": [
            "Victor L. Knoop, Delft University of Technology"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjExMSwicHVyIjoiYmxvYl9pZCJ9fQ==--3938a6faf253ac34b266ab45727910f3baef89b4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_39_56_coverImage_en_US_t.png",
        "description": "Traffic processes cause several problems in the world. Traffic delay, pollution are some of it. They can be solved with the right road design or traffic management (control) measure. Before implementing these designs of measures, though, their effect could be tested. To this end, knowledge of traffic flow theory is needed.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463663786",
        "source": "https://open.umn.edu/opentextbooks/textbooks/traffic-flow-theory-an-introduction-with-exercises"
    },
    {
        "title": "Structured Electronics Design: A Conceptual Approach to Amplifier Design - 3rd ed.",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Anton J.M. Montagne, Delft University of Technology"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTU5MSwicHVyIjoiYmxvYl9pZCJ9fQ==--61ca6e216bbadd114c3328ab8d068f0c65e5064b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_62_79_coverImage_en_US_t.png",
        "description": "Many people consider analog electronic circuit design complex. This is because designers can achieve the desired performance of a circuit in many ways. Together, theoretical concepts, circuit topologies, electronic devices, their operating conditions, and the system's physical construction constitute an enormous design space in which it is easy to get lost. For this reason, analog electronics often is regarded as an art rather than a solid discipline.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463667128",
        "source": "https://open.umn.edu/opentextbooks/textbooks/structured-electronics-design-a-conceptual-approach-to-amplifier-design"
    },
    {
        "title": "Electrolysers, Fuel Cells and Batteries: Analytical Modelling",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Willem Haverkort, Delft University of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE1NzQsInB1ciI6ImJsb2JfaWQifX0=--dad7ab0863fe79ff1e7a22c9bfae1358af49a8f6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_93_110_coverImage_en_US_t.png",
        "description": "Electrochemical engineering deals with electrochemical devices like electrolysers, fuel cells, and batteries. While several excellent books exist in this long-standing and still growing field, their focus is usually on chemistry or phenomenology. In this textbook, we focus on mathematical modelling of the physical phenomena involved. Instead of resorting to numerical modelling, the aim is to derive simplified analytical models that maximise understanding. Porous electrodes, ion mass transport, and multiphase flow are central themes in this book. Examples include modelling the water saturation in a fuel cell diffusion layer, the gas fraction and current distribution in an alkaline water electrolyser, the potential distribution in a binary electrolyte inside porous battery electrode, and the concentration distribution in the flow channel of a redox flow battery. This makes for a diverse, challenging, and stimulating journey, for both students and researchers.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463668552",
        "source": "https://open.umn.edu/opentextbooks/textbooks/electrolysers-fuel-cells-and-batteries-analytical-modelling"
    },
    {
        "title": "DC Electrical Circuit Analysis: A Practical Approach",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "James M. Fiore, Mohawk Valley Community College"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI0NSwicHVyIjoiYmxvYl9pZCJ9fQ==--f00cdc29f36cd8dd8629f3c22a3d3de1d6d40a07/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/dcelecirc.png",
        "description": "Welcome to DC Electrical Circuit Analysis, an open educational resource (OER). The goal of this text is to introduce the theory and practical application of analysis of DC electrical circuits. It is offered free of charge under a Creative Commons non-commercial, share-alike with attribution license. For your convenience, along with the free pdf and odt files, print copies are available at a very modest charge. Check my web sites for links.This text is based on the earlier Workbook for DC Electrical Circuits, which it replaces. The original expository text has been greatly expanded and includes many examples along with computer simulations. For the convenience of those who used the Workbook, many of the problem sets are the same, with some re-ordering depending on the chapter.",
        "publisher": "dissidents",
        "language": "English",
        "isbn13": "9781654515478",
        "source": "https://open.umn.edu/opentextbooks/textbooks/dc-electrical-circuit-analysis-a-practical-approach-fiore"
    },
    {
        "title": "Microwave and RF Design: Networks",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Michael Steer, NC State"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzA3LCJwdXIiOiJibG9iX2lkIn19--954dd74f955f1b8645abaea43946ea087a21342f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/978-1-4696-5695-3.jpg",
        "description": "Microwave and RF Design: Networkspresents the tools and techniques required to analyze and design microwave and RF circuits. Because of the finite speed of light, microwave circuits must be considered to be spatially distributed and so there is not a single ground. As such metrics that can be used to describe power flow are of most use. The topics covered include scattering parameters, signal flow graphs, and Smith charts. Acquiring expertise in these is the biggest barriers to a successful career in microwave and RF engineering. This book is suitable as both an undergraduate and graduate textbook, as well as a career-long reference book.",
        "publisher": "North Carolina State University Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/microwave-and-rf-design-networks"
    },
    {
        "title": "From theORy to application: learning to optimize with Operations Research in an interactive way",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Alessandro Bombelli, Delft University of Technology",
            "Bilge Atasoy, Delft University of Technology",
            "Stefano Fazi, Delft University of Technology",
            "Doris Boschma, Delft University of Technology"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE2NTcsInB1ciI6ImJsb2JfaWQifX0=--180ba64a21c20b812be294e452a121a13c828218/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_94_111_coverImage_en_US_t.png",
        "description": "This book serves as a comprehensive roadmap for navigating the realm of Operations Research (OR). From laying down fundamental mathematical principles to crafting precise modeling techniques and their solution methods, it culminates in a panoramic view of OR models mirroring real-world operations. Delving into diverse applications-from assignment problems to network problems like graph coloring and minimum spanning trees, and navigating through routing problems that are very common in logistics-the book equips readers with practical insights. Each model is accompanied by meticulously detailed examples, seamlessly integrated with hyperlinked codes accessible via an open repository. Moreover, it introduces an engaging dimension with hyperlinks to three serious games replicating some cornerstone OR models, offering a playful yet educational environment for solo or group experimentation.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463668507",
        "source": "https://open.umn.edu/opentextbooks/textbooks/from-theory-to-application-learning-to-optimize-with-operations-research-in-an-interactive-way"
    },
    {
        "title": "Electromagnetics Vol 2",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Steven W. Ellingson"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzExLCJwdXIiOiJibG9iX2lkIn19--606c92e7382f035751942428f9c9c5a76f1dc25a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover.jpg",
        "description": "Electromagnetics, volume 2by Steven W. Ellingson is a 216-page peer-reviewed open textbook designed especially for electrical engineering students in the third year of a bachelor of science degree program. It is intended as the primary textbook for the second semester of a two-semester undergraduate engineering electromagnetics sequence. The book addresses magnetic force and the Biot-Savart law; general and lossy media; parallel plate and rectangular waveguides; parallel wire, microstrip, and coaxial transmission lines; AC current flow and skin depth; reflection and transmission at planar boundaries; fields in parallel plate, parallel wire, and microstrip transmission lines; optical fiber; and radiation and antennas.To express your interest in this book or series, please visithttp://bit.ly/vtpublishing-updatesAdditional resourcesProblem sets and the corresponding solution manuals;Slides of figures used in and created for the book;LaTeX sourcefiles;Errata for Volume 2;Collaborator portal for the Electromagnetics series;Faculty listserv for the Electromagnetics series.An accessible version will be available in January 2020.The Open Electromagnetics ProjectLed by Steven W. Ellingson at Virginia Tech, the goal of theOpen Electromagnetics Projectis to create no-cost openly-licensed content for courses in engineering electromagnetics. The project is motivated by two things: lowering learning material costs for students and giving faculty the freedom to adopt, modify, and improve their educational resources.Books in this SeriesElectromagnetics, Volume 1https://doi.org/10.21061/electromagnetics-vol-1Electromagnetics, Volume 2https://doi.org/10.21061/electromagnetics-vol-2",
        "publisher": "Virginia Tech Publishing",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/electromagnetics-vol-2"
    },
    {
        "title": "Introduction to Industrial Engineering",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Bonnie Boardman"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI5NywicHVyIjoiYmxvYl9pZCJ9fQ==--daeadbec442dbfa99c947fc29b40dc4a43bf3ec8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Introduction-to-Industrial-Engineering-Pressbooks-Cover-350x541.png",
        "description": "This book was created for an undergraduate Introduction to Industrial Engineering course at The University of Texas at Arlington (UTA).  The chapters give an overview of the profession and an introduction to some of the tools used by industrial engineers in industry.  There are interactive content exercises included at the end of most chapters.  This interactive content aims to engage students in the content as they are reading.  The book will continue to revised and updated with new information as it becomes necessary.",
        "publisher": "Mavs Open Press",
        "language": "English",
        "isbn13": "9781648169823",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-industrial-engineering"
    },
    {
        "title": "Private Pilot for Airplane Category Airman Certification Standards (FAA-S-ACS-6C)",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "U.S. Department of Transportation Federal Aviation Administration"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE1NzEsInB1ciI6ImJsb2JfaWQifX0=--284eba2d6d98b2f3731591e6c50d12c4a12d4657/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/faa.jpg",
        "description": "The U.S. Department of Transportation, Federal Aviation Administration (FAA), Office of Safety Standards, Regulatory Support Division, Airman Testing Standards Branch, has published the Private Pilot for Airplane Category Airman Certification Standards (ACS) to communicate the aeronautical knowledge, risk management, and flight proficiency standards for private pilot certification in the airplane category, single-engine land and sea; and multiengine land and sea classes.",
        "publisher": "Federal Aviation Administration",
        "language": "English",
        "isbn13": "9788321424384",
        "source": "https://open.umn.edu/opentextbooks/textbooks/private-pilot-for-airplane-category-airman-certification-standards-faa-s-acs-6c"
    },
    {
        "title": "Basics of Fluid Mechanics - ver. 0.6.9.a",
        "copyright_year": "2014",
        "last_update": "2021",
        "authors": [
            "Genick Bar-Meir"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzMxMywicHVyIjoiYmxvYl9pZCJ9fQ==--c569c071f53d3eb47e5524aab83ae2134ed7647b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Capture23231.JPG",
        "description": "The topic of fluid mechanics is common to several disciplines: mechanical engineering, aerospace engineering, chemical engineering, and civil engineering. In fact, it is also related to disciplines like industrial engineering, and electrical engineering. While the emphasis is somewhat different in this book, the common material is presented and hopefully can be used by all. One can only admire the wonderful advances done by the previous geniuses who work in this field. In this book it is hoped to insert, what and when a certain model is suitable than other models.One of the difference in this book is the insertion of the introduction to multiphase flow. Clearly, multiphase is an advance topic. However, some minimal familiarity can be helpful for many engineers who have to deal with non pure single phase fluid.This book is the third book in the series of POTTO project books. POTTO project books are open content textbooks so everyone are welcome to joint in. The topic of fluid mechanics was chosen just to fill the introduction chapter to compressible flow. During the writing it became apparent that it should be a book in its own right. In writing the chapter on fluid statics, there was a realization that it is the best chapter written on this topic. It is hoped that the other chapters will be as good this one.This book is written in the spirit of my adviser and mentor E.R.G. Eckert. Eckert, aside from his research activity, wrote the book that brought a revolution in the education of the heat transfer. Up to Egret's book, the study of heat transfer was without any dimensional analysis. He wrote his book because he realized that the dimensional analysis utilized by him and his adviser (for the post doc), Ernst Schmidt, and their colleagues, must be taught in engineering classes. His book met strong criticism in which some called to 'burn' his book. Today, however, there is no known place in world that does not teach according to Eckert's doctrine. It is assumed that the same kind of individual(s) who criticized Eckert's work will criticize this work. Indeed, the previous book, on compressible flow, met its opposition. For example, anonymous Wikipedia user name EMBaero claimed that the material in the book is plagiarizing, he just doesn't know from where and what. Maybe that was the reason that he felt that is okay to plagiarize the book on Wikipedia. These criticisms will not change the future or the success of the ideas in this work. As a wise person says 'don't tell me that it is wrong, show me what is wrong'; this is the only reply. With all the above, it must be emphasized that this book is not expected to revolutionize the field but change some of the way things are taught.The book is organized into several chapters which, as a traditional textbook, deals with a basic introduction to the fluid properties and concepts (under construction). The second chapter deals with Thermodynamics. The third book chapter is a review of mechanics. The next topic is statics. When the Static Chapter was written, this author did not realize that so many new ideas will be inserted into this topic. As traditional texts in this field, ideal flow will be presented with the issue of added mass and added forces (under construction). The classic issue of turbulence (and stability) will be presented. An introduction to multi-phase flow, not a traditional topic, will be presented next (again under construction). The next two chapters will deal with open channel flow and gas dynamics. At this stage, dimensional analysis will be present (again under construction).",
        "publisher": "Potto Project",
        "language": "English",
        "isbn13": "9781616100940",
        "source": "https://open.umn.edu/opentextbooks/textbooks/basics-of-fluid-mechanics"
    },
    {
        "title": "Fundamentals of Electrical Engineering I",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Don Johnson, Rice University"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjc3LCJwdXIiOiJibG9iX2lkIn19--a76d846cb591e6222345aa061a86571cd665f785/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781300160137.png",
        "description": "The course focuses on the creation, manipulation, transmission, and reception of information by electronic means. Elementary signal theory; time- and frequency-domain analysis; Sampling Theorem. Digital information theory; digital transmission of analog signals; error-correcting codes.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": "9781300160137",
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-electrical-engineering-1"
    },
    {
        "title": "The Primacy of the Public",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Marcus Schultz-Bergin, Cleveland State University"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk2OCwicHVyIjoiYmxvYl9pZCJ9fQ==--2bb4d7a283f67f36b9f4724704818cc6b712b932/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/robot-4153544-350x466.png",
        "description": "The Primacy of the Public presents a framework for engineering and technology ethics focused around three core ethical principles: the principle of welfare, the autonomy principle, and the fairness principle. To support this framework, the book begins with an examination of multiple perspectives we may take on engineering and technology, all of which support the centrality of ethical analysis and evaluation. These include the nature of engineering as a profession, the social context of engineering and technology, and the view that many technologies constitute social experiments.",
        "publisher": "College of DuPage",
        "language": "English",
        "isbn13": "9781936323883",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-primacy-of-the-public"
    },
    {
        "title": "Biomedical Engineering Lab Manual Volume 2",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Sarah Breen, University of Oklahoma"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQwOCwicHVyIjoiYmxvYl9pZCJ9fQ==--6cef512eaec7f0afa7ac5a77cb246ec348a5e38f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-22%20at%208.35.02%20PM.png",
        "description": "The lab manual was written as the second installment that coincides with two lab courses taught at the University of Oklahoma (BME3171, BME3181). These courses are designed to provide Biomedical Engineering students with lab skills and experience in biomedical engineering research and clinical techniques. This manual is used with BME3181 Biomedical Engineering Lab 2 and the following wet lab topics are covered in this lab manual; bioimaging, cell culture, tissue engineering, live-dead and DNA assays.",
        "publisher": "SHAREOK",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/biomedical-engineering-lab-manual-volume-2"
    },
    {
        "title": "Sabores Conectados: Transformando la Gastronomía a través de las Tecnologías de la Información y Comunicación",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Juan Antonio Picoy-Gonzales, Universidad Nacional de Huancavelica",
            "Rosaura Huarcaya-Taype, Universidad Nacional de Huancavelica",
            "Omar Hans Contreras-Canto, Universidad Nacional Hermilio Valdizan",
            "Amanda Omonte-Vilca, Universidad Nacional Hermilio Valdizan",
            "Claudio Contreras-De La Cruz, Universidad Nacional de Huancavelica",
            "Julio Cesar Gaspar-Quispe, Universidad Nacional de Huancavelica"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2MzksInB1ciI6ImJsb2JfaWQifX0=--588ca4a0c9b239b38edb26e03d11bb1ed775ab90/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_58_58_coverImage_es_ES.png",
        "description": "El libro de investigación contiene informe sistematizado sobre la influencia de los tics en beneficio del sector gastronómico de la ciudad de Huánuco, cuyos resultados pueden producir un cambio significativo en el uso tecnologías de la información. Tuvo como objetivo determinar el grado de influencia de las tecnologías de la información y la comunicación en el desempeño laboral de las Pymes más reconocidas del sector gastronómico de la ciudad de Huánuco. El método aplicado tuvo como finalidad profundizar en el análisis e interpretación de los resultados. donde se utilizó el diseño no experimental, con un nivel explicativo correlacional descriptivo, se trabajó con una muestra de 50 trabajadores de Pymes del sector gastronomía, seleccionados por el tipo de muestreo por selección intencional a los que se les aplicó un cuestionario. Para estimar las estadísticas se utilizó estadística descriptiva e inferencial y para contrastar las hipótesis se aplicó la prueba de correlación. Con un resultado de P = 0.00, entre 0.00 y 0.19 en la escala Rho de Spearman. Se concluye, las Tecnologías de la Información y de la Comunicación ayuda en el desempeño laboral de las Pymes en el sector gastronómico en la ciudad de Huánuco.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651143",
        "source": "https://open.umn.edu/opentextbooks/textbooks/sabores-conectados-transformando-la-gastronomia-a-traves-de-las-tecnologias-de-la-informacion-y-comunicacion"
    },
    {
        "title": "Building Information - Representation and Management: Fundamentals and Principles",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Alexander Koutamanis"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjQ5LCJwdXIiOiJibG9iX2lkIn19--5250145163f4505943f6849032bfdd4d9de7a0c1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9789463661607.png",
        "description": "The book presents a coherent theory of building information, focusing on its representation and management in the digital era. It addresses issues such as the information explosion and the structure of analogue building representations to propose a parsimonious approach to the deployment and utilization of symbolic digital technologies like BIM.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463661607",
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-information-representation-and-management-fundamentals-and-principles"
    },
    {
        "title": "Air Safety Investigation: The Journey",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Michiel Schuurman, Delft University of Technology (TU Delft)"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQxMSwicHVyIjoiYmxvYl9pZCJ9fQ==--86889c946baf9ec3a458c251aad19df72c33e346/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_60_77_coverImage_en_US_t.png",
        "description": "'Air Safety Investigation – The Journey' is an introductory book that explores the world of air safety investigation. Unlike a how-to manual for investigating aviation accidents, this book focuses on the essential knowledge and mindset required to conduct a safety investigation. It covers the various phases of an investigation, from gathering facts to formulating safety recommendations, with each chapter addressing a different relevant aspect. With the increasing complexity of investigations, critical thinking, logic, and speculation are essential skills for investigators to possess. This book delves into these topics, offering thought-provoking examples and questions to address the challenges of drawing conclusions and obtaining positive investigative outcomes. Its aim is to help students and readers interested in air safety develop the necessary mindset and knowledge to conduct an investigation. By the end of the book, readers will gain a deeper understanding of the complexities involved in an air safety investigation.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463666923",
        "source": "https://open.umn.edu/opentextbooks/textbooks/air-safety-investigation-the-journey"
    },
    {
        "title": "Testing theory: an introduction",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Peter J.G. Teunissen, Delft University of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyNTcsInB1ciI6ImJsb2JfaWQifX0=--9d0660dccfc18395e38ff51af325efca6c97f64f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_96_113_coverImage_en_US_t.png",
        "description": "These lecture notes are a follow up on Adjustment theory. Adjustment theory deals with the optimal combination of redundant measurements together with the estimation of unknown parameters. There are two main reasons for performing redundant measurements. First, the wish to increase the accuracy of the results computed. Second, the requirement to be able to check for mistakes or errors. The present book addresses this second topic. Although one always will try one's best to avoid making mistakes, they can and will occasionally happen. It is therefore of importance to have ways of detecting and identifying such mistakes. Mistakes or errors can come in many different guises. They could be caused by mistakes made by the observer, or by the fact that defective instruments are used, or by wrong assumptions about the functional relations between the observables. When passed unnoticed, these errors will deteriorate the final results.The goal of this introductory course on testing theory is therefore to convey the necessary knowledge for testing the validity of both the measurements and the mathematical model. Typical questions that will be addressed are: 'How to check the validity of the mathematical model? How to search for certain mistakes or errors? How well can errors be traced? And how do undetected errors affect the final results?' The theory is worked out in detail for the important case of linear(ized) models. Both the parametric form (observation equations) and the implicit form (condition equations) of linear models are treated. As an additional aid in understanding the basic principles involved, a geometric interpretation is given throughout. Attention is also paid to the performance of the testing procedures. The closely related concept of reliability is introduced and diagnostic measures are given to determine the size of the minimal detectable biases. In this introductory text the methodology of testing is emphasized, although various examples are given to illustrate the theory. The methods discussed form the basis for geodetic quality control and they provide the ingredients for the formulation of guidelines for the reliable design of measurement set-ups.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463668927",
        "source": "https://open.umn.edu/opentextbooks/textbooks/testing-theory-an-introduction"
    },
    {
        "title": "Aviation Weather Handbook FAA-H-8083-28",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Federal Aviation Administration"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDUzOSwicHVyIjoiYmxvYl9pZCJ9fQ==--51ce8298a625bf38194997a30a9d6188670131b8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-02-13%20at%2012.29.02%20PM.png",
        "description": "This handbook describes the United States (U.S.) aviation weather program, products, and services. It also documents weather theory and its application to aviation. The objective of this handbook is to help the pilot and operator understand the basics of weather, aviation weather hazards, and aviation weather products. The information included is not prescriptive. Furthermore, the guidance and recommendations in this handbook are not legally binding in their own right and will not be relied upon by the FAA as a separate basis for affirmative enforcement action or other administrative penalty. Conformity with the guidance and recommendations is voluntary only and nonconformity will not affect rights and obligations under existing statutes and regulations.The handbook is a consolidated source of weather information and, in some cases, best practices to assist with providing safety for flight.The visualization of the products discussed in this handbook has evolved over the past decade with the use of internet websites. The use of static black and white depictions of aviation forecasts is quickly becoming a thing of the past. Today’s websites provide the products in color and offer options to select and overlay multiple pieces of weather information.",
        "publisher": "Federal Aviation Administration",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/aviation-weather-handbook-faa-h-8083-28"
    },
    {
        "title": "An Introduction to Waste Management and Circular Economy",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Stijn van Ewijk, University College London",
            "Julia Stegemann, University College London"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA1ODksInB1ciI6ImJsb2JfaWQifX0=--01e35782fcf7869fa175d9b800f7676f0934a26a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/jpg_rgb_1500h.jpg",
        "description": "This introductory textbook provides an essential interdisciplinary guide to waste management and circular economy. It helps students to understand the drivers of waste, the environmental, social, and economic impacts of waste generation, and best practices and technologies for waste management, recycling, energy recovery and disposal.With helpful, full-colour diagrams throughout, each chapter includes learning objectives, introduction to concepts and themes, exercises and review sections, to guide students through the book.The textbook is ideal for teaching environmental engineering and science, as well as interdisciplinary environmental programmes.",
        "publisher": "UCL Press",
        "language": "English",
        "isbn13": "9781800084650",
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-introduction-to-waste-management-and-circular-economy"
    },
    {
        "title": "Introduction to Biosystems Engineering",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Nicholas M. Holden, University College Dublin",
            "Mary Leigh Wolfe, Virginia Tech",
            "Jactone A. Ogejo, Virginia Tech",
            "Enda J. Cummins, University College Dublin"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODIxLCJwdXIiOiJibG9iX2lkIn19--0626a4d2c5564bde3c99547cf0011b1b13f5c40c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover%20-%20Intro%20to%20Biosystems%20Engineering.jpg",
        "description": "The discipline of Biosystems Engineering emerged in the 1990s from the traditional strongholds of agricultural engineering and food engineering. Biosystems engineering integrates engineering science and design with applied biological, environmental, and agricultural sciences.Introduction to Biosystems Engineeringis targeted at 1st and 2nd year university-level students with an interest in biosystems engineering but who are not yet familiar with the breadth and depth of the subject. It is designed as a coherent educational resource, also available for download as individual digital chapters. The book can be used as a localized, customizable text for introductory courses in Biosystems Engineering globally. It is written as a series of stand-alone chapters organized under six major topics: Food and Bioprocessing; Environment; Buildings and Infrastructure; Information and Communications Technology and Data; Machinery Systems; and Energy. Each chapter is organized around stated learning outcomes and describes key concepts, applications of the concepts, and worked examples.Instructors adopting or reviewing this text are encouraged to register with the publisherusing this form.",
        "publisher": "American Society of Agricultural and Biological Engineers (ASABE)",
        "language": "English",
        "isbn13": "9781949373974",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-biosystems-engineering"
    },
    {
        "title": "Intermediate Fluid Mechanics",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "James Liburdy, Oregon State University"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjkwNywicHVyIjoiYmxvYl9pZCJ9fQ==--5fe17a37a18bbedc700af587eab235b1cf22bdc0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Title-Page_Intermediate-Fluid-Mechanics-350x453.png",
        "description": "This book is meant to be a second course in fluid mechanics that stresses applications dealing with external potential flows and intermediate viscous flows. Students are expected to have some background in some of the fundamental concepts of the definition of a fluid, hydrostatics, use of control volume conservation principles, initial exposure to the Navier-Stokes equations, and some elements of flow kinematics, such as streamlines and vorticity. It is not meant to be an in-depth study of potential flow or viscous flow, but is meant to expose students to additional analysis techniques for both of these categories of flows. We will see applications to aerodynamics, with analysis methods able to determine forces on arbitrary bodies. We will also examine some of the exact solutions of the Navier-Stokes equations based on classical fluid mechanics. Finally we will explore the complexities of turbulent flows and how for boundary layer flows one can predict drag forces. This compilation is drafted from notes used in the course Intermediate Fluid Mechanics, offered to seniors and first year graduate students who have a background in mechanical engineering or a closely related area.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": "9781955101103",
        "source": "https://open.umn.edu/opentextbooks/textbooks/intermediate-fluid-mechanics"
    },
    {
        "title": "Dredging Engineering: Special Topics",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Sape A. Miedema"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Njk1LCJwdXIiOiJibG9iX2lkIn19--855f16dae7de240add7443d16d5639ccd45d9065/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000DreEngSpe.jpg",
        "description": "In dredging, production estimating is carried out mainly with analytical physical models of the different dredging processes.Slurry transport of settling slurries and cutting processes in sand, clay and rock are already covered in two other books by the author.Other processes like hopper sedimentation and erosion, water jet fluidization, cutter head spillage, pump/pipeline dynamics and clamshell dredging are covered in this Special Topics Edition.New topics may be added in the near future",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/dredging-engineering-special-topics"
    },
    {
        "title": "Introduction to Mechanical Engineering Design",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Jacqulyn A. Baughman, Iowa State University"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU5NSwicHVyIjoiYmxvYl9pZCJ9fQ==--076ccfe0bae8459534e669fbfadeea4b79b3f032/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Baughman-2022-IntroMechEngDes-350x453.png",
        "description": "A collection of readings and exercises aligned with the course, ME 270, Introduction to Mechanical Engineering Design, at Iowa State University. This course provides an overview of mechanical engineering design with applications to thermal and mechanical systems, and an introduction to current design practices used in industry.",
        "publisher": "Iowa State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-mechanical-engineering-design"
    },
    {
        "title": "Design for Electrical and Computer Engineers",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Christopher Coulston, The Colorado School of Mines",
            "Ralph M. Ford, Pennsylvania State University"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI5NDYsInB1ciI6ImJsb2JfaWQifX0=--2483c477608b5bd39cee37f94e5aedfcd15b31e6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/dfeace.jpg",
        "description": "Originally published by McGraw Hill in 2009, Design for Electrical and Computer Engineers is written for students and teachers engaged in electrical and computer engineering design projects, primarily in the senior year. It guides students and faculty through the steps necessary for the successful execution of design projects. The objective is to provide a treatment of the design process with a sound academic basis that is integrated with practical application. The foundation of the book is a strong vision — that a solid understanding of the Design Process, Design Tools, and the right mix of Professional Skills are critical for project and career success. This text is unique in providing a comprehensive design treatment for electrical and computer engineering.",
        "publisher": "Ralph Ford and Christopher Coulston",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/design-for-electrical-and-computer-engineers"
    },
    {
        "title": "Introduction to Linear, Time-Invariant, Dynamic Systems for Students of Engineering",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "William Hallauer, Virginia Tech"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDE3LCJwdXIiOiJibG9iX2lkIn19--a4087c4574cedbc7828c04a4c4585a452212a554/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntLinTim.png",
        "description": "This is a complete college textbook, including a detailed Table of Contents, seventeen Chapters (each with a set of relevant homework problems), a list of References, two Appendices, and a detailed Index. The book is intended to enable students to:Solve first-, second-, and higher-order, linear, time-invariant (LTI) or­dinary differential equations (ODEs) with initial conditions and excitation, using both time-domain and Laplace-transform methods;Solve for the frequency response of an LTI system to periodic sinusoi­dal excitation and plot this response in standard form;Explain the role of thetime constantin the response of a first-order LTI system, and the roles ofnatural frequency,damping ratio, andresonancein the response of a second-order LTI system;Derive and analyze mathematical models (ODEs) of low-order me­chanical systems, both translational and rotational, that are com­posed of inertial elements, spring elements, and damping devices;Derive and analyze mathematical models (ODEs) of low-order electri­cal circuits composed of resistors, capacitors, inductors, and op­erational amplifiers;Derive (from ODEs) and manipulate Laplace transfer functions and block diagrams representing output-to-input relationships of discrete ele­ments and of systems;Define and evaluatestabilityfor an LTI system;Explainproportional,integral, andderivativetypes of feedback control for single-input, single-output (SISO), LTI systems;Sketch the locus of characteristic values, as a control parameter varies, for a feedback-controlled SISO, LTI system;Use MATLAB as a tool to study the time and frequency responses of LTI systems.The book's gen­eral organization is:Chapters 1-10 deal primarily with the ODEs and behaviors of first-order and second-order dynamic systems;Chapters 11 and 12 discuss the ODEs and behaviors of mechanical systems having two degrees of freedom,i.e., fourth-order systems;Chapters 13 and 14 introduce classical feedback control;Chapter 15 presents the basic features of proportional, in­tegral, and derivative types of classical control;Chapters 16 and 17 discuss methods for analyzing the stability of classical control systems.The general minimum prerequisite for understanding this book is the intellectual matur­ity of a junior-level (third-year) college student in an accredited four-year engineering curriculum. A mathematical second-order system is represented in this book primarily by a single second-order ODE, not in thestate-spaceform by a pair of coupled first-order ODEs. Similarly, a two-degrees-of-freedom (fourth-order) system is represented by two coupled second-order ODEs, not in the state-space form by four coupled first-order ODEs. The book does not usebond graphmodeling, the general and powerful, but complicated, modern tool for analysis of complex, multidisciplinary dynamic systems. The homework problems at the ends of chapters are very important to the learning objectives, so the author attempted to compose problems of practical interest and to make the problem statements as clear, correct, and unambiguous as possible. A major focus of the book is computer calculation of system characteristics and responses and graphical display of results, with use of basic (not advanced) MATLAB commands and programs. The book includes many examples and homework problems relevant to aerospace engineering, among which are rolling dynamics of flight vehicles, spacecraft actuators, aerospace motion sensors, and aeroelasticity. There are also several examples and homework problems illustrating and validating theory by using measured data to identify first- and second-order system dynamic characteristics based on mathematical models (e.g., time constants and natural frequencies), and system basic properties (e.g., mass, stiffness, and damping). Applications of real and simulated experimental data appear in many homework problems. The book contains somewhat more material than can be covered during a single standard college semester, so an instructor who wishes to use this as a one-semester course textbook should not attempt to cover the entire book, but instead should cover only those parts that are most relevant to the course objectives.",
        "publisher": "A.T. Still University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-linear-time-invariant-dynamic-systems-for-students-of-engineering"
    },
    {
        "title": "Ácido oxálico, alternativa orgánica para el control de varroasis (Varroa destructor) en abejas (Apis mellifera)",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Yordan Santiago Ibarra-Navarrete, Universidad Técnica Estatal de Quevedo",
            "Edgar Rodolfo Pinargote-Mendoza, Universidad Técnica Estatal de Quevedo"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2NDksInB1ciI6ImJsb2JfaWQifX0=--f250f828983bd7c4dbb98a61df24ded70a87153e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_63_63_coverImage_es_ES.jpg",
        "description": "El documento titulado 'Ácido oxálico alternativa orgánica para el control de varroasis (Varroa destructor) en abejas (Apis mellifera)' expone la relevancia de la apicultura en Latinoamérica, particularmente en Ecuador, destacando su contribución económica a través de productos como miel, cera, polen, propóleo y Apitoxina. La investigación se enfoca en el ácaroVarroa destructor, un parásito perjudicial para las abejas, que afecta tanto a las crías como a las adultas, debilitando y potencialmente llevando a la muerte a las colmenas. El estudio resalta la importancia del uso de productos orgánicos para el control de la Varroasis, siendo el ácido oxálico uno de los más efectivos. Este compuesto, presente de manera natural en ciertas plantas y en la miel, se ha demostrado altamente eficaz en el control de la Varroa, especialmente en periodos sin cría, logrando una eficacia superior al 90%. La metodología del estudio incluyó investigación bibliográfica y de campo, realizada en el recinto Aguas Frías en la provincia de Los Ríos, Cantón Mocache, durante noviembre y diciembre de 2018. Se emplearon métodos analíticos y deductivos para estudiar la presencia del ácaroVarroa destructoren colmenas de abejasApis mellifera, utilizando fuentes primarias y secundarias. El experimento implicó el manejo de 20 colmenas, evaluando cinco tratamientos diferentes en cuatro repeticiones, con aplicaciones de ácido oxálico y amitraz para determinar la población de ácaros y el estado de las colmenas a lo largo de cinco semanas​​.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651198",
        "source": "https://open.umn.edu/opentextbooks/textbooks/acido-oxalico-alternativa-organica-para-el-control-de-varroasis-varroa-destructor-en-abejas-apis-mellifera"
    },
    {
        "title": "Stability of Ships and Other Bodies - ver 0.7.0",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Genick Bar-Meir"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjQ5OSwicHVyIjoiYmxvYl9pZCJ9fQ==--9a55ba6138153fb45bf9fac312a30c1104fbb8f2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/boat.JPG",
        "description": "This book, Stability of Ships and Other Bodies, describes the fundamentals when and why floating bodies are stable. In addition, it describes steps that transforms un–stable bodies to stable. This book is designed to replace all the other books and inseminate that recent developed technology and advances. The material in standard books is so entrenched, old, and outdated material that one can be only amazed. For example, concept like potential stability is not discussed or even mentioned in any of all the books that this author review.This book written from physical point of view rather then construction point of view like all the books review by this author on stability. It is hoped that the book could be used as a reference book for people who have at least some basics knowledge of science areas such as algebra, basic physics, etc. Even without deep understating the graphs in this book can be used to find necessarily quantities needed to understand if to fix your vessel.",
        "publisher": "Potto Project",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/stability-of-ships-and-other-bodies"
    },
    {
        "title": "Creating a circular healthcare economy: Sustainable strategies for a circular healthcare",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Bart van Straten, Delft University of Technology",
            "Letizia Alvino, University of Twente",
            "Tim Horeman, Delft University of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTg3NywicHVyIjoiYmxvYl9pZCJ9fQ==--6aa5d3c7b23df83fdeb85a76761511f4a239e9fd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_69_86_coverImage_en_US_t.png",
        "description": "Our world is the only planet, as far as we know, which harbors life. The number of humans on our planet has grown tremendously in recent centuries. In 1800 one billion humans occupied our earth; on 15 November 2022, this number reached 8 billion.A result of this growth, the emissions of carbon dioxide (CO2), the primary greenhouse gas emitted by human activities, drastically increased. The increased concentrations of greenhouse gases in our atmosphere foster the long-term increase of our earth’s temperatures, also referred to as global warming.While the earth’s population grew, so did our mass consumption society. After the Second World War humanity witnessed gigantic global economic development with great technological improvements. Computers, laptops, airplanes, tablets and Internet of Things connected humans all over the world. The hunger for plastics and steel grew as all products had to be manufactured in ever-increasing volumes. As the economy developed, our consumption grew apace.The healthcare sector has seen the same increase of consumption. The number of patients grew, and so did the number of single-use medical products. As products become more complex and more different materials were combined., recycling became more difficult. Thus, hospitals transformed into waste factories with ever-growing waste streams. The consumption of (disposable) medical devices takes up scarce raw materials and contributes to the growing CO2 emissions.In this book, Van Straten, Alvino and Horeman present their findings on how to create a sustainable healthcare economy by introducing different circular strategies. In 9 chapters, they present a wide variation of studies as practical cases to show what strategies and actions can be taken in order to implement sustainable strategies for a circular healthcare.This book was written in line with the courses the authors developed at TU Extension School, the open online education edX platform of Delft University of Technology/TU Delft, a leading university in science and technology, recognized for its world-class research. This book is a manual for everyone who follows the online course ‘Circular strategies for a sustainable healthcare’, but certainly also for everyone who wants to discover more about circular strategies and wants to understand the principles and practices of circular economy and urban mining. This book is suitable for students, researchers, policymakers and practitioners in the fields of healthcare sustainability, management, business and economics.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463667302",
        "source": "https://open.umn.edu/opentextbooks/textbooks/creating-a-circular-healthcare-economy-sustainable-strategies-for-a-circular-healthcare"
    },
    {
        "title": "Adjustment theory: an introduction",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Peter J.G. Teunissen, Delft University of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIwNTYsInB1ciI6ImJsb2JfaWQifX0=--775ace5e3e3982342570e5d665b214ba05979499/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_95_112_coverImage_en_US_t.png",
        "description": "Adjustment theory can be regarded as the part of mathematical geodesy that deals with the optimal combination of redundant measurements together with the estimation of unknown parameters. It is essential for a geodesist, its meaning comparable to what mechanics means to a civil engineer or a mechanical engineer. Historically, the first methods of combining redundant measurements originate from the study of three problems in geodesy and astronomy, namely to determine the size and shape of the Earth, to explain the long-term inequality in the motions of Jupiter and Saturn, and to find a mathematical representation of the motions of the Moon. Nowadays, the methods of adjustment are used for a much greater variety of geodetic applications, ranging from, for instance, surveying and navigation to remote sensing and global positioning.The two main reasons for performing redundant measurements are the wish to increase the accuracy of the results computed and the requirement to be able to check for errors. Due to the intrinsic uncertainty in measurements, measurement redundancy generally leads to an inconsistent system of equations. Without additional criteria, such a system of equations is not uniquely solvable. In this introductory course on adjustment theory, methods are developed and presented for solving inconsistent systems of equations. The leading principle is that of least-squares adjustment together with its statistical properties.The inconsistent systems of equations can come in many different guises. They could be given in parametric form, in implicit form, or as a combination of these two forms. In each case the same principle of least-squares applies. The algorithmic realizations of the solution will differ however. Depending on the application at hand, one could also wish to choose between obtaining the solution in one single step or in a step-wise manner. This leads to the need of formulating the system of equations in partitioned form. Different partitions exist, measurement partitioning, parameter partitioning, or a partitioning of both measurements and parameters. The choice of partitioning also affects the algorithmic realization of the solution. In this introductory text the methodology of adjustment is emphasized, although various samples are given to illustrate the theory. The methods discussed form the basis for solving different adjustment problems in geodesy.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463668842",
        "source": "https://open.umn.edu/opentextbooks/textbooks/adjustment-theory-an-introduction"
    },
    {
        "title": "AC Electrical Circuit Analysis: A Practical Approach",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "James M. Fiore, Mohawk Valley Community College"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI0NCwicHVyIjoiYmxvYl9pZCJ9fQ==--a274cb828696dc5bb0dfea1bb225c4fad49ed2b7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/acelecirc.png",
        "description": "Welcome to the AC Electrical Circuit Analysis, an open educational resource (OER). The goal of this text is to introduce the theory and practical application of analysis of AC electrical circuits. It assumes familiarity with DC circuit analysis. If you have not studied DC circuit analysis, it is strongly recommended that you read the companion OER text, DC Electrical Circuit Analysis before continuing. Both texts are offered free of charge under a Creative Commons non-commercial, share-alike with attribution license. For your convenience, along with the free pdf and odt files, print copies are available at a very modest charge. Check my web sites for links.This text is based on the earlier Workbook for AC Electrical Circuits, which it replaces. The original expository text has been greatly expanded and includes many examples along with computer simulations. For the convenience of those who used the Workbook, many of the problem sets are the same, with some re-ordering depending on the chapter.",
        "publisher": "dissidents",
        "language": "English",
        "isbn13": "9798605022282",
        "source": "https://open.umn.edu/opentextbooks/textbooks/ac-electrical-circuit-analysis-a-practical-approach-fiore"
    },
    {
        "title": "Airplane Flying Handbook (FAA-H-8083-3C)",
        "copyright_year": "2021",
        "last_update": "2023",
        "authors": [
            "Federal Aviation Administration"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzI3OSwicHVyIjoiYmxvYl9pZCJ9fQ==--d820831167bb9ccf2acf31b7786acb080e2e77c8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Capture.JPG",
        "description": "The Airplane Flying Handbook provides basic knowledge that is essential for pilots. This handbook introduces basic pilot skills and knowledge that are essential for piloting airplanes. It provides information on transition to other airplanes and the operation of various airplane systems. It is developed by the Flight Standards Service, Airman Testing Standards Branch, in cooperation with various aviation educators and industry. This handbook is developed to assist student pilots learning to fly airplanes. It is also beneficial to pilots who wish to improve their flying proficiency and aeronautical knowledge, those pilots preparing for additional certificates or ratings, and flight instructors engaged in the instruction of both student and certificated pilots. It introduces the future pilot to the realm of flight and provides information and guidance in the performance of procedures and maneuvers required for pilot certification.",
        "publisher": "Federal Aviation Administration",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/airplane-flying-handbook-faa-h-8083-3c"
    },
    {
        "title": "Building Cost Planning: Best Practices and Insights",
        "copyright_year": "2023",
        "last_update": "2024",
        "authors": [
            "Thilini Jayawickrama, University of South Australia",
            "Ruchini Jayasinghe, University of South Australia",
            "Ravindu Kahandawa, Massey University",
            "Rameez Rameezdeen, University of South Australia",
            "Don Leelarathne, Project Cost Management Group (PCMG)",
            "Inoka Withana Gamage, Jacobs"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE4MTgsInB1ciI6ImJsb2JfaWQifX0=--9073d0256ab8bfa4fce4f58f7403cacdc5895d0a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Building-Cost-Planning-Cover-Designs-4-350x467.png",
        "description": "This book focuses on the cost planning of building construction projects with special reference to the Australian and New Zealand context. Design development and cost planning with elemental analysis are emphasised in the pre-construction cost management process in the region. This book translates the well-established practice of pre-construction cost management process in the construction industry into a published academic and professional resource which can be used for teaching higher education students and for professional training programs.Building cost planning is considered from the client and the design team’s perspective and focuses on the functions of a cost manager. From the overview of the construction industry and the client’s team, to the detailed cost planning process and cost planning techniques at progressive stages in the pre-construction phase, this book is ideal as a guide to cost plan building construction projects. It follows an interactive style by featuring learning outcomes, self-review questions and learning activities for each chapter. It also extends theory into applications with case studies incorporated from the Australian and New Zealand construction industries. These approaches make this book useful for both students and practitioners in construction management.",
        "publisher": "Council of Australian University Librarians",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-cost-planning-best-practices-and-insights"
    },
    {
        "title": "Fundamentals of Compressible Flow Mechanics",
        "copyright_year": "2004",
        "last_update": "2021",
        "authors": [
            "Genick Bar-Meir"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzMxMiwicHVyIjoiYmxvYl9pZCJ9fQ==--e8b8d3c077894fc156b3827bead6cabe65a5a3e1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Capture121.JPG",
        "description": "This book deals with an introduction to the flow of compressible substances (gases). The main difference between compressible flow and almost incompressible flow is not the fact that compressibility has to be considered. Rather, the difference is in two phenomena that do not exist in incompressible flow. The first phenomenon is the very sharp discontinuity (jump) in the flow in properties. The second phenomenon is the choking of the flow. Choking is when downstream variations don't effect the flow. Though choking occurs in certain pipe flows in astronomy, there also are situations of choking in general (external) flow.",
        "publisher": "Potto Project",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-compressible-flow-mechanics"
    },
    {
        "title": "Notes on Diffy Qs: Differential Equations for Engineers",
        "copyright_year": "2014",
        "last_update": "2020",
        "authors": [
            "Jirí Lebl, Oklahoma State University"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTcyLCJwdXIiOiJibG9iX2lkIn19--6e55ba7843506ce7165e1d6b24ac6f2fc037b18f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781505698190.png",
        "description": "A one semester first course on differential equations, aimed at engineering students. Prerequisite for the course is the basic calculus sequence. This free online book (e-book in webspeak) should be usable as a stand-alone textbook or as a companion to a course using another book such as Edwards and Penney, Differential Equations and Boundary Value Problems: Computing and Modeling or Boyce and DiPrima, Elementary Differential Equations and Boundary Value Problems (section correspondence to these two is given). I developed and used these notes to teach Math 286/285 at the University of Illinois at Urbana-Champaign Sample Dirichlet problem solution (one is a 4-day-a-week, the other a 3-day-a-week semester-long course). I have also taught Math 20D at University of California, San Diego with these notes (a 3-day-a-week quarter-long course). There is enough material to run a 2-quarter course, and even perhaps a two semester course depending on lecturer speed.",
        "publisher": "Jirí Lebl",
        "language": "English",
        "isbn13": "9781505698190",
        "source": "https://open.umn.edu/opentextbooks/textbooks/notes-on-diffy-qs-differential-equations-for-engineers"
    },
    {
        "title": "Basic Concepts of Structural Design for Architecture Students",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Anahita Khodadadi"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk1MiwicHVyIjoiYmxvYl9pZCJ9fQ==--bb3c5509aaf8cdb85b260999b11a561b95c0c1fb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/thumbnail%20(1).jpg",
        "description": "This book aims to narrate fundamental concepts of structural design to architecture students such that they have minimum involvement with math problem-solving. Within this book, students learn about different types of loads, forces and vector addition, the concept of equilibrium, internal forces, geometrical and material properties of structural elements, and rules of thumb for estimating the proportion of some structural systems such as catenary cables and arches, trusses, and frame structures.",
        "publisher": "Portland State University Library",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/basic-concepts-of-structural-design-for-architecture-students"
    },
    {
        "title": "Structural Dynamics",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Hilmi Luş, Bogazici University",
            "Sinan Keten, Northwestern University"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI5MzQsInB1ciI6ImJsb2JfaWQifX0=--2538f3f29317a0ef17761638ff21fcd066eec604/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/sd.jpg",
        "description": "This textbook represents our effort to make freely available to students and practitioners the theory and common applications of structural dynamics. The presentation is hoped to inspire interest and active learning. The book's content is expected to evolve and expand in time so we truly welcome suggestions from readers and colleagues. To make available in a timely manner, the first upload/edition has been limited topics that could be covered in a senior level undergraduate or an introductory level graduate course in a single semester. Given the vastness of the theory and practical details, such a compromise was inevitable. On the other hand we hope that by continuing to expand the contents at certain intervals the material will eventually cover a very significant portion of the relevant literature and current practices. This living nature of the electronic medium was what motivated us to undertake this project to begin with. We thank Northwestern University Libraries for their interest in this textbook, and we express our gratitude to Xinyan Yang for her help in solving many problems we encountered along the way.",
        "publisher": "Northwestern University Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/structural-dynamics"
    },
    {
        "title": "Sustainable Mobility",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Shams Tanvir, California State University – Long Beach"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI5NDAsInB1ciI6ImJsb2JfaWQifX0=--72e776301edda0e6302812208f71b039ed8314d4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Text-Book-Option-3-December-20231-350x467.png",
        "description": "This textbook and OER material cover tools and basic knowledge required to prepare transportation engineers and planners to contribute towards a carbon-neutral mobility future. In addition, we will explore the potential for vehicle electrification, automation, connectivity, and ridesharing to reduce the carbon impacts of auto mobility.  The textbook modules are intended to inform and teach students how to design streets for modes that have almost no carbon emissions. The goal of the textbook is to train engineering students on existing tools and policy levers that can be used to incorporate emerging transportation technologies in a sustainable, equitable, and efficient manner. The course is designed for graduate transportation engineering, and city and regional planning students. The undergraduate seniors will be able to absorb the materials given they have already taken fundamental courses on transportation engineering and planning, including traffic engineering and highway design.This textbook is a product of the grant OERTransport: Enabling Transportation Planning Professional Advancement awarded to the University of Texas-Arlington (UTA) in consortium with California Polytechnic State University (Cal Poly) and the University of South Florida (USF). It was developed under an Open Textbooks Pilot grant from the Fund for the Improvement of Postsecondary Education (FIPSE), U.S. Department of Education. However, its contents do not necessarily represent the policy of the Department of Education, and no endorsement by the Federal Government should be assumed.",
        "publisher": "Mavs Open Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/sustainable-mobility"
    },
    {
        "title": "Building with Nature & Beyond: Principles for designing nature based engineering solutions",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Jill H. Slinger, Delft University of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzI4MiwicHVyIjoiYmxvYl9pZCJ9fQ==--6dabe77b218b59af4a7a1b750474f785a4e07139/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_45_62_coverImage_en_US_t.png",
        "description": "This book is based upon the edX MOOCs Engineering: Building with Nature and Beyond Engineering: Building with Nature. The Engineering: Building with Nature MOOC, explores the use of natural materials and ecological processes in achieving effective and sustainable hydraulic infrastructure designs, distilling Engineering and Ecological Design Principles. In the Beyond Engineering: Building with Nature course, the missing element of Social Design Principles is developed and taught.Join us in exploring the interface between hydraulic engineering, nature and society!",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463664578",
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-with-nature-beyond-principles-for-designing-nature-based-engineering-solutions"
    },
    {
        "title": "Werktuigkundige Systemen",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Jan C. Cool, Delft University of Technology",
            "Gabriëlle J.M. Tuijthof, University of Twente",
            "Giuseppe Radaelli, Delft University of Technology",
            "Regine W. Vroom, Delft University of Technology"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTU3OSwicHVyIjoiYmxvYl9pZCJ9fQ==--e0627647fa4a6fa9fb37faf80ea66080d8156668/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_68_85_coverImage_en_US_t.png",
        "description": "Het boekWerktuigkundige Systemenis een compacte inleiding op het systeemdenken in de werktuigbouwkunde, met nadruk op inzicht en grafische methoden, gelardeerd met prikkelende werkingsprincipes en constructie-elementen. Velen merken dat ze nog lang nadat ze het vak gedaan hebben dit boek als naslagwerk gebruiken en het steeds meer gaan waarderen, ook omdat het boek de basis legt voor veel vervolgvakken en projecten.Het boek is al jarenlang in gebruik bij eerstejaars studenten Werktuigbouwkunde aan de TU Delft. Diverse docenten gebruiken het bij vakken of ontwerp­projecten.",
        "publisher": "TU Delft Open",
        "language": "Dutch; Flemish",
        "isbn13": "9789463667241",
        "source": "https://open.umn.edu/opentextbooks/textbooks/werktuigkundige-systemen"
    },
    {
        "title": "Inzicht: Academische Vaardigheden voor Bouwkundigen, 2e editie - 2e editie",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "MaartenJan Hoekstra, Delft University of Technology",
            "Louis Lousberg, Delft University of Technology",
            "Remon Rooij, Delft University of Technology",
            "Willemijn Wilms Floet, Delft University of Technology",
            "Sake Zijlstra, Delft University of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMyNDgsInB1ciI6ImJsb2JfaWQifX0=--b3a59f36d2d32a9e826fa32719ce44d0c1a5a9b3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_99_117_coverImage_en_US_t.png",
        "description": "Het boek Academische Vaardigheden voor Bouwkundigen geeft een verdiepend beeld van bouwkunde als wetenschappelijke discipline, gaat expliciet in op de relatie tussen ontwerp en onderzoek en richt zich met name op praktische vaardigheden die bouwkundestudenten ontwikkelen gedurende hun bacheloropleiding in Delft. Het boek is opgebouwd uit vier delen. Deel A richt zich op de plaats van bouwkunde binnen de wetenschap. Deel B richt zich op basisvaardigheden: algemene academische vaardigheden voor bouwkundigen. Deel C diept specifieke bouwkundige methoden van onderzoek uit. Deel D, het laatste deel, is enerzijds gericht op de praktijk en anderzijds op reflectie. Door deze brede opzet kan het boek niet alleen direct gebruikt worden door studenten en docenten in de leerlijn Academische Vaardigheden, maar juist ook in de andere leerlijnen en modulen. Tevens is het boek een naslagwerk voor andere Bouwkunde- en Architectuuropleidingen in binnen- en buitenland dat inzicht geeft hoe wij binnen de faculteit Bouwkunde van de TU Delft aankijken tegen het vakgebied en welke academische vaardigheden daar op bachelorniveau bij horen.",
        "publisher": "TU Delft Open",
        "language": "Dutch; Flemish",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/inzicht-academische-vaardigheden-voor-bouwkundigen-2e-editie"
    },
    {
        "title": "Basic Engineering Data Collection and Analysis",
        "copyright_year": "2001",
        "last_update": null,
        "authors": [
            "Steve Vardeman, Ames, Iowa",
            "J. Marcus Jobe, Oxford, Ohio"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQ3OCwicHVyIjoiYmxvYl9pZCJ9fQ==--103735f76df76607eb0c037930ccb67f4669827b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-01-25%20at%207.37.27%20AM.png",
        "description": "InBasic Engineering Data Collection and Analysis, Stephen B. Vardeman and J. Marcus Jobe stress the practical over the theoretical. Step by step, students get real engineering data and scenario examples along with chapter-long case studies that illustrate concepts in realistic, thoroughly detailed situations. This approach encourages students to work through the material by carrying out data collection and analysis projects from problem formulation through the preparation of professional technical reports—just as if they were on the job.",
        "publisher": "Iowa State University",
        "language": "English",
        "isbn13": "9781958291030",
        "source": "https://open.umn.edu/opentextbooks/textbooks/basic-engineering-data-collection-and-analysis"
    },
    {
        "title": "Building Maintenance & Construction: Tools and Maintenance Tasks",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Clifford Rutherford"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTM4LCJwdXIiOiJibG9iX2lkIn19--b69c4900c67a758cd0b2db7b3c8695e4da96deab/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000BuiMaiCon.png",
        "description": "Building Maintenance & Construction: Tools and Maintenance Tasks introduces and develops knowledge of basic building maintenance tools and materials, applied skills and techniques, industry health and safety standards, and preventive maintenance and troubleshooting practices required by employers for entry-level positions in the building trades and facilities maintenance fields.",
        "publisher": "University of Hawaii Manoa",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-maintenance-construction-tools-and-maintenance-tasks"
    },
    {
        "title": "Introduction to Vacuum Technology",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "David M. Hata, Portland Community College",
            "Elena V. Brewer, SUNY Erie Community College",
            "Nancy J. Louwagie, Normandale Community College"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxNjEsInB1ciI6ImJsb2JfaWQifX0=--eafb9e36e00fa1392d0ff3d9a8de6519d676358d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/vacuum-tech-cover-350x525-1.jpeg",
        "description": "Vacuum systems are critical to many industries. They are vital to establishing required process pressures, establishing a clean process environment, and removing reaction by-products from the process chamber. This text, a revision and expansion of David Hata’sIntroduction to Vacuum Technologypublished in 2008, addresses basic topics in vacuum technology for individuals tasked with maintaining vacuum systems and instructors teaching technician-level courses. The topics are carefully curated to the needs of technicians in a production environment and the types of vacuum systems used, and the accompanying laboratory manual and instructor’s guide support the delivery of lecture-laboratory courses.This book approaches vacuum systems from a pressure regime viewpoint, covering basic vacuum science, followed by the rough vacuum regime, including gas load, pumping mechanisms, pressure measurement, vacuum system construction, and basic troubleshooting concepts. The study of high vacuum systems follows and the same topics are revisited, and finally the topics of leak detection and residual gas analysis are discussed.",
        "publisher": "Milne Open Textbooks",
        "language": "English",
        "isbn13": "9781942341963",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-vacuum-technology"
    },
    {
        "title": "Biomedical Engineering for Africa",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Tania S Douglas, Cape Town, South Africa"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDI3MCwicHVyIjoiYmxvYl9pZCJ9fQ==--7e84f63223b93283f5749e260090ad7b12e73481/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_24_24_coverImage_t.png",
        "description": "Health technology innovation in low- and middle-income countries (LMICs), including countries in Africa, falls far short of meeting the healthcare needs of these settings. The result is a heavy reliance on products and technologies imported from industrialised countries that are often not suited to, or sustainable for, LMICs.Appropriate healthcare products for LMICs are best developed in these countries, where local knowledge and understanding of needs, context and available resources may be incorporated into designs and implementation plans. The objectives for enabling health technology development in LMICs include: 1) expanding the base of expertise through research training programmes with a problem-solving focus; 2) stimulating new knowledge, approaches and solutions by enabling innovation; and 3) integrating research communities within and across institutions to build critical mass.The field of biomedical engineering is central to health technology innovation. This book is a response to the need for biomedical engineering capacity in Africa. It is grounded in the African context. It serves as a resource for academics and students in biomedical engineering, for those interested in entering the field in any capacity and for practitioners at every stage of product development. University leaders intent on establishing new biomedical engineering programmes or departments, may draw on the content for guidance on structuring their offerings. The book reaches beyond Africa, as it is relevant to other LMIC settings, and provides insights to guide global health initiatives focused on technology innovation.",
        "publisher": "University of Cape Town Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/biomedical-engineering-for-africa"
    },
    {
        "title": "Sustainability: A Comprehensive Foundation",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [
            "Tom Theis, University of Illinois, Chicago",
            "Jonathan Tomkin, University of Illinois, Urbana-Champaign"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzksInB1ciI6ImJsb2JfaWQifX0=--47d811fc0148daafa4fbe1ed1e470b454fe89d9f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000CompFound.png",
        "description": "With “Sustainability: A Comprehensive Foundation”, first and second-year college students are introduced to this expanding new field, comprehensively exploring the essential concepts from every branch of knowledge – including engineering and the applied arts, natural and social sciences, and the humanities. As sustainability is a multi-disciplinary area of study, the text is the product of multiple authors drawn from the diverse faculty of the University of Illinois: each chapter is written by a recognized expert in the field.This text is designed to introduce the reader to the essential concepts of sustainability. This subject is of vital importance seeking as it does to uncover the principles of the long-term welfare of all the peoples of the planet but is only peripherally served by existing college textbooks.The content is intended to be useful for both a broad-based introductory class on sustainability and as a useful supplement to specialist courses which wish to review the sustainability dimensions of their areas of study. By covering a wide range of topics with a uniformity of style, and by including glossaries, review questions, case studies, and links to further resources, the text has sufficient range to perform as the core resource for a semester course. Students who cover the material in the book will be conversant in the language and concepts of sustainability, and will be equipped for further study in sustainable planning, policy, economics, climate, ecology, infrastructure, and more.Furthermore, the modular design allows individual chapters and sections to be easily appropriated without the purchase of a whole new text. This allows educators to easily bring sustainability concepts, references, and case studies into their area of study.This appropriation works particularly well as the text is free downloadable to anyone who wishes to use it. Furthermore, readers are encouraged to work with the text. Provided there is attribution to the source, users can adapt, add to, revise and republish the text to meet their own needs.Because sustainability is a cross-disciplinary field of study, producing this text has required the bringing together over twenty experts from a variety of fields. This enables us to cover all of the foundational components of sustainability: understanding our motivations requires the humanities, measuring the challenges of sustainability requires knowledge of the sciences (both natural and social), and building solutions requires technical insight into systems (such as provided by engineering, planning, and management).Readers accustomed to textbooks that present material in a unitary voice might be surprised to find in this one statements that do not always agree. Here, for example, cautious claims about climate change stand beside sweeping pronouncements predicting future social upheaval engendered by a warming world. And a chapter that includes market-based solutions to environmental problems coexists with others that call for increased government control. Such diversity of thought characterizes many of the fields of inquiry represented in the book; by including it, we invite users to engage in the sort of critical thinking a serious study of sustainability requires.It is our sincerest hope that this work is shared freely and widely, as we all struggle to understand and solve the enormous environmental challenges of our time.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/sustainability-a-comprehensive-foundation"
    },
    {
        "title": "Electromagnetics Vol 1",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Steven W. Ellingson, Virginia Tech"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU3LCJwdXIiOiJibG9iX2lkIn19--91e7132b0a0e7b049342f38ef5fcd5ad719369e3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9780997920192.png",
        "description": "ElectromagneticsVolume 1 by Steven W. Ellingson is a 238-page, peer-reviewed open educational resource intended for electrical engineering students in the third year of a bachelor of science degree program. It is intended as a primary textbook for a one-semester first course in undergraduate engineering electromagnetics. The book employs the “transmission lines first” approach in which transmission lines are introduced using a lumped-element equivalent circuit model for a differential length of transmission line, leading to one-dimensional wage equations for voltage and current.Additional ResourcesProblem sets and the corresponding solution manual are also available.",
        "publisher": "Virginia Tech Libraries",
        "language": "English",
        "isbn13": "9780997920192",
        "source": "https://open.umn.edu/opentextbooks/textbooks/electromagnetics-vol-1"
    },
    {
        "title": "Design Roadmapping: Guidebook for Future Foresight Techniques",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Lianne Simonse, Delft University of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE5MzIsInB1ciI6ImJsb2JfaWQifX0=--a769581d193efc00c3d71ee7f0383846c6448d49/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/drm.jpg",
        "description": "DESIGN ROADMAPPING is for anyone interested in design, strategy and innovation, and its wonderful combinations. For those who dare to create a future vision, frame the time pacing and map the pathways towards it.This guidebook teaches you how to create a roadmap. It outlines the origins, design theories and science results. Strategic designers, innovation managers and professors share their roadmapping experiences, views and achievements, including venture CPOs, Head of Design, product and program managers of international companies such as Canon, Peerby, Ferrari, Philips, Victoria State Library and many more.By design roadmapping you devise creative responses to future strategic challenges. Guided by future foresight techniques, you uncover new trends, scout for new technologies and map the values and ideas on the roadmap. Through strong visualization, a design roadmap supports an organizational mindset on value innovations.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463667968",
        "source": "https://open.umn.edu/opentextbooks/textbooks/design-roadmapping-guidebook-for-future-foresight-techniques"
    },
    {
        "title": "Aplicaciones y Teoría de Ingeniería de Microondas",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQzLCJwdXIiOiJibG9iX2lkIn19--b324027369f193d50df1d8180cab73b4760f7112/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000AliTeoIng.png",
        "description": "Teoria, analisis y sintesis de tecnicas de diseño para sistemas de teleomunicaciones que operan en el rango de 1GHz a 100 GHZ",
        "publisher": "LATIn Project",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/aplicaciones-y-teoria-de-ingenieria-de-microondas"
    },
    {
        "title": "Introduction to Systems Biology: Workbook for Flipped-Classroom Teaching",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Thomas Sauter, Esch-sur-Alzette, Luxembourg",
            "Marco Albrecht, Esch-sur-Alzette, Luxembourg"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDYxNSwicHVyIjoiYmxvYl9pZCJ9fQ==--630187190d84d0b85709381828819784fcb8b7a6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/obp.0291.jpg",
        "description": "This book is an introduction to the language of systems biology, which is spoken among many disciplines, from biology to engineering. Authors Thomas Sauter and Marco Albrecht draw on a multidisciplinary background and evidence-based learning to facilitate the understanding of biochemical networks, metabolic modeling and system dynamics.Their pedagogic approach briefly highlights core ideas of concepts in a broader interdisciplinary framework to guide a more effective deep dive thereafter. The learning journey starts with the purity of mathematical concepts, reveals its power to connect biological entities in structure and time, and finally introduces physics concepts to tightly align abstraction with reality.This workbook is all about self-paced learning, supports the flipped-classroom concept, and kick-starts with scientific evidence on studying. Each chapter comes with links to external YouTube videos, learning checklists, and Integrated real-world examples to gain confidence in thinking across scientific perspectives. The result is an integrated approach that opens a line of communication between theory and application, enabling readers to actively learn as they read.This overview of capturing and analyzing the behavior of biological systems will interest adherers of systems biology and network analysis, as well as related fields such as bioinformatics, biology, cybernetics, and data science.",
        "publisher": "Open Book Publishers",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-systems-biology-workbook-for-flipped-classroom-teaching"
    },
    {
        "title": "Counter Unmanned Aircraft Systems Technologies and Operations",
        "copyright_year": "2020",
        "last_update": "2024",
        "authors": [
            "Randall K. Nichols, Kansas State University",
            "Hans C. Mumm, California University of Pennsylvania",
            "Wayne D. Lonstein, Pennsylvania State University",
            "Julie J.C.H Ryan, Wyndrose Technical Group",
            "Candice Carter, NASA"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzMTUsInB1ciI6ImJsb2JfaWQifX0=--a8a6a08c8c6a813c626ad819e9d2d1156637639f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover_Counter-Unmanned-Aircraft-Systems-Technologies-and-Operations2-350x453.jpg",
        "description": "As the quarter-century mark in the 21st Century nears, new aviation-related equipment has come to the forefront, both to help us and to haunt us. (Coutu, 2020). This is particularly the case with unmanned aerial vehicles (UAVs). These vehicles have grown in popularity and accessible to everyone. Of different shapes and sizes, they are widely available for purchase at relatively low prices. They have moved from the backyard recreation status to important tools for the military, intelligence agencies, and corporate organizations. New practical applications such as military equipment and weaponry are announced on a regular basis – globally. (Coutu, 2020). Every country seems to be announcing steps forward in this bludgeoning field.",
        "publisher": "New Prairie Press",
        "language": "English",
        "isbn13": "9781944548278",
        "source": "https://open.umn.edu/opentextbooks/textbooks/counter-unmanned-aircraft-systems-technologies-and-operations"
    },
    {
        "title": "Introduction to Mechanical Design and Manufacturing",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "David Jensen, University of Arkansas"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE2NzUsInB1ciI6ImJsb2JfaWQifX0=--8a780850831ea4d92772423884f8332a48b8f6a2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Introduction-to-Mechanical-Design-and-Manufacturing-350x453.png",
        "description": "An introductory text on the design and manufacturing of products from a mechanical engineering perspective.",
        "publisher": "University of Arkansas",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-mechanical-design-and-manufacturing"
    },
    {
        "title": "Introduction to Communication Systems: An Interactive Approach Using the Wolfram Language",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Victor S. Frost, University of Kansas"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjc3OCwicHVyIjoiYmxvYl9pZCJ9fQ==--53db68a29184e3512646b6d06dc69eb0e42877e0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Book-Cover-picture-min.png",
        "description": "This ebook provides a unique pedagogical approach to teaching the fundamentals of communication systems using interactive graphics and in-line questions. The material opens with describing the transformation of bits into digital baseband waveforms. Double-sideband suppressed carrier modulation and quadrature modulation then provide the foundation for the discussions of Binary Phase Shift Keying (BPSK), Quadrature Phase Shift Keying (QPSK), M-ary Quadrature Amplitude Modulation (M-QAM), M-ary Phase Shift Keying (MPSK), and the basic theory of Orthogonal Frequency Division Multiplexing (OFDM). Traditional analog modulation systems are also described. Systems trade-offs, including link budgets, are emphasized. Interactive graphics allow the students to engage with and visualize communication systems concepts. Interactivity and in-line review questions enables students to rapidly examine system tradeoffs and design alternatives. The topics covered build upon each other culminating with an introduction to the implementation of OFDM transmitters and receivers, the ubiquitous technology used in WiFi, 4G and 5G communication systems.",
        "publisher": "University of Kansas Libraries",
        "language": "English",
        "isbn13": "9781936153251",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-communication-systems-an-interactive-approach-using-the-wolfram-language"
    },
    {
        "title": "Semiconductor Devices: Theory and Application",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "James M. Fiore, Mohawk Valley Community College"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDk2LCJwdXIiOiJibG9iX2lkIn19--a9765616c46ea4cd39030eaffcac6398502ce084/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000SemDevThA.png",
        "description": "The goal of this text, as its name implies, is to allow the reader to become proficient in the analysis and design of circuits utilizing discrete semiconductor devices. It progresses from basic diodes through bipolar and field effect transistors. The text is intended for use in a first or second year course on semiconductors at the Associate or Baccalaureate level. In order to make effective use of this text, students should have already taken coursework in basic DC and AC circuits, and have a solid background in algebra and trigonometry along with exposure to phasors. Calculus is used in certain sections of the text but for the most part it is used for equation derivations and proofs, and is kept to a minimum. For students without a calculus background these sections may be skipped without a loss of continuity.There is also alab manualfor this textbook.",
        "publisher": "dissidents",
        "language": "English",
        "isbn13": "9781796543537",
        "source": "https://open.umn.edu/opentextbooks/textbooks/semiconductor-devices-theory-and-application"
    },
    {
        "title": "Dynamic data processing: Recursive least-squares",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Peter J.G. Teunissen, Delft University of Technology"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI5NDMsInB1ciI6ImJsb2JfaWQifX0=--aa4df546bf6a06c9c47cd3aadd26ce527de8ba51/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_98_116_coverImage_en_US_t.png",
        "description": "This book is a follow-up on Adjustment theory. It extends the theory to the case of time-varying parameters with an emphasis on their recursive determination. Least-squares estimation will be the leading principle used. A least-squares solution is said to be recursive when the method of computation enables sequential, rather than batch, processing of the measurement data. The recursive equations enable the updating of parameter estimates for new observations without the need to store all past observations. Methods of recursive least-squares estimation are therefore particularly useful for applications in which the time-varying parameters need to be instantly determined. Important examples of such applications can be found in the fields of real-time kinematic positioning, navigation and guidance, or multivariate time series analysis. The goal of this book is therefore to convey the necessary knowledge to be able to process sequentially collected measurements for the purpose of estimating time-varying parameters.When determining time-varying parameters from sequentially collected measurement data, one can discriminate between three types of estimation problems: filtering, prediction and smoothing. Filtering aims at the determination of current parameter values, while smoothing and prediction aim at the determination of respectively past and future parameter values. The emphasis in this book will be on recursive least-squares filtering. The theory is worked out for the important case of linear(ized) models. The measurement-update and time-update equations of recursive least-squares are discussed in detail. Models with sequentially collected data, but time-invariant parameters are treated first.In this case only the measurement-update equations apply. State-space models for dynamic systems are discussed so as to include time-varying parameters. This includes their linearization and the construction of the state transition matrix. Elements from the theory of random functions are used to describe the propagation laws for linear dynamic systems. The theory is illustrated by means of many worked out examples. They are drawn from applications such as kinematic positioning, satellite orbit determination and inertial navigation.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463669177",
        "source": "https://open.umn.edu/opentextbooks/textbooks/dynamic-data-processing-recursive-least-squares"
    },
    {
        "title": "Crawford Automation – A Guided Application of Structured Problem Solving",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Stephen Thomson, Institute of Technology and Advanced Learning",
            "Kevin Hollis, Conestoga College",
            "Laurie Turnbull, Conestoga College"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzQ0NSwicHVyIjoiYmxvYl9pZCJ9fQ==--d17187b1c620322df7ad051245fae457c27ac9ea/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/crawford-case-cover-1-12-1-768x1024%20(1).png",
        "description": "This is a multimedia-enabled case in which students will be guided, by an industry expert, to apply structured problem-solving that addresses a typical supply chain problem, missing parts.  What first appears as the issue may be a symptom of a root cause(s). The case utilizes videos, data files for analytics, audio recording, and videogame-style exercises to find the missing box of parts.  The case is a collaboration between the Conestoga Centre for Supply Chain Innovation and ATS Automation and utilizes the ATS Business Model (ABM) approach to identifying and solving root causes. The case can be used in any Continuous Improvement course or program for either Business or Engineering students.",
        "publisher": "eCampusOntario",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/crawford-automation-a-guided-application-of-structured-problem-solving"
    },
    {
        "title": "Electromechanical Systems - 1st Edition",
        "copyright_year": "2018",
        "last_update": "2024",
        "authors": [
            "Chad Davis, University of Oklahoma"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyODQsInB1ciI6ImJsb2JfaWQifX0=--61f8983d7624f2b73fc31836025d86200e907afe/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/es.jpg",
        "description": "This eBook was written as the third installment in the series that coincide with three engineering courses taught at the University of Oklahoma (ENGR 2431, ENGR 2531, and ENGR 3431). These courses were designed to provide non-major students – those not majoring in electrical or computer engineering (ECE) – a foundation in various ECE topics. ENGR 2431 is a prerequisite for both ENGR 2531 and ENGR 3431 and it is recommended that the DC Circuits book be studied prior to beginning the eBooks created for the other two courses. The following topics are covered in this book: LabVIEW Overview Module 1 – Number Systems and Character Encoding Module 2 – Digital Logic Module 3 – Measurement and Instrumentation Overview Module 4 – Sensors Module 5 – Power Systems Module 6 – Electric Machines Module 7 – Computer Communications Appendix A – Step by Step Guide to Digital, Analog, and Counter IOs in a DAQ",
        "publisher": "SHAREOK",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/electromechanical-systems"
    },
    {
        "title": "Manufacturing Processes 4-5",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "LamNgeun Virasak"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTgzLCJwdXIiOiJibG9iX2lkIn19--4d0cdd6b9539598920813a83a6b2b8da372ed13a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000ManufaProc.jpg",
        "description": "This textbook provides an introduction to the important area of manufacturing processes. This text will explain the hows, whys, and whens of various machining operations, set-ups, and procedures. Throughout this text, you will learn how machine tools operate, and when to use one particular machine instead of another. It is organized for students who plan to enter the manufacturing technology field and for those who wish to develop the skills, techniques, and knowledge essential for advancement in this occupational cluster. The organization and contents of this text focus primarily on theory and practice. The machining processes and technology sections in this textbook cover such machine tools as surface grinders, bandsaws, drill presses, milling machines, and the engine lathe. Additionally, the importance of Computer Numerical Control (CNC) in the operation of the most machine tools is explained, and its role in automated manufacturing is explored thoroughly.",
        "publisher": "Open Oregon Educational Resources",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/manufacturing-processes-4-5"
    },
    {
        "title": "Developing New Products and Services",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "G. Lawrence Sanders, State University of New York at Buffalo"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA4LCJwdXIiOiJibG9iX2lkIn19--7f5936c28b79237b3fb221b002632c57b13fdcd1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453343609.png",
        "description": "Developing New Products and Services by Sanders is an outstanding contribution to market research. The book focuses on the upfront activities and ideas for new product and service development.A central theme of Developing New Products and Services is that there is, or should be, a constant struggle going on in every organization, business, and system between delivering feature-rich versions of products and services using extravagant engineering and delivering low-cost versions of products and services using frugal engineering. Students will come away with this notion and how to manifest it as a contributing employee at any company.A number of powerful concepts and tools are presented so your students can better understand how to facilitate new product development. For example, three templates are featured that facilitate new product and service development. The FAD (features, attributes, and design) template is used to identify the features and attributes that can be used for product and service differentiation. The Ten–Ten planning process contains two templates: an Organizational and Industry Analysis template and the Business Plan Overview template. These two templates coupled with the FAD template can be used to develop a full-blown business plan.In addition, Developing New Products and Services includes the following topics: entrepreneurship, technology and product life cycles, product and service versioning, product line optimization, creativity, lock-in real options, business valuation, and project management.Evaluate Developing New Products and Services by Sanders for your marketing courses today.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343609",
        "source": "https://open.umn.edu/opentextbooks/textbooks/developing-new-products-and-services"
    },
    {
        "title": "Aerospace Structures",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Eric Raymond Johnson, Virginia Tech"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzQ4MSwicHVyIjoiYmxvYl9pZCJ9fQ==--69671703ec043aa0b28487ad10ec1c48dc4bbc0d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Cover-AerospaceStructures(FINAL).jpeg",
        "description": "Aerospace Structuresby Eric Raymond Johnson is a 600+ page text and reference book for junior, senior, and graduate-level aerospace engineering students. The text begins with a discussion of the aerodynamic and inertia loads acting on aircraft in symmetric flight and presents a linear theory for the status and dynamic response of thin-walled straight bars with closed and open cross-sections. Isotropic and fiber-reinforced polymer (FRP) composite materials including temperature effects are modeled with Hooke’s law. Methods of analyses are by differential equations, Castigliano’s theorems, the direct stiffness method, the finite element method, and Lagrange’s equations. There are numerous examples for the response axial bars, beams, coplanar trusses, coplanar frames, and coplanar curved bars. Failure initiation by the von Mises yield criterion, buckling, wing divergence, fracture, and by Puck’s criterion for FRP composites are presented in the examples.Professors, if you are considering or reviewing this book for adoption in your course,please let us know here.Problem sets:http://hdl.handle.net/10919/104169ePub and LaTeX source files: Expected late spring 2022",
        "publisher": "Virginia Tech Publishing",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/aerospace-structures"
    },
    {
        "title": "Dinámica poblacional de Spodoptera frugiperda, Diatraea saccharalis y Dalbulus maidis en el cultivo de maíz (Zea mays L.) durante la época seca en cinco localidades del cantón Mocache",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Tyron Jonathan Burgos-Macias, Universidad Técnica Estatal de Quevedo",
            "Ramiro Remigio Gaibor-Fernández, Universidad Técnica Estatal de Quevedo"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2NDgsInB1ciI6ImJsb2JfaWQifX0=--1a678b6efad7f61a2d4151b265e70cb720e8a1a1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_62_62_coverImage_es_ES.jpg",
        "description": "El manuscrito titulado ' Dinámica poblacional deSpodoptera frugiperda, Diatraea saccharalis y Dalbulus maidisen el cultivo de maíz (Zea mays L.) durante la época seca en cinco localidades del cantón Mocache' aborda un estudio en el cultivo de maíz, el cual es afectado por estas plagas, siendo un factor limitante en la producción. Se destacan las consecuencias del uso excesivo de insecticidas, tales como la resistencia de las plagas y la contaminación ambiental, y se propone el manejo integrado de plagas (MIP) como alternativa sostenible. El estudio incluye la utilización de trampas para el monitoreo y control de plagas, una herramienta clave para la toma de decisiones en el manejo del cultivo​​. La metodología empleada en la investigación comprende la localización de la investigación en cinco localidades, el uso de métodos descriptivos y correlacionales, y el análisis de variables como datos climáticos, porcentaje de infestación, número de especímenes capturados por trampa, presencia de insectos benéficos, y correlaciones entre estas variables​​.Los resultados obtenidos revelan la infestación deSpodoptera frugiperda, Diatraea saccharalis y Dalbulus maidisen las localidades estudiadas, la fluctuación poblacional de estas plagas y su relación con factores climáticos, y la eficiencia de las trampas de luz y trampas adhesivas para capturar adultos de estas especies. Además, se reporta la presencia de insectos benéficos en el área de estudio​​. En la discusión se analiza el impacto de estos hallazgos en el contexto del manejo de plagas en cultivos de maíz​​. Finalmente, las conclusiones y recomendaciones se centran en estrategias para mejorar el control de plagas y la sostenibilidad de la producción de maíz en las áreas afectadas por estas plagas​​.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651181",
        "source": "https://open.umn.edu/opentextbooks/textbooks/dinamica-poblacional-de-spodoptera-frugiperda-diatraea-saccharalis-y-dalbulus-maidis-en-el-cultivo-de-maiz-zea-mays-l-durante-la-epoca-seca-en-cinco-localidades-del-canton-mocache"
    },
    {
        "title": "Engineering Systems, Dynamics, Modelling, Simulation, and Design",
        "copyright_year": "2021",
        "last_update": "2024",
        "authors": [
            "Mehrzad Tabatabaian, British Columbia Institute of Technology"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMTQsInB1ciI6ImJsb2JfaWQifX0=--49b6df9fd4ac9ddbe4bcaf2d2529f2f722f0d21a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/small_cover_textbook_111_1bd4f0bb68.png",
        "description": "This open educational resource presents effective system modelling methods, including Lagrangian and bond graph, and the application of a relevant engineering software tool, 20-sim. The content is designed for engineering students and professionals in the field to support their understanding and application of these methods for modelling, simulation, and design of engineering systems. The text also includes videos showing selected worked-out examples.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/engineering-systems-dynamics-modelling-simulation-and-design"
    },
    {
        "title": "Pilot’s Handbook of Aeronautical Knowledge",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Federal Aviation Administration"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTI1OSwicHVyIjoiYmxvYl9pZCJ9fQ==--44d98fa7ec51c08ab48857bcd55ef711d4d3a800/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-06%20at%2010.25.05%20PM.png",
        "description": "ThePilot’s Handbook of Aeronautical Knowledge (PHAK)is an essential book for any Remote, Sport, Recreational, Private, Commercial, and Instructor Pilot. It provides basic knowledge that is vital for all pilots. This handbook introduces pilots to the broad spectrum of knowledge that will be needed as they progress in their pilot training. This handbook is useful to beginning pilots, as well as those pursuing more advanced pilot certificates.",
        "publisher": "Federal Aviation Administration",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/pilot-s-handbook-of-aeronautical-knowledge"
    },
    {
        "title": "An Animated Introduction to Digital Logic Design",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "John D. Carpinelli, New Jersey Institute of Technology"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTgxOCwicHVyIjoiYmxvYl9pZCJ9fQ==--ff72cb993068c116724b6ce13b46f78fcf6f48a0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-10-08%20at%201.44.54%20PM.png",
        "description": "This book is designed for use in an introductory course on digital logic design, typically offered in computer engineering, electrical engineering, computer science, and other related programs. Such a course is usually offered at the sophomore level. This book makes extensive use of animation to illustrate the flow of data within a digital system and to step through some of the procedures used to design and optimize digital circuits.",
        "publisher": "NJIT Library",
        "language": "English",
        "isbn13": "9781970194005",
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-animated-introduction-to-digital-logic-design"
    },
    {
        "title": "Interior Materiality",
        "copyright_year": "2021",
        "last_update": "2024",
        "authors": [
            "Kutay Guler, Kansas State University"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTExOTMsInB1ciI6ImJsb2JfaWQifX0=--b4de511074d960d3dc6dbe9210bd883294783270/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/interior.jpg",
        "description": "The knowledge of materials and finishes is the bridge that links conceptual design to real-world application. It is among the core content of virtually all interior architecture/design curricula, moreover, access to up-to-date information on emerging technologies and trends is a key exigency for the contemporary designer. Accordingly, this book is authored to form a comprehensive resource for the “hows” and “whys” surrounding the functional and aesthetic contributions of a wide selection of materials and finishes used in multiple spatial design contexts. The knowledge base presented here is not only useful in shaping spatial experience, ensuring occupant well-being, and employing sustainable thinking but also beneficial in managing budget and schedule while enabling the delivery of top-quality work.The book investigates fundamental material properties, performance criteria, as well as sector-specific standards, regulations, and guidelines, with a special focus on concerns surrounding occupant health and safety as well as environmental impact and sustainability concerns. Furthermore, fabrication, installation, and maintenance issues were explored in detail. Various information collection and organization conventions are also discussed with regard to detailing, specification, estimation, and documentation of materials and finishes.",
        "publisher": "New Prairie Press",
        "language": "English",
        "isbn13": "9781944548384",
        "source": "https://open.umn.edu/opentextbooks/textbooks/interior-materiality"
    },
    {
        "title": "Introduction to Engineering Thermodynamics",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Claire Yu Yan"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDAwNiwicHVyIjoiYmxvYl9pZCJ9fQ==--b3f14e3dccb2f3e8d4bd23ac278a74243378bb11/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-09-19%20at%208.22.30%20AM.png",
        "description": "The book is most suitable for a one-term, introductory engineering thermodynamics course at the undergraduate level. It may also be used for self-learning of fundamental concepts of classical thermodynamics.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-engineering-thermodynamics"
    },
    {
        "title": "Space Systems: Emerging Technologies and Operations",
        "copyright_year": "2022",
        "last_update": "2024",
        "authors": [
            "Randall K. Nichols, Kansas State University",
            "Hans C. Mumm, California University of Pennsylvania",
            "Wayne D. Lonstein, Pennsylvania State University",
            "Julie J.C.H Ryan, Wyndrose Technical Group",
            "Candice M. Carter, NASA"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzMDksInB1ciI6ImJsb2JfaWQifX0=--5103b965f70b3c56be7db70d129bef71ede7dd46/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Book7-Cover-1.jpg-900-x-1200-aspect-ratio-of-x75-Rev-4A-06232022-1-350x467.jpg",
        "description": "SPACE SYSTEMS: EMERGING TECHNOLOGIES AND OPERATIONS (SSETO) is our seventh textbook in a series covering the world of UASs / CUAS / UUVs. SSETO takes on a new purview of SPACE. UASs (Drones) have a maximum altitude of about 33,000 ft (10 km) because rotating rotors become physically limiting. (Nichols R. et al., 2019) Between 400 ft and 33,000 ft is in the purview of DREAMERS. In the DREAMERS region, Space has its most interesting technological emergence. We see emerging technologies and operations that may have profound effects on humanity. This is the mission our book addresses. We look at the Dreamer region from three perspectives: 1) a Military view where intelligence, jamming, spoofing, advanced materials, and hypersonics are in play; 2) the Operational Dreamer Region; which includes Space-based platform vulnerabilities, trash, disaster recovery management, A.I., manufacturing, and extended reality; and 3) the Humanitarian Use of Space technologies; which includes precision agriculture wildlife tracking, fire risk zone identification, and improving the global food supply and cattle management. State-of-the-Art research by a team of fifteen SMEs is incorporated into our book. We trust you will enjoy reading it as much as we have in its writing. There is hope for the future.",
        "publisher": "New Prairie Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/space-systems-emerging-technologies-and-operations"
    },
    {
        "title": "Construction Contracting: Business and Legal Principles, Second Edition - Second Edition",
        "copyright_year": "2002",
        "last_update": null,
        "authors": [
            "Stewart Bartholomew, California State University, Chico"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg2OSwicHVyIjoiYmxvYl9pZCJ9fQ==--2df7e348e56bcfc405ee4caf71a04699cf95afa2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover-ConstructionContracting(sm).jpg",
        "description": "This introduction to construction contracting as it applies to typical, every-day situations explains “theoretical” ideas in terms of what really happens in practice. It emphasizes the more common case law holdings and industry customs that help avoid troublesome legal issues during the completion of a project.Instructors reviewing or adopting this book are encouraged to register athttps://bit.ly/interest_construction_contractingAny derivatives of this work must comply with the use and attribution requirements of the Creative Commons license, and include the following statement, “This material was previously published by Pearson Education, Inc.”Construction Contracting, 2nd edition is an 'out of print,' rights-reverted book for which the author's estate has given permission for digitization and release under a CC BY NC SA 4.0 license. It was previously published in 2002 by Pearson ISBN 1-13-091055-4. The copyright page has been edited and graphics redrawn. A new cover, dedication, acknowledgements, how to adopt this book, and author biography have been added, and the table of contents has been revised. As the book has been reformatted, the original back of the book index is not included.",
        "publisher": null,
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/construction-contracting-business-and-legal-principles-second-edition"
    },
    {
        "title": "DC Circuits",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Chad Davis, University of Oklahoma"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU5LCJwdXIiOiJibG9iX2lkIn19--8e39004c73f0bc5b0bf25fc37e409dffdc907822/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000DCCircuit.png",
        "description": "This book covers Direct Current (DC) circuit theory and is broken up into three modules. Module 1 covers the basics for circuits that include DC sources (voltage or current) and resistors. Even though Module 1 is not very difficult, it forms the foundation for more complicated topics in modules 2 and 3 so it is important to have a firm grasp of all Module 1 topics before moving on. Module 2 covers more difficult problem solving techniques for circuits that include only DC sources and resistors. Module 3 introduces capacitors and inductors. These non-linear reactive components are analyzed in the transient and steady state regions in circuits with DC sources in Module 3. Also annexed is a two-page cheat sheet that ENGR 2431 students at University of Oklahoma can use for exams.",
        "publisher": "University of Oklahoma Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/dc-circuits"
    },
    {
        "title": "Cyber-Human Systems, Space Technologies, and Threats",
        "copyright_year": "2023",
        "last_update": "2024",
        "authors": [
            "Randall K. Nichols, Kansas State University",
            "Hans C. Mumm, California University of Pennsylvania",
            "Wayne D. Lonstein, Pennsylvania State University",
            "Julie J.C.H Ryan, Wyndrose Technical Group",
            "Candice M. Carter, NASA"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzMTIsInB1ciI6ImJsb2JfaWQifX0=--152e94dc971a7dc0d1458003ee5c08ab708fd6e7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Book_8_Cover_JIC-18-authors-07252023-350x438.jpg",
        "description": "CYBER-HUMAN SYSTEMS, SPACE TECHNOLOGIES, AND THREATS is our eighth textbook in a series covering the world of UASs / CUAS / UUVs / SPACE. We address the technological future of the merging of cyber-human systems (robots, cyborgs, AI/ML, computers) with humans and apply these innovations to space operations and defense against threats that are concomitant with their development. We look at artificial brains, legality of CHS sensors, AI /ML and Ag and food industry; Neurostrike and CHATGPT, biological threats and growth in space, space EW, modeling, deep space warfare, logistics and dominance; hypersonic missiles, cyber threats in space, machine parts, materials technologies, and economies of scale, quantum technologies impact and finally, innovative wireless power transfer for space applications. State-of-the-Art research by a team of eighteen SMEs is incorporated into our book. We trust you will enjoy reading it as much as we have in its writing. There is hope for the future. There is also caution needed.",
        "publisher": "New Prairie Press",
        "language": "English",
        "isbn13": "9781944548544",
        "source": "https://open.umn.edu/opentextbooks/textbooks/cyber-human-systems-space-technologies-and-threats"
    },
    {
        "title": "Chemical Process Dynamics and Controls",
        "copyright_year": "2009",
        "last_update": null,
        "authors": [
            "Peter J. Woolf"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTQxLCJwdXIiOiJibG9iX2lkIn19--7f872771051811c11cd9b64b05fd98124f2bc730/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/0000CheProDyn.PNG",
        "description": "Process controls is a mixture between the statistics and engineering discipline that deals with the mechanism, architectures, and algorithms for controlling a process. Some examples of controlled processes are:•Controlling the temperature of a water stream by controlling the amount of steam added to the shell of a heat exchanger.•Operating a jacketed reactor isothermally by controlling the mixture of cold water and steam that flows through the jacket of a jacketed reactor.•Maintaining a set ratio of reactants to be added to a reactor by controlling their flow rates.•Controlling the height of fluid in a tank to ensure that it does not overflow.",
        "publisher": "openmichigan",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/chemical-process-dynamics-and-controls"
    },
    {
        "title": "Operational Amplifiers & Linear Integrated Circuits: Theory and Application - 3e",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "James Fiore, Mohawk Valley Community College"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDk3LCJwdXIiOiJibG9iX2lkIn19--64f1f26c9a9e45282220148751f099c1d6eba646/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000OpeAmpLIC.png",
        "description": "The goal of this text, as its name implies, is to allow the reader to become proficient in the analysis and design of circuits utilizing modern linear ICs. It progresses from the fundamental circuit building blocks through to analog/digital conversion systems. The text is intended for use in a second year Operational Amplifiers course at the Associate level, or for a junior level course at the Baccalaureate level. In order to make effective use of this text, students should have already taken a course in basic discrete transistor circuits, and have a solid background in algebra and trigonometry, along with exposure to phasors. Calculus is used in certain sections of the text, but for the most part, its use is kept to a minimum. For students without a calculus background, these sections may be skipped without a loss of continuity. (The sole exception to this being Chapter Ten, Integrators and Differentiators, which hinges upon knowledge of calculus.)There is also alab manualfor this textbook.",
        "publisher": "dissidents",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/operational-amplifiers-linear-integrated-circuits-theory-and-application-3e"
    },
    {
        "title": "Microwave and RF Design: Radio Systems",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Michael Steer, NC State"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzA1LCJwdXIiOiJibG9iX2lkIn19--20e711f9c260681c585f15cf8bcaffa8aa250c33/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/978-1-4696-5691-5.png",
        "description": "Microwave and RF Design: Radio Systemsis a circuits- and systems-oriented approach to modern microwave and RF systems. Sufficient details at the circuits and sub-system levels are provided to understand how modern radios are implemented. Design is emphasized throughout. The evolution of radio from what is now known as 0G, for early radio, through to 6G, for sixth generation cellular radio, is used to present modern microwave and RF  engineering concepts. Two key themes unify the text: 1) how system-level decisions affect component, circuit and subsystem design; and 2) how the capabilities of technologies, components, and subsystems impact system design. This book is suitable as both an undergraduate and graduate textbook, as well as a career-long reference book.",
        "publisher": "North Carolina State University Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/microwave-and-rf-design-radio-systems"
    },
    {
        "title": "A First Course in Electrical and Computer Engineering",
        "copyright_year": "2009",
        "last_update": null,
        "authors": [
            "Louis Scharf, Colorado State University"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "This book was written for an experimental freshman course at the University of Colorado. The course is now an elective that the majority of our electrical and computer engineering students take in the second semester of their freshman year, just before their first circuits course. Our department decided to offer this course for several reasons:we wanted to pique student' interest in engineering by acquainting them with engineering teachers early in their university careers and by providing with exposure to the types of problems that electrical and computer engineers are asked to solve;we wanted students entering the electrical and computer engineering programs to be prepared in complex analysis, phasors, and linear algebra, topics that are of fundamental importance in our discipline;we wanted students to have an introduction to a software application tool, such as MATLAB, to complete their preparation for practical and efficient computing in their subsequent courses and in their professional careers;we wanted students to make early contact with advanced topics like vector graphics, filtering, and binary coding so that they would gain a more rounded picture of modern electrical and computer engineering.In order to introduce this course, we had to sacrifice a second semester of Pascal programming. We concluded that the sacrifice was worth making because we found that most of our students were prepared for high-level language computing after just one semester of programming.We believe engineering educators elsewhere are reaching similar conclusions about their own students and curriculums. We hope this book helps create a much needed dialogue about curriculum revision and that it leads to the development of similar introductory courses that encourage students to enter and practice our craft.Students electing to take this course have completed one semester of calculus, computer programming, chemistry, and humanities.Concurrently with this course, students take physics and a second semester of calculus, as well as a second semester in the humanities. By omitting the advanced topics marked by asterisks, we are able to cover Complex Numbers through Linear Algebra, plus two of the three remaining chapters. The book is organized so that the instructor can select any two of the three. If every chapter of this book is covered, including the advanced topics, then enough material exists for a two-semester course.The first three chapters of this book provide a fairly complete coverage of complex numbers, the functions e^x and e^j\u0002and phasors. Our department philosophy is that these topics must be understood if a student is to succeed in electrical and computer engineering. These three chapters may also be used as a supplement to a circuits course. A measured pace of presentation, taking between sixteen and eighteen lectures, is sufficient to cover all but the advanced sections in Complex Numbers through Phasors.The chapter on 'linear algebra' is prerequisite for all subsequent chapters. We use eight to ten lectures to cover it. We devote twelve to sixteen lectures to cover topics from Vector Graphics through Binary Codes. (We assume a semester consisting of 42 lectures and three exams.) The chapter on vector graphics applies the linear algebra learned in the previous chapter to the problem of translating, scaling, and rotating images. 'Filtering' introduces the student to basic ideas in averaging and filtering. The chapter on 'Binary Codes' covers the rudiments of binary coding, including Huffman codes and Hamming codes.If the users of this book find 'Vector Graphics' through 'Binary Codes' too confining, we encourage them to supplement the essential material in 'Complex Numbers' through 'Linear Algebra' with their own course notes on additional topics. Within electrical and computer engineering there are endless possibilities. Practically any set of topics that can be taught with conviction and enthusiasm will whet the student's appetite. We encourage you to write to us or to our editor, Tom Robbins, about your ideas for additional topics. We would like to think that our book and its subsequent editions will have an open architecture that enables us to accommodate a wide range of student and faculty interests.Throughout this book we have used MATLAB programs to illustrate key ideas. MATLAB is an interactive, matrix-oriented language that is ideally suited to circuit analysis, linear systems, control theory, communications, linear algebra, and numerical analysis. MATLAB is rapidly becoming a standard software tool in universities and engineering companies. (For more information about MATLAB, return the attached card in the back of this book to The MathWorks, Inc.) MATLAB programs are designed to develop the student's ability to solve meaningful problems, compute, and plot in a high-level applications language. Our students get started in MATLAB by working through “An Introduction to MATLAB,” while seated at an IBM PC (or look-alike) or an Apple Macintosh. We also have them run through the demonstration programs in 'Complex Numbers'. Each week we give three classroom lectures and conduct a one-hour computer lab session. Students use this lab session to hone MATLAB skills, to write programs, or to conduct the numerical experiments that are given at the end of each chapter. We require that these experiments be carried out and then reported in a short lab report that contains (i) introduction, (ii) analytical computations, (iii) computer code, (iv) experimental results, and (v) conclusions. The quality of the numerical results and the computer graphics astonishes students. Solutions to the chapter problems are available from the publisher for instructors who adopt this text for classroom use.We wish to acknowledge our late colleague Richard Roberts, who encouraged us to publish this book, and Michael Lightner and Ruth Ravenel, who taught 'Linear Algebra' and 'Vector Graphics' and offered helpful suggestions on the manuscript. We thank C. T. Mullis for allowing us to use his notes on binary codes to guide our writing of 'Binary Codes'. We thank Cédric Demeure and Peter Massey for their contributions to the writing of 'An Introduction to MATLAB' and 'The Edix Editor'. We thank Tom Robbins, our editor at Addison-Wesley, for his encouragement, patience, and many suggestions. We are especially grateful to Julie Fredlund, who composed this text through many drafts and improved it in many ways. We thank her for preparing an excellent manuscript for production.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-first-course-in-electrical-and-computer-engineering"
    },
    {
        "title": "Introduction to Probability",
        "copyright_year": "1997",
        "last_update": null,
        "authors": [
            "Charles M. Grinstead, Swarthmore College",
            "J. Laurie Snell, Dartmouth College"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTYsInB1ciI6ImJsb2JfaWQifX0=--f9ce94f1af6a792bc9a632d6315283a746607658/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntroPro.png",
        "description": "Probability theory began in seventeenth century France when the two great French mathematicians, Blaise Pascal and Pierre de Fermat, corresponded over two problems from games of chance. Problems like those Pascal and Fermat solved continuedto influence such early researchers as Huygens, Bernoulli, and DeMoivre in establishing a mathematical theory of probability. Today, probability theory is a wellestablished branch of mathematics that finds applications in every area of scholarlyactivity from music to physics, and in daily experience from weather prediction topredicting the risks of new medical treatments.This text is designed for an introductory probability course taken by sophomores,juniors, and seniors in mathematics, the physical and social sciences, engineering,and computer science. It presents a thorough treatment of probability ideas andtechniques necessary for a form understanding of the subject. The text can be usedin a variety of course lengths, levels, and areas of emphasis.For use in a standard one-term course, in which both discrete and continuousprobability is covered, students should have taken as a prerequisite two terms ofcalculus, including an introduction to multiple integrals. In order to cover Chapter 11, which contains material on Markov chains, some knowledge of matrix theoryis necessary.The text can also be used in a discrete probability course. The material has beenorganized in such a way that the discrete and continuous probability discussions arepresented in a separate, but parallel, manner. This organization dispels an overlyrigorous or formal view of probability and o?ers some strong pedagogical valuein that the discrete discussions can sometimes serve to motivate the more abstractcontinuous probability discussions. For use in a discrete probability course, studentsshould have taken one term of calculus as a prerequisite.Very little computing background is assumed or necessary in order to obtain fullbenefits from the use of the computing material and examples in the text. All ofthe programs that are used in the text have been written in each of the languagesTrueBASIC, Maple, and Mathematica.",
        "publisher": "American Mathematical Society",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-probability"
    },
    {
        "title": "Microwave and RF Design: Modules",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Michael Steer, NC State"
        ],
        "subjects": [
            "Engineering",
            "Electrical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzA4LCJwdXIiOiJibG9iX2lkIn19--23efa0e7ed79763a7a4efe3b886de3be3ebb1b96/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/978-1-4696-5697-7.jpg",
        "description": "Microwave and RF Design: Modulesfocuses on the design of systems based on microwave modules. The use of modules has become increasingly important in RF and microwave engineering for rapidly realizing high performance microwave systems. When integration is ultimately to be used, building a system up using modules provides a rapid means of prototyping and testing system concepts. A wide variety of RF modules including amplifiers, local oscillators, switches, circulators, isolators, phase detectors, frequency multipliers and dividers, phase-locked loops, and direct digital synthesizers are considered. Detailed design strategies for synthesizing filters based on parallel coupled lines are presented. The reader will gain an appreciation of design by synthesis. This book is suitable as both an undergraduate and graduate textbook, as well as a career-long reference book.",
        "publisher": "North Carolina State University Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/microwave-and-rf-design-modules"
    },
    {
        "title": "Fracture Mechanics: An Engineering Primer - 2nd Edition",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Michael Janssen, Delft University of Technology",
            "Jan Zuidema, Delft University of Technology",
            "Russell Wanhill, National Aerospace Laboratory (NLR)"
        ],
        "subjects": [
            "Engineering",
            "Civil Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMzgsInB1ciI6ImJsb2JfaWQifX0=--09bfd269202bc658189708ed893c5d77ced54372/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_86_103_coverImage_en_US_t.png",
        "description": "In this second edition, which is the result of numerous revisions, updates and additions, the authors cover the basic concepts of fracture mechanics for both the linear elastic and elastic-plastic regimes. The fracture mechanics parametersK,G,Jand CTOD are treated in a basic manner along with the test methods to determine critical values. The development of failure assessment based on elastic-plastic fracture mechanics is reflected in a comprehensive treatment.Three chapters are devoted to the fracture mechanics characterisation of crack growth. Fatigue crack growth is extensively treated and attention is paid to the important topic of the initiation and growth of short fatigue cracks. Furthermore, sustained load fracture and dynamic crack growth are discussed, including various test techniques,e.g.the determination of the crack arrest toughness.Finally, there are two chapters dealing with mechanisms of fracture and the ways in which actual material behaviour influences the fracture mechanics characterisation of crack growth.This textbook is intended primarily for engineering students. It will be useful to practising engineers as well, since it provides the background to several test and design methods and to criteria for material selection.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463668187",
        "source": "https://open.umn.edu/opentextbooks/textbooks/fracture-mechanics-an-engineering-primer"
    },
    {
        "title": "Measurement and Instrumentation: An Introduction to Concepts and Methods - 1st Edition",
        "copyright_year": "2020",
        "last_update": "2024",
        "authors": [
            "John Dyer, University of Oklahoma",
            "Chad Davis, University of Oklahoma"
        ],
        "subjects": [
            "Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyODcsInB1ciI6ImJsb2JfaWQifX0=--352817bdfd07079cab6425573407af99f5b7a1c5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/mai.jpg",
        "description": "Measurement and instrumentation are fundamental elements of many engineering projects. From research, to development, to manufacturing, to user products, engineers are constantly needing to measure things: brightness of a light, dimensions of an object, separation between things, frequency content, stress, strain, pressure, voltage, etc. In the real world measuring systems are not perfect, so the results of a measurement are only an estimate of the true value. Instrumentation for making measurements relies on some fundamental assumptions to ensure the veracity of the measurements. Some key elements are: bandwidth, sampling rate, dynamic range, sensor type, etc. This text discusses the basic concepts of what a measurement is, how the instrumentation chosen (or developed) can affect the measurement, and how to deal with the measurement error that is in all instrumentation systems. Topics include data acquisition, signal conditioning, sensor types, and measurement noise and its various noise distributions. The text concludes with three user projects that bring together these topics into an informative work that reinforces the theory.",
        "publisher": "SHAREOK",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/measurement-and-instrumentation-an-introduction-to-concepts-and-methods"
    },
    {
        "title": "A Guide to MATLAB for ME 160",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Austin Bray",
            "Reza Montazami"
        ],
        "subjects": [
            "Engineering",
            "Mechanical Engineering"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzgyNSwicHVyIjoiYmxvYl9pZCJ9fQ==--f1eae66dda21410a9dea8448f768280b6c1117e4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Bray-MATLAB-cover-350x453.png",
        "description": "This textbook provides an introduction to the MATLAB programming language for first-year mechanical engineering students enrolled in ME 160, Mechanical Engineering Problem Solving with Computer Applications. Designed to follow the content taught in class, this book provides a supplement to in-class learning that is presented at a level that is understandable to a student with no experience coding before coming to Iowa State University.",
        "publisher": null,
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-guide-to-matlab-for-me-160"
    }
]