[
    {
        "title": "Small Business Management in the 21st Century",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "David Cadden, Quinnipiac University",
            "Sandra L. Lueder, Southern Connecticut State University"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyLCJwdXIiOiJibG9iX2lkIn19--47124a5a92b6d48428f0a1f30a991949bbad0673/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453345566.png",
        "description": "Small Business Management in the 21st Century offers a unique perspective and set of capabilities for instructors. The authors designed this book with a “less can be more” approach, and by treating small business management as a practical human activity rather than as an abstract theoretical concept.The text has a format and structure that will be familiar to you if you use other books on small business management. Yet it brings a fresh perspective by incorporating three distinctive and unique themes and an important new feature (Disaster Watch) which is embedded throughout the entire text. These themes assure that students see the material in an integrated context rather than a stream of separate and distinct topics.First, the authors incorporate the use of technology and e-business as a way to gain competitive advantage over larger rivals. Technology is omnipresent in today's business world. Small business must use it to its advantage. We provide practical discussions and examples of how a small business can use these technologies without having extensive expertise or expenditures.Second, they explicitly acknowledge the constant need to examine how decisions affect cash flow by incorporating cash flow impact content in several chapters. As the life blood of all organizations, cash flow implications must be a factor in all business decision-making.Third, they recognize the need to clearly identify sources of customer value and bring that understanding to every decision. Decisions that do not add to customer value should be seriously reconsidered.Small Business Management in 21st Century boasts a new feature called Disaster Watch scenarios. Few texts cover, in any detail, some of the major hazards that small business managers face. Disaster Watch scenarios, included in most chapters, cover topics that include financing, bankers, creditors, employees, customers who don't pay, economic downturns, and marketing mistakes.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453345566",
        "source": "https://open.umn.edu/opentextbooks/textbooks/small-business-management-in-the-21st-century"
    },
    {
        "title": "Human Relations",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Laura Portolese Dias, Central Washington University"
        ],
        "subjects": [
            "Business",
            "Human Resources"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE1LCJwdXIiOiJibG9iX2lkIn19--ed66c0391dcbfdd87812d32cec8856ad48cfccc2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453349755.png",
        "description": "Human Relationsby Laura Portolese-Dias addresses all of the critical topics to obtain career success as they relate to professional relationships.Knowing how to get along with others, resolve workplace conflict, manage relationships, communicate well, and make good decisions are all critical skills all students need to succeed in career and in life.Human Relations is not an organizational behavior; rather, it provides a good baseline of issues students will deal with in their careers on a day-to-day basis. It is also not a professional communications, business English, or professionalism textbook, as its focus is much broader — on general career success and how to effectively maneuver in the workplace.From communication challenges to focusing on one's own emotional intelligence, the examples throughout Human Relations will help students understand the importance of the human side in their career.This book's easy-to-understand language and tone is written to convey practical information in an engaging way. Every chapter opens with a realistic example which introduces a concept to be explained in detail later. Each chapter contains relevant examples, YouTube videos, figures, learning objectives, key takeaways, exercises, and a chapter-ending case that offer different ways to promote learning. Many of the end-of-section exercises offer self-assessment quizzes, so students may engage in self-understanding and development.",
        "publisher": "LibreTexts",
        "language": "English",
        "isbn13": "9781453349755",
        "source": "https://open.umn.edu/opentextbooks/textbooks/human-relations"
    },
    {
        "title": "Good Corporation, Bad Corporation: Corporate Social Responsibility in the Global Economy",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Guillermo C. Jimenez",
            "Elizabeth Pulos"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE1LCJwdXIiOiJibG9iX2lkIn19--6cf7dcf9a019380cf7da8b293136e78c761c27a3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781942341253.png",
        "description": "This textbook provides an innovative, internationally oriented approach to the teaching of corporate social responsibility (CSR) and business ethics. Drawing on case studies involving companies and countries around the world, the textbook explores the social, ethical, and business dynamics underlying CSR in such areas as global warming, genetically modified organisms (GMO) in food production, free trade and fair trade, anti-sweatshop and living-wage movements, organic foods and textiles, ethical marketing practices and codes, corporate speech and lobbying, and social enterprise. The book is designed to encourage students and instructors to challenge their own assumptions and prejudices by stimulating a class debate based on each case study.",
        "publisher": "Open SUNY",
        "language": "English",
        "isbn13": "9781942341253",
        "source": "https://open.umn.edu/opentextbooks/textbooks/good-corporation-bad-corporation-corporate-social-responsibility-in-the-global-economy"
    },
    {
        "title": "Law for Entrepreneurs",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George J. Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School"
        ],
        "subjects": [
            "Business"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "Law for Entrepreneursis an up-to-date textbook that covers the broad spectrum of legal issues that entrepreneurs must understand when starting and running a business. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Law for Entrepreneursprovides students with context and essential legal concepts relating to contracts, product liability, intellectual property, insurance, agency law, partnerships, corporations, and employment law. The text provides the vocabulary and legal savvy that entrepreneurs need to talk in an educated way to customers, suppliers, employees, creditors, shareholders, government regulators and other stakeholders — and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453344170",
        "source": "https://open.umn.edu/opentextbooks/textbooks/law-for-entrepreneurs"
    },
    {
        "title": "Business Writing Style Guide",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "John Morris, Oregon State University",
            "Julie Zwart, Oregon State University"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjAxNCwicHVyIjoiYmxvYl9pZCJ9fQ==--d260171ff5a656f589bfb6234ce47776c5618728/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Title-Page-Business-Writing-Style-Guide-350x453.png",
        "description": "It is the goal of this book to help students do the following:• Apply basic concepts for effective and concise business writing.• Compile a well written report acceptable within a business context.• Follow a writing process designed for business students.• Demonstrate critical thinking, reasoning, and persuasion.• Communicate in writing using a business model.• Apply resources for improving business writing skills.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-writing-style-guide"
    },
    {
        "title": "Visuals for influence: in project management and beyond",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Bronte van der Hoorn, University of Southern Queensland"
        ],
        "subjects": [
            "Business",
            "Management",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk3OSwicHVyIjoiYmxvYl9pZCJ9fQ==--e92bfe6573604d033acaccafc3b201d9bfe1c40a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/T360017-Front-Cover-Book-Design-FINAL-v5-683x1024.jpg",
        "description": "‘Visuals for influence: in project management and beyond’ is a practical guide with 24 visuals to download, adapt and deploy to engage your stakeholders. This practical guide will build your confidence and practical skills to quickly and effectively leverage the benefits of visuals to maximise your influence.",
        "publisher": "University of Southern Queensland",
        "language": "English",
        "isbn13": "9780648769866",
        "source": "https://open.umn.edu/opentextbooks/textbooks/visuals-for-influence-in-project-management-and-beyond"
    },
    {
        "title": "The Sustainable Business Case Book",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Ross Gittell, University of New Hampshire",
            "Matt Magnusson, University of New Hampshire",
            "Michael Merenda, Whittemore School of Business"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI0LCJwdXIiOiJibG9iX2lkIn19--19665e9a773c9bdb44ee8bd51a706a004ad67abd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453346778.png",
        "description": "The issue of sustainability and specifically sustainable business is of increasing interest and importance to students of business and also students in the sciences, government, public policy, planning and other fields. There can be significant benefits from students learning about sustainable business from the rich experiences of business practice.The Sustainable Business Case Book by Gittell, Magnusson and Merenda is one of the first of its kind. It combines the the theory of sustainability with key concepts, analytical information and contextual information with a collection of cases which provide insights, perspective and practical guidance on how sustainable businesses operate from different business functional area perspectives.The Sustainable Business Case Book can be used as a stand-alone text or as a supplemental textbook for undergraduate courses that have an interest in sustainable business. While the book's primary focus is on the relationship between business and sustainability, the book can also be used in courses offered in fields other than business, including environmental and earth systems sciences, environmental studies, urban planning, economics and public policy.The first part of The Sustainable Business Case Book, Chapter 1 through Chapter 3, introduces students to the meaning of sustainability, and the practice of sustainable business. The introductory chapters also describe key concepts, analytical frameworks, and contextual information relevant for the understanding of business sustainability. Chapter 1, defines sustainability and describes how and why businesses choose to engage in sustainable practices and how sustainable business practices relate to corporate profitability and social responsibility. Chapters 2 and 3 provide important background and contextual information affecting sustainable business practice. Chapter 2, The Science of Sustainability, reviews scientific evidence about climate change and the human and business influences on climate change. Chapter 3, Sustainability, Public Policy and Business, describes the significant role of government and public policy in sustainability, including setting the rules, regulations and laws that define the market and market opportunities for sustainable business practice.After presenting a framework for understanding business engagement in sustainability and helping your students develop a core background of information on sustainable business seven case studies across the business disciplines illustrating business sustainability practices are presented. At the beginning of each case study chapter Learning Objectives are listed with major sustainable business points and principles that the case will illustrate and illuminate. Each case chapter includes listing of Key Takeaways, Key Terms and Exercises for students. In each case chapter, there are four main areas of focus:Context and motivating interest in sustainability for company;Description of the sustainable business practice and how it was implemented;Results in terms of changes in sales/revenues, costs, profits and competitive positioning from the sustainable business practice;Challenges and opportunities, and future considerations as a result of the company implementing the sustainable business practice.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453346778",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-sustainable-business-case-book"
    },
    {
        "title": "Introduction to Business",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Lawrence J. Gitman",
            "Carl McDaniel",
            "Amit Shah",
            "Monique Reece",
            "Linda Koffel",
            "Bethann Talsma",
            "James C. Hyatt"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTQ0LCJwdXIiOiJibG9iX2lkIn19--987d0341b6271f2ac42ebf15b4afc04b83d817d8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/9781947172555.PNG",
        "description": "Introduction to Business covers the scope and sequence of most introductory business courses. The book provides detailed explanations in the context of core themes such as customer satisfaction, ethics, entrepreneurship, global business, and managing change. Introduction to Business includes hundreds of current business examples from a range of industries and geographic locations, which feature a variety of individuals. The outcome is a balanced approach to the theory and application of business concepts, with attention to the knowledge and skills necessary for student success in this course and beyond.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781947172555",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-business"
    },
    {
        "title": "Beginning Excel 2019",
        "copyright_year": "2017",
        "last_update": "2019",
        "authors": [
            "Noreen Brown",
            "Barbara Lave",
            "Julie Romey"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQzMywicHVyIjoiYmxvYl9pZCJ9fQ==--7a19631d9b0a6d605bbfee39abdb226f2e79c4e0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover-Option-3-350x453.jpg",
        "description": "This textbook was written for a community college introductory course in spreadsheets utilizing Microsoft Excel. While the figures shown utilize Excel 2019, the textbook was written to be applicable to other versions of Excel as well. The book introduces new users to the basics of spreadsheets and is appropriate for students in any major who have not used Excel before. This textbook includes instructions for Excel for Mac also.",
        "publisher": "Open Oregon Educational Resources",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/beginning-excel"
    },
    {
        "title": "Entorno Empresarial y Gestión del Marketing: Perspectiva Teórica para el Desarrollo de Proyectos de Titulación",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "César Andrés Guerrero-Velástegui, Universidad Técnica de Ambato",
            "Liliana Elizabeth González-Garcés, Universidad Técnica de Ambato"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxMzQsInB1ciI6ImJsb2JfaWQifX0=--fbe277c072871110e5e08b7a94a5c4893ee6a7e5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_44_44_coverImage_es_ES.jpg",
        "description": "El entorno empresarial, la gestión del marketing y la forma de administrar empresas cambia de manera constante conforme el ambiente en el que se desenvuelve, razón por la cual es fundamental identificar una ruta de investigación que delinee el camino a seguir. Por esta razón es fundamental iniciar estos procesos desde la academia, pues un proyecto de grado es un aspecto crucial del desarrollo académico de los estudiantes que cursan estudios de pregrado o posgrado. Es una oportunidad para que los estudiantes demuestren su dominio de un tema en particular y muestren sus habilidades de investigación. En esta obra, discutiremos el propósito de un proyecto de grado, los pasos necesarios para desarrollar un proyecto exitoso y los desafíos comunes que enfrentan los estudiantes durante el proceso. Hay diferentes tipos de proyectos de grado, incluidos tesis, disertaciones, artículos académicos  y proyectos finales; cuyos resultados y entregables esperados incluyen un informe escrito, una presentación oral y una defensa del proyecto, la finalidad es brindar acompañamiento en el proceso mediante la inclusión de elementos técnicos, dinámicos y rigurosos que permitan la generación de conocimiento emergente en el ámbito empresarial, incluyendo elementos reflexivos y prácticos que permitan aportar con rigurosidad académica y científica el desarrollo de trabajos de titulación y reformular la forma de trabajar y replicarlo en el ámbito laboral.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651044",
        "source": "https://open.umn.edu/opentextbooks/textbooks/entorno-empresarial-y-gestion-del-marketing-perspectiva-teorica-para-el-desarrollo-de-proyectos-de-titulacion"
    },
    {
        "title": "Business Calculus with Excel",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Mike May, Saint Louis University"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMzUsInB1ciI6ImJsb2JfaWQifX0=--84274e3eac03a3fc6b37c07b2279e23c8588b9be/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/buscalc.jpg",
        "description": "This text is intended for a one semester calculus course for business students with the equivalent of a college algebra prerequisite. Rather than being a three-semester engineering calculus course that has been watered down to fit into one semester it is designed for the business students.",
        "publisher": "Mike May, S.J. and Anneke Bart",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-calculus-with-excel"
    },
    {
        "title": "Growth and Competitive Strategy in 3 Circles",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Joe E. Urbany, University of Notre Dame",
            "James H. Davis"
        ],
        "subjects": [
            "Business",
            "Management",
            "Marketing"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "The 3-Circle model was developed over the past several years, initially in strategic planning for a university graduate program and in an executive MBA course designed to integrate the concepts of marketing and competitive strategy. Over the course of time, the 3-Circle model has been successfully used by hundreds of organizations throughout the world in establishing and growing their market positions. Many of the case examples in this book demonstrating applications of the 3-Circle model applications are from executives who have attended executive education training at the University of Notre Dame.The development of competitive strategy is difficult because there are a lot of moving parts, as well as hundreds of frameworks, that might potentially guide the effort. Executives appreciate how the 3-Circle model simplifies the integration of customer, firm, and competitor analysis to generate growth strategies. It also provides a common language and process for understanding and explaining competitive advantage and for identifying profitable growth strategy.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343623",
        "source": "https://open.umn.edu/opentextbooks/textbooks/growth-and-competitive-strategy-in-3-circles"
    },
    {
        "title": "Policy Analysis of Multi-Actor System - Second Edition",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Ben Enserink, Delft, Netherlands",
            "Pieter Bots, Delft, Netherlands",
            "Els van Daalen, Delft, Netherlands"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk3OSwicHVyIjoiYmxvYl9pZCJ9fQ==--ebae0476f81b6e4290d30e922317c4f2ef48eea5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_50_67_coverImage_en_US_t.png",
        "description": "Policy of Multi-Actor Systems is an introduction into the art of craft of problem exploration and problem structuring. It positions policy analysis as a scientific discipline focused on systems analysis in a multi-actor context to support better informed decision-making. The approach presented in this book is considered to be the cornerstone of the curricula of the Faculty of Technology, Policy and Management of Delft University of Technology and underlies the research on (the governance of) socio-technical systems. Systems thinking applied in a multi-actor environment and its inherent multi-disciplinary character is what makes this work stand out from traditional hard- and soft systems approaches. The core of the book is dedicated to systems analysis, actor- or stakeholder-analysis and discusses methods for dealing with uncertainty. These analytical activities combined lead to a rich problem description and to plans for further research. Due to the stepwise approach this book serves as a basis for any problem analysis both for our bachelor and master students, our alumni worldwide and any interested practitioners.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789462362994",
        "source": "https://open.umn.edu/opentextbooks/textbooks/policy-analysis-of-multi-actor-system"
    },
    {
        "title": "Project Management: Navigating the Complexity with a Systematic Approach",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Abdullah Oguz, New Britain, CT"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDIwNCwicHVyIjoiYmxvYl9pZCJ9fQ==--ebe03123410f518743e4bc84dc506b6baa3e8e1f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/AbdullahOguzCover4Pressbooks-683x1024.jpeg",
        "description": "The world has become more complicated with the introduction and development of new technologies and methods, and novel risks such as Covid-19 pandemic. Competition has been tougher than it used to be. Organizations strive to keep up with the changes in the internal and external environment. In the light of unprecedented changes, project managers must be prepared in response to the demands from their organizations and key stakeholders like clients, customers and government agencies. This book covers the fundamentals of project management, and aims to guide undergraduate and graduate students to acquire the building blocks of project management. This book also includes Microsoft Project tutorials for project scope, schedule, resources, and cost, and monitoring and controlling.",
        "publisher": "MSL Academic Endeavors",
        "language": "English",
        "isbn13": "9781936323999",
        "source": "https://open.umn.edu/opentextbooks/textbooks/project-management-navigating-the-complexity-with-a-systematic-approach"
    },
    {
        "title": "Sports Marketing: An Australian Perspective",
        "copyright_year": "2023",
        "last_update": "2024",
        "authors": [
            "Jessica Richards, Western Sydney University"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMjMsInB1ciI6ImJsb2JfaWQifX0=--8f631aae944c5e405e7d66fccb3db9c2465d9486/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover6-350x524.jpg",
        "description": "Sports marketing refers to promoting goods and services through sporting events and the endorsement of athletes and sports teams. For any sports organisation, it is imperative to have an effective sports marketing strategy in place to build brand awareness, enhance customer loyalty and generate revenue. Companies in sports use marketing strategies to fulfil their goals, such as attracting more junior players, involving parents, increasing the company's public profile, entertaining spectators, acquiring sponsorships, and securing broadcasting rights deals. This book has been written for sports management students at Western Sydney University for the subject Sports Marketing (BUSM2048) where they will learn general marketing knowledge and theories relevant to the sports industry, such as sponsorship, endorsements, customer experience, pricing and operations. This activity is aligned with SDG4 – Quality Education.",
        "publisher": "Western Sydney University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/sports-marketing-an-australian-perspective"
    },
    {
        "title": "Capital Social y la Intención de Emprender",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Idilia Fernanda Bravo Bravo, Universidad Laica Eloy Alfaro de Manabí",
            "Carlos Alberto Cedeño Aguilar, Universidad UTE",
            "Erika Stephania Santander Salmon, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Angela Elena Barba Mosquera, Universidad UTE"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Nzc4MCwicHVyIjoiYmxvYl9pZCJ9fQ==--239ca0f2b4ca11bd18c8d21d072ba6c78280595d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_27_27_coverImage_es_ES.jpg",
        "description": "Descubrir qué factores motivan e influyen en la actividad emprendedora es un tema de gran interés para investigadores, formuladores de política socioeconómica, académicos y para las personas en general. A lo largo de este libro, los autores nos relatan de forma amena y comprensible cómo nuestro entorno cercano y lejano forma una serie de valores, actitudes y creencias que predisponen o no al individuo a emprender. Un libro que sin duda va a enriquecer nuestro espíritu emprendedor, dando respuesta a preguntas que alguna vez nos hemos planteado en torno a las personas que toman la gran decisión de crear sus propios negocios.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/capital-social-y-la-intencion-de-emprender"
    },
    {
        "title": "Money and Banking",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Robert E. Wright, NYU"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjEsInB1ciI6ImJsb2JfaWQifX0=--3341f29216626262bc7c51adcc582d81c410f190/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780982043080.png",
        "description": "The financial crisis of 2007-8 has already revolutionized institutions, markets, and regulation. Wright's Money and Banking V 2.0 captures those revolutionary changes and packages them in a way that engages undergraduates enrolled in Money and Banking and Financial Institutions and Markets courses.Minimal mathematics, accessible language, and a student-oriented tone ease readers into complex subjects like money, interest rates, banking, asymmetric information, financial crises and regulation, monetary policy, monetary theory, and other standard topics. Numerous short cases, called 'Stop and Think' boxes, promote internalization over memorization. Exercise drills ensure basic skills competency where appropriate. Short, snappy sections that begin with a framing question enhance readability and encourage assignment completion.The 2.0 version of this text boasts substantive revisions (additions, deletions, rearrangements) of almost every chapter based on the suggestions of many Money and Banking instructors.Some specific highlights are: Chapter 11 now contains enhanced descriptions of recent regulatory changes, including Dodd-Frank, Chapter 12 is an entirely new chapter on derivatives covering forwards, futures, options, and swaps that also including comprehensive treatment of the causes and consequences of financial crises, and Chapter 14 has updated discussions of the Federal Reserve's monetary policy tools, including paying interest on reserves, and the structure and leadership of the European Central Bank.Recent financial turmoil has increased student interest in the financial system but simultaneously threatens to create false impressions and negative attitudes. This up-to-date text by a dynamic, young author encourages students to critique the financial system without rejecting its many positive attributes. Peruse the book online now to see for yourself if this book fits the needs of your course and students.This textbook has been used in classes at:Augustana College, Central Michigan University, Florida State University, Lyndon State College, Princeton University, Rutgers University, University of Southern Maine, Western Oregon University., Westminster College.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9780982043080",
        "source": "https://open.umn.edu/opentextbooks/textbooks/money-and-banking"
    },
    {
        "title": "Financial Management for Small Businesses: Financial Statements & Present Value Models",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Lindon J. Robinson, Michigan State University",
            "Steven D. Hanson, Michigan State University",
            "J. Roy Black, Michigan State University"
        ],
        "subjects": [
            "Business",
            "Finance",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMwNiwicHVyIjoiYmxvYl9pZCJ9fQ==--affe0e7228cba33a4706066c76ed40c277b8e6d9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/FinancialManagement_Cover_2019Open-350x525.jpg",
        "description": "This book is for those whose financial management focus is on small businesses. For you, we adapt the traditional financial management themes emphasized in corporate financial management courses to meet the needs of small businesses.Many financial managers of small businesses come from farms or agribusinesses. Others are interested in working for or starting businesses in the food or retail sectors. In most cases, these businesses aren’t organized as C-corporations impacting things like taxes, depreciation, and legal requirements around compiling and reporting financial data. They are rarely publicly traded which creates unique constraints to raising debt and equity capital and calculating required risk-adjusted returns.",
        "publisher": "Michigan State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/financial-management-for-small-businesses-financial-statements-present-value-models"
    },
    {
        "title": "Principles of Finance",
        "copyright_year": null,
        "last_update": null,
        "authors": [
            "Julie Dahlquist, Texas Christian University",
            "Rainford Knight, Florida Atlantic University",
            "Alan S. Adams, Dean College"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzY5OSwicHVyIjoiYmxvYl9pZCJ9fQ==--3bcdbff73bf151763a58ef0238c8f9c924fffc81/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-05-27%20at%201.06.18%20PM.png",
        "description": "Designed to meet the scope and sequence of your course,Principles of Financeprovides a strong foundation in financial applications using an innovative use-case approach to explore their role in business decision-making. An array of financial calculator and downloadable Microsoft Excel data exercises also engage students in experiential learning throughout. With flexible integration of technical instruction and data, this title prepares students for current practice and continual evolution.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781951693541",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-finance"
    },
    {
        "title": "Organizational Behavior",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Multiple Authors"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzE1LCJwdXIiOiJibG9iX2lkIn19--d92b4cb0a23d9297b49b59137f23867771db4b74/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/978-1-947172-72-2.png",
        "description": "This OpenStax resource aligns to introductory courses in Organizational Behavior. The text presents the theory, concepts, and applications with particular emphasis on the impact that individuals and groups can have on organizational performance and culture. An array of recurring features engages students in entrepreneurial thinking, managing change, using tools/technology, and responsible management; furthermore, the unique chapter on Social Media and Communication contextualizes the importance and implications of various platforms and communications methods.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/organizational-behavior-2019"
    },
    {
        "title": "Intermediate Financial Accounting Volume 1",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Glenn Arnold, Athabasca University",
            "Suzanne Kyle"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE5NywicHVyIjoiYmxvYl9pZCJ9fQ==--64df2ae8b3bfa7808a4778ffa7633de206ad9756/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/ArnoldKyle-IntermFinAcct-Vol1-2021A-Thumbnail.png",
        "description": "This text is intended for a first course in Intermediate Financial Accounting. It presumes that students have already completed one or two Introductory Financial Accounting courses. The book reflects current International Financial Reporting Standards (IFRS), such as IFRS 15 - Revenue from Contracts With Customers. It focuses on more difficult intermediate accounting topics that match prerequisite requirements for students advancing to a second level Intermediate Financial Accounting course. Advanced topics that are covered in Advanced Financial Accounting courses, such as consolidations and foreign exchange, are not included here. The text is written with an approachable style that focuses on key concepts that will be relevant to students' future careers as accountants.The book provides a review of Introductory Accounting concepts and covers all topics essential to a first level Intermediate Accounting course: the conceptual framework and current landscape of financial reporting; statements of financial position, comprehensive income, cash flows and shareholders' equity; cash and receivables; revenue; inventory; property plant and equipment; intangible assets; and intercorporate investments.",
        "publisher": "Lyryx",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/intermediate-financial-accounting-volume-1"
    },
    {
        "title": "Health and Safety in Canadian Workplaces",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Jason Foster, Athabasca University",
            "Bob Barnetson, Athabasca University"
        ],
        "subjects": [
            "Business",
            "Human Resources"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzY4LCJwdXIiOiJibG9iX2lkIn19--afea8f53424a540df74e5262f67c18c07ce724e4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781771991841.png",
        "description": "Workplace injuries happen every day and can profoundly affect workers, their families, and the communities they live in. This textbook provides workers with an introduction to effective injury prevention. The book pays particular attention to how issues of precarious employment, gender, and ill health can be better handled in Canadian occupational health and safety (OHS).This introduction to OHS differs from others because it contends that the practice of occupational health and safety can only be properly understood if we acknowledge that workers and employers have conflicting interests. Specifically, we investigate which workplace hazards are recognized and controlled,the manner in which these hazards are controlled, and who makes these decisions. These are all factors that reflect the broader political economy of employment and suggest that OHS is contested terrain.",
        "publisher": "Athabasca University Press",
        "language": "English",
        "isbn13": "9781771991841",
        "source": "https://open.umn.edu/opentextbooks/textbooks/health-and-safety-in-canadian-workplaces"
    },
    {
        "title": "Principles of Marketing",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjAxMSwicHVyIjoiYmxvYl9pZCJ9fQ==--9f2d61b6355f48c59cef108817dcb72a4d036a37/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Principles-of-Marketing-683x1024%20(1).jpg",
        "description": "Principles of Marketingteaches the experience and process of actually doing marketing – not just the vocabulary. It carries five dominant themes throughout in order to expose students to marketing in today's environment:Service dominant logic — This textbook employs the term 'offering' instead of the more traditional First 'P' — product. That is because consumers don't sacrifice value when alternating between a product and a service. They are evaluating the entire experience, whether they interact with a product, a service, or a combination. So the fundamental focus is providing value throughout the value chain, whether that value chain encompasses a product, service, or both.Sustainability — Increasingly, companies are interested in the impact they are having on their local community as well as the overall environment. This is often referred to as the 'triple bottom line' of financial, social, and environment performance.Ethics and social responsibility — Following on the sustainability notion is the broader importance of ethics and social responsibility in creating successful organizations. The authors make consistent references to ethical situations throughout chapter coverage, and end of chapter material in most chapters will encompass ethical situations.Global coverage — the authors deliberately entitled Chapter 1 'What is Marketing?' Whether it is today's price of gasoline, the current U.S. presidential race, or Midwestern U.S. farming, almost every industry and company needs strong global awareness. And today's marketing professionals must understand the world in which they and their companies operate.Metrics — Firms today have the potential to gather more information than ever before about their current and potential customers. That information gathering can be costly, but it can also be very revealing. With the potential to capture so much more detail about micro transactions, firms should now be more able to answer 'well, what this marketing strategy really worth it?' And 'what is the marketing ROI?' And finally, 'what is this customer or set of customers worth to us over their lifetime?'",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135193",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-marketing"
    },
    {
        "title": "Communication for Business Success",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk1OCwicHVyIjoiYmxvYl9pZCJ9fQ==--a055c223959f04649e60ce6edbcac1f25dc2ec1b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Business-Communication-for-Success-683x1024.jpg",
        "description": "Business Communication for Success(BCS) provides a comprehensive, integrated approach to the study and application of written and oral business communication to serve both student and professor.This series features chapters with the following elements:Learning ObjectivesIntroductory ExercisesClear expectations, relevant background, and important theoriesPractical, real-world examplesKey Takeaways or quick internal summariesKey terms that are easily identifiedIn-chapter assignmentsPostchapter assessments linked to objectives and skills acquisitionEach chapter is self-contained, allowing for mix-and-match flexibility and custom or course-specific design. Each chapter focuses on clear objectives and skill demonstrations that can be easily linked to your syllabus and state or federal requirements. Supported by internal and external assessments, each chapter features time-saving and learning-enhancement support for instructors and students.BCS is designed to help students identify important information, reinforce for retention, and demonstrate mastery with a clear outcome product.The text has three content categories:FoundationsProcess and productsContextsThe first three chapters form the core foundation for the study of oral and written business communication. The next sequence of chapters focus on the process of writing, then oral performance with an emphasis on results. The final sequence focuses on contexts where business communication occurs, from interpersonal to intercultural, from groups to leadership.In each of the process and product chapter sequences, the chapters follow a natural flow, from prewriting to revision, from preparation for a presentation to performance. Each sequence comes together in a concluding chapter that focuses on action—where we apply the skills and techniques of written or oral communication in business, from writing a letter to presenting a sales speech. These performances not only serve to reinforce real-world applications but also may serve as course assessments.This text has been used in classes at: Ohio University, Miami University – Oxford, Kent State University – Salem Campus, Cuyahoga Community College – West, University of Toledo, Cuyahoga Community College – District, Northern Arizona University, Gateway Community College, University of Arizona, Arizona Western College, Boise State University,Western Governors University, Doane College, Mcpherson College, University of Nebraska Med Center, Suny Fredonia, State University of New York Institute of Technology at Utica/Rome, Trinidad State Junior College, University of Delaware, Brenau University, Brewton-Parker College, Loras College, Kapiolani Community College, Muscatine Community College, Greenville College, University of Illinois – Chicago, Millikin University, Rockland Community College, Cornell University, National-Louis University – Lisle, St. Gregory's University, University of Southern Indiana, Missouri State University – W Plains, Bucks County Community College – Newton, Clarion University of Pennsylvania, Pulaski Technical College, Temple University, Dixie State College of Utah, Averett University, Virginia Polytech Institute, Fond Du Lac Tribal Community College, Lipscomb University, Edgewood College, University of Wisconsin – Stout, Wisconsin Lutheran College, Virginia State University, North Georgia Technical College – Blairsville, Paradise Valley Community College, Fordham University – Lincoln Center, New England College of Business/Finance, Eastern New Mexico University, University of Alabama, Albertus Magnus College, Pepperdine University, Fullerton College, Santa Ana College, Miracosta College – Oceanside, San Jose State University, De Anza College, University of The Southwest, Florida Institute of Technology, Forida State University, Dean College, California State University, University of Massachusetts, Suffolk University, Stevenson University, Worcester State College, University of Maryland, Clover Park Technical College, Minnesota State University – Moorhead, College of St. Scholastica, Ferris State University, Concordia University, Southern New Hampshire University, Lower Columbia College, University of North Carolina – Greensboro, Rockingham Community College, Stanly Community College, Wayland Baptist University, Bunker Hill Community College, Salve Regina University, University of The Incarnate Word, St. Mary's University, University of Rhode Island, Texarkana College, Renton Technical College, Tarleton State University, Wayland Baptist University – Plainview, University of Houston, Stephen F. Austin State University, Bates Technical College, Chabot College, Bakersfield College, Azusa Pacific University, University of Houston – Downtown, California Southern University, Miracosta College, American Public University, American Public University System, Huntington Junior College, Flat World Knowledge University, Jackson Senior High School, Holmes High School, Dlielc, Clintondale High School, American University in Kosovo in Conjunction with Rochester Institute of Technology, Southeast Lauderdale High School, Benedict Business Hotel Management School, University of the People, Kwame Nkrumah University of Science and Technology, New Brunswick College of Craft and Design, New England School of English, Comsats Institute of Information Technology, Wayland Baptist University – Anchorage, Volcano Vista High School, Wayland Baptist University – San Antonio, Morrill High School, North Island College – B Campus, Seneca College, APOU, University of North Carolina – Greensboro, Southern New Hampshire University, University of Maryland University College, Harrisburg High School",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135056",
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-communication-for-success"
    },
    {
        "title": "The Power of Selling",
        "copyright_year": "2010",
        "last_update": null,
        "authors": [
            "Kimberly Richmond, Richmond Marketing + Communications"
        ],
        "subjects": [
            "Business",
            "Management",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzMsInB1ciI6ImJsb2JfaWQifX0=--e3d80cd80af2e9e62ba09693c2b0b875a041c7c8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781936126002.png",
        "description": "The Power of Sellingis the perfect textbook to teach students about the proven process of selling. More important, it teaches students how to apply the tenets of selling to how to sell themselves and get the job they want, with the same process professional sales people learn (or brush up) on their own selling skills.What makes someone successful in sales? Are great sales people born or made? Is there one magic selling process, or does the process change based on the business‚ or the customer? How can the selling process really come alive for students in the classroom? How do students learn how to sell for life, not just for a course?The Power of Sellingby Kim Richmond answers these questions and makes the principles of selling come alive.Kim looks at the topic of selling through a different lens, and provides inspiration and ideas. The Power of Selling provides an exciting and interactive experience for both professors and students through the use of 4 unique elements:1. ContentThe content is based on the core selling tenets so instructors will find the familiar principles of selling. In addition, the impact of Sales 2.0 is addressed at every stage including how to use interactive tools such as Twitter, LinkedIn, Facebook, blogs, and wikis effectively.2. Selling U:The last section of each chapter is called Selling U. It applies the concepts covered in the chapter to a student's job search. Selling U topics include how to think about yourself as a brand, how to create a powerful cover letter and resume, how to create your personal elevator pitch, how to use networking and informational interviews to get the word out about your brand, how to prepare and dress for an interview, and how to negotiate and accept the right job offer. What makes The Power of Selling different is that Selling U is integrated into every chapter, which makes this text the ultimate guide to selling yourself.3. Video Resources:Videos are used throughout the book. Additional videos that are not included in the text are available for instructor use. Here are videos that are available:… Video Ride-alongs — One of the best ways to learn about sales is by going on ride-alongs. So every chapter starts with an exclusive feature called a Video Ride-along. These short videos feature seven different sales professionals — one that starts each chapter. Each one talks about how he or she applies one of the key concepts covered in the chapter in their job. These videos are designed to be ”virtual ride-alongs“ so the students can actually feel as though they are getting insights first hand from selling professionals.… Over 50 videos are included featuring the sales professionals who are highlighted in the Video Ride-alongs. About half of the videos are used in the textbook. The balance are available for instructor use. Several are included in Video Learning Segments (see below). These videos are excellent resources for use in the classroom, exercises, and assignments.… Video Learning Segments In addition to the traditional supplements of Instructor Manual, PowerPoints, and Test Bank, there are also Video Learning Segments. These are PowerPoint slides embedded with videos designed to supplement the course PowerPoints and focus on one concept, like an ethical dilemma, pre-call preparation, or effective presentations, how to use email effectively. Each segment includes slides, videos, discussion questions, or exercises.4.The Power of Selling LinkedIn Group.This group was created on LinkedIn.com expressly as a resource for the faculty and students who use this textbook. The group includes sales professionals from across the country and from different industries. This is a great tool for faculty and students alike to network, participate in discussions, ask questions, and connect with ”real world“ selling professionals.Kim Richmond'sThe Power of Sellingis a fresh, interactive, and applied textbook intended for all introductory and sales, selling and salesmanship courses. If you're ready to prepare your ”students of selling“ for all that lies ahead in their professional career—you're ready for this book. Check it out.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781936126002",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-power-of-selling"
    },
    {
        "title": "Gestión del Cambio como Fundamento de la Dirección Estratégica",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Fernando Neptalí Terán-Guerrero, Instituto Superior Tecnológico Vicente León",
            "Mercy Elizabeth Guerrero-Espinosa, Instituto Superior Tecnológico Vicente León",
            "Viviana de Lourdes Vizcaíno-Villavicencio, Instituto Superior Tecnológico La Maná",
            "John Steet Gaibor-Mendoza, Instituto Superior Tecnológico La Maná",
            "Juan Carlos Pico-Lescano, Instituto Superior Tecnológico Pelileo",
            "Marco Vinicio Sandoval-Cárdenas, Instituto Superior Tecnológico Vicente León"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTI3NywicHVyIjoiYmxvYl9pZCJ9fQ==--b73652c5c9a5b72c8c9f908e00018c38289259e6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_28_28_coverImage_es_ES.jpg",
        "description": "El libro es una obra completa que examina la integración vital de la dirección estratégica y la gestión del cambio. El primer capítulo argumenta que el cambio estratégico es un componente crucial de la dirección estratégica, destacando la necesidad de anticipar y adaptarse a las fluctuaciones en el entorno de negocio. El segundo capítulo presenta la dirección estratégica como un modelo de cambio, subrayando la importancia de alinear la estrategia con la visión y los objetivos de la empresa para impulsar el cambio efectivo. El capítulo final analiza las competencias esenciales necesarias para la dirección estratégica, enfatizando en habilidades como el liderazgo, la toma de decisiones informada y la gestión de la incertidumbre. Esta obra es una guía esencial para aquellos que buscan comprender y aplicar efectivamente la gestión del cambio en un marco estratégico.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/gestion-del-cambio-como-fundamento-de-la-direccion-estrategica"
    },
    {
        "title": "Fundamentals of Infrastructure Management",
        "copyright_year": "2017",
        "last_update": "2019",
        "authors": [
            "Donald Coffelt, Carnegie Mellon University",
            "Chris Hendrickson, Carnegie Mellon University"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDUzLCJwdXIiOiJibG9iX2lkIn19--6f8d5b96c592ff3736c7a8adaf49f63fea2ef15d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000FunInfMan.png",
        "description": "The authors believe this free of charge book, Fundamentals of Infrastructure Management, will expand the impact of the material and help improve the practice of infrastructure management. By ‘free of charge,' we mean that the material can be freely obtained, but readers should devote time and effort to mastering the material. We have provided problem assignments for various chapters, and we strongly urge readers to undertake the problems as a learning experience.This book grew out of a decade of co-teaching a course entitled ‘Infrastructure Management' at Carnegie Mellon University. Our teaching philosophy was to prepare students for work in the field of infrastructure management. We believe that infrastructure management is a professional endeavor and an attractive professional career. The book is co-authored by two accomplished engineers - each representing professional practice, academic research and theoretical evaluation. Their collective strengths are presented throughout the text and serve to support both the practice of infrastructure management and a role for infrastructure management inquiry and search. Importantly, both co-authors have academic research interests (and a number of research publications) on various topics of infrastructure management. That said, the primary audience for this book is expected to be professionals intending to practice infrastructure management, and only secondarily individuals who intend to pursue a career of research in the area.The text draws examples and discusses a wide variety of infrastructure systems, including roadways, telecommunications, power generation, buildings and systems of infrastructure. We have found that some common fundamentals of asset management, analysis tools and informed decision-making are useful for a variety of such systems. Certainly, many infrastructure managers encounter a variety of infrastructure types during their professional careers. Moreover, due to the functional inter-dependencies of different infrastructure systems, it is certainly advantageous for managers of one infrastructure type to understand other types of infrastructure. For example, roadway managers rely upon the power grid for traffic signal operation.",
        "publisher": "Donald Coffelt and Chris Hendrickson",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-infrastructure-management"
    },
    {
        "title": "Introductory Business Statistics",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Lex Holmes, University of Oklahoma",
            "Barbara Illowsky, De Anza College",
            "Susan Dean, De Anza College"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM2LCJwdXIiOiJibG9iX2lkIn19--4e5040f49870b1a40bb5cec6c2f9449058a4db17/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781947172470.png",
        "description": "Introductory Business Statisticsis designed to meet the scope and sequence requirements of the one-semester statistics course for business, economics, and related majors. Core statistical concepts and skills have been augmented with practical business examples, scenarios, and exercises. The result is a meaningful understanding of the discipline, which will serve students in their business careers and real-world experiences.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781947172470",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introductory-business-statistics-2017"
    },
    {
        "title": "The Path to Funding: The Artist’s Guide to Building Your Audience, Generating Income, and Realizing Career Sustainability",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Zane Forshee, Baltimore, MD",
            "Christina Manceor, Baltimore, MD",
            "Robin McGinness, Baltimore, MD"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDIzMywicHVyIjoiYmxvYl9pZCJ9fQ==--0f811a57921d6b6788d5f195fcb244a4728e762c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/OER-Book-Cover-Path-to-Funding-Web-Book-Cover-900x1200-1-768x1024.png",
        "description": "Based on coursework developed at Peabody Conservatory, this book breaks down the process of developing an artist mission statement, generating new ideas for creative projects, and creating an engaging project description. It also covers methods for artists to identify their audience, generate a comprehensive project budget, collect compelling work samples, and identify potential funders to support their creative work. Written by a team of active artists and educators, this resource provides creatives with tools and strategies to communicate passionately and effectively about their work and take control of their financial and artistic future.",
        "publisher": "The Peabody Institute of The Johns Hopkins University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-artist-s-guide-to-building-your-audience-generating-income-and-realizing-career-sustainability"
    },
    {
        "title": "Public Administration: The Essentials - First Edition",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Jayme L. Renfro"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2MDIsInB1ciI6ImJsb2JfaWQifX0=--01e03e18f2c78c7ff8b9b147b952d08f62be4bbd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/small-310ac82b970728e0f3f424331a0df2b5.jpg",
        "description": "Public Administration: The Essentialsprovides students with the conceptual foundation they need for an introduction to the field of public administration. This OER textbook covers the most critical issues in the field through the use of classic texts and theory as well as through modern examples.",
        "publisher": "University of Northern Iowa",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/public-administration-the-essentials"
    },
    {
        "title": "Introduction to Entrepreneurship",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Katherine Carpenter, University of Victoria"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzA5NSwicHVyIjoiYmxvYl9pZCJ9fQ==--3f00fad9b0317a0fa3952452fc0cc24e3f097c73/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/OpenEducation_Pressbooks-Cover_IntroToEntrepreneurship-350x453.jpg",
        "description": "Learn about entrepreneurship and what makes entrepreneurs successful, all while developing your entrepreneurial skills.",
        "publisher": "Kwantlen Polytechnic University",
        "language": "English",
        "isbn13": "9781989864500",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-entrepreneurship"
    },
    {
        "title": "Introduction to Social Media",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Cheryl Lawson, Oklahoma State University"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg1MywicHVyIjoiYmxvYl9pZCJ9fQ==--19b37f171442512391fd75506af68b22b755bc47/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Social%20Media.PNG",
        "description": "This book is aimed at managers, business owners, marketing managers, and aspiring social media marketing interns and managers. I will assume that however accomplished in your own field - baker, developer, teacher and that even as successful business owners, you approach the topic of social media marketing as a beginner. Even if you are an avid personal user of social networks, we will treat this book as a guided tour of social media for marketing purposes.",
        "publisher": null,
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-social-media"
    },
    {
        "title": "Foundations of Business Law and Legal Environment",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyLCJwdXIiOiJibG9iX2lkIn19--ef29acb7fe6ec2b1bae57420abb8e9b2345db59d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453343722.png",
        "description": "Mayer, Warner, Siedel and Lieberman's Foundations of Business Law and the Legal Environment is an up-to-date textbook with comprehensive coverage of legal and regulatory issues for your introductory Legal Environment or Business Law course.The text is organized to permit instructors to tailor the materials to their particular approach.The authors take special care to engage students by relating law to everyday events with which they are already familiar with their clear, concise and readable style.Business Law and the Legal Environment provides students with context and essential concepts across a broad range of legal issues with which managers and business executives must grapple. The text provides the vocabulary and legal savvy necessary for business people to talk in an educated way to their customers, employees, suppliers, government officials — and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343722",
        "source": "https://open.umn.edu/opentextbooks/textbooks/foundations-of-business-law-and-legal-environment"
    },
    {
        "title": "Critical Employment, Ethical, and Legal Scenarios in Human Resource Development",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Claretha Hughes, University of Arkansas"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTgwNywicHVyIjoiYmxvYl9pZCJ9fQ==--27d288a7fb5f25e00e6aa0e5f741885136c37aad/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Grandmas-tree-2-701x1024.jpg",
        "description": "This book provides mini-cases for HRD and other disciplines to use for engaging students in incident discussions. Exploring ways to solve problems and make decisions about situations that occur at work.",
        "publisher": "University of Arkansas",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/critical-employment-ethical-and-legal-scenarios-in-human-resource-development"
    },
    {
        "title": "Leading with Cultural Intelligence",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Mai Moua, Leadership Paradigms, Inc"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE4LCJwdXIiOiJibG9iX2lkIn19--8f96166b22e1bef43f71f809909ae3aaaf1a93df/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453332894.png",
        "description": "Organizations in the 21st century are in need of culturally intelligent managers and leaders. The pressure to build authentic global networks and to cultivate an appreciation and respect for cultural differences and similarities has driven cultural intelligence to the forefront of diversity and inclusion work.Preparing today's students to be effective leaders in their professional lives requires that they hone their cultural intelligence as it is vital to working inter- and intra-culturally in today's global economy. This unique ability to identify, recognize, and acknowledge the differences and similarities that exist between and among cultural groups and systems will set their leadership skills apart from the masses. And when applied, cultural intelligence can bridge the gap in cultural misunderstanding by creating awareness, knowledge, and patience of cultural norms and behaviors.The purpose ofLeading With Cultural Intelligenceby Mia Moua is to outline the important ideas of cultural intelligence and the steps that must be considered and then practiced to become a culturally intelligent leader. The most important aspect covered within this book is that cultural intelligence is both a strategy and a tool towards cultural competency and proficiency. This book outlines the importance of understanding culture and its impact on organizations, the strategic value of cultural intelligence, and the significance of integrating and practicing cultural intelligence in everyday business life. When all these aspects are properly integrated and applied in the leadership and management process, organizations are more innovative and adaptable to respond to cultural changes.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453332894",
        "source": "https://open.umn.edu/opentextbooks/textbooks/leading-with-cultural-intelligence"
    },
    {
        "title": "Introduction to the Nonprofit Sector",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Dyana P. Mason, Eugene, Oregon"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDI0NSwicHVyIjoiYmxvYl9pZCJ9fQ==--dced659955fa74c1b1b985836a738096cd615dc2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Intro-to-the-nonprofit-sector-2-717x1024.jpeg",
        "description": "Nonprofit organizations are on the front lines in communities, providing an important foundation for the social safety net in the United States and around the world.  They also provide places where people can gather, share ideas and build community.  They often accomplish amazing feats with few resources.   This book was designed to be used in an undergraduate-level introductory course in the nonprofit sector.   It provides an overview of the vocabulary used in defining the work of nonprofit organizations, topics of interest to nonprofit managers,  and describes the primary roles nonprofits play in American (and to a lesser extent international) communities.  The book also considers the growing numbers and influence of social enterprises and other “social innovation” organizations. Throughout, it brings in leading themes of accountability, ethics and obligations facing many nonprofit organizations as they go about their work – challenges that should be well understood by anyone interested in becoming a leader in the nonprofit sector.",
        "publisher": "Open Oregon Educational Resources",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-the-nonprofit-sector"
    },
    {
        "title": "Risk Management for Enterprises and Individuals",
        "copyright_year": "2009",
        "last_update": null,
        "authors": [
            "Etti Baranoff, Virginia Commonwealth University",
            "Patrick Lee Brockett, University of Texas, Austin",
            "Yehuda Kahane, Tel Aviv University"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjgsInB1ciI6ImJsb2JfaWQifX0=--47b1d057aa34c3c515b4482eb7ed16b7da0a86cb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780982361801.png",
        "description": "This book is intended for the Risk Management and Insurance course where Risk Management is emphasized.When we think of large risks, we often think in terms of natural hazards such as hurricanes, earthquakes or tornados. Perhaps man-made disasters come to mind such as the terrorist attacks in the U.S. on September 11, 2001. Typically we have overlooked financial crises, such as the credit crisis of 2008. However, these types of man-made disasters have the potential to devastate the global marketplace. Losses in multiple trillions of dollars and in much human suffering and insecurity are already being totaled, and the global financial markets are collapsing as never before seen.We can attribute the 2008 collapse to financially risky behavior of a magnitude never before experienced. The 2008 U.S. credit markets were a financial house of cards. A basic lack of risk management (and regulators' inattention or inability to control these overt failures) lay at the heart of the global credit crisis. This crisis started with lack of improperly underwritten mortgages and excessive debt. Companies depend on loans and lines of credit to conduct their routine business. If such credit lines dry up, production slows down and brings the global economy to the brink of deep recession—or even depression. The snowballing effect of this failure to manage the risk associated with providing mortgage loans to unqualified home buyers have been profound, indeed. When the mortgages failed because of greater risk- taking on the Street, the entire house of cards collapsed. Probably no other risk-related event has had, and will continue to have, as profound an impact world wide as this risk management failure.How was risk in this situation so badly managed? What could firms and individuals have done to protect themselves? How can government measure such risks (beforehand) to regulate and control them? These and other questions come to mind when we contemplate the consequences of this risk management fiasco.Standard risk management practice would have identified sub-prime mortgages and their bundling into mortgage-backed-securities as high risk. People would have avoided these investments or would have put enough money into reserve to be able to withstand defaults. This did not happen. Accordingly, this book may represent one of the most critical topics of study that the student of the 21st century could ever undertake.Risk management will be a major focal point of business and societal decision—making in the 21st century. A separate focused field of study, it draws on core knowledge bases from law, engineering, finance, economics, medicine, psychology, accounting, mathematics, statistics and other fields to create a holistic decision-making framework that is sustainable and value- enhancing. This is the subject of this book.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9780982361801",
        "source": "https://open.umn.edu/opentextbooks/textbooks/risk-management-for-enterprises-and-individuals"
    },
    {
        "title": "Introduction to the Law of Property, Estate Planning and Insurance",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George J. Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School"
        ],
        "subjects": [
            "Business"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "Introduction to the Law of Property, Estate Planning and Insuranceis an up-to-date textbook that covers legal issues that students must understand relating to real estate (an especially important business asset), as well as estate planning and insurance. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Introduction to the Law of Property, Estate Planning and Insuranceprovides students with context and essential legal concepts relating to property rights and duties, estate planning, insurance, secured transactions, mortgages, and related topics. The text provides the vocabulary and legal savvy they will need when working with these concepts, which are critical to business planning and success.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453344163",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-the-law-of-property-estate-planning-and-insurance"
    },
    {
        "title": "Electronic Commerce: The Strategic Perspective",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Richard T. Watson, University of Georgia",
            "Pierre Berthon, Bentley College",
            "Leyland F. Pitt, Simon Fraser University",
            "George M. Zinkhan, University of Georgia"
        ],
        "subjects": [
            "Business",
            "Management",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2LCJwdXIiOiJibG9iX2lkIn19--01180f080ca2aef8dc06e8bc50ae2004f0e60ae6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ElecComme.png",
        "description": "This book is written both for practitioners and business students. Managers wishing to understand how electronic commerce is revolutionizing business will find that our comprehensive coverage of essential business issues (e.g., pricing and distribution) answers many of their questions. Advanced business students (junior, seniors, and graduate students) will find that the blend of academic structure and practical examples provides an engaging formula for learning.The book's title reflects some key themes that we develop. First, we are primarily concerned with electronic commerce, which we define as using technology (e.g., the Internet) to communicate or transact with stakeholders (e.g., customers). Second, we discuss how organizations must change in order to take advantage of electronic commerce opportunities. In this sense, our book offers the strategic perspective (i.e., the best way to operate a successful business in the 21st century). Third, with the growing importance of the Internet and related technologies, organizations must take electronic commerce into account when they are creating strategic plans. Thus, electronic commerce is a strategic perspective that all firms must adopt, both in the present and in the future. In other words, an organization that does not explicitly consider electronic commerce as a strategic imperative is probably making a crucial error. Here, we focus primarily on the opportunities and tactics that can lead to success in the electronic marketplace.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/electronic-commerce-the-strategic-perspective"
    },
    {
        "title": "Strategic Marketing in the Global Forest Industries - Third Edition",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Eric Hansen, Oregon State University",
            "Heikki Juslin, University of Helsinki"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI3MSwicHVyIjoiYmxvYl9pZCJ9fQ==--c24a1205a917542fd1831e4f8d745e2fd5ccf438/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/statmarkglobfor.jpg",
        "description": "The forest industry is increasingly global and every marketer of forest products should have a global perspective. As a natural resource-based industry, the forest industry has an especially high profile role in environmental protection and is increasingly involved in climate change mitigation and management. Global forests are not only important because they provide a source of industrial raw material, but also because of the various other human needs they satisfy. A forest products marketer should have a basic understanding of the role that global forests play in society. Major societal trends are impacting the external environment within which the forest industry operates. We provide an overview of global forests and a brief description of the markets for the main categories of the forest industry.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/strategic-marketing-in-the-global-forest-industries-third-edition"
    },
    {
        "title": "Business Law and the Legal Environment",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Miami",
            "Daniel M. Warner, Western Washington University",
            "George J. Siedel, University of Michigan Business School"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjIzLCJwdXIiOiJibG9iX2lkIn19--9baaafe6fd15c3fb9029dcbf810982052016fcdd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000BusLawLeg.png",
        "description": "Our goal is to provide students with a textbook that is up to date and comprehensive in its coverage of legal and regulatory issues—and organized to permit instructors to tailor the materials to their particular approach. This book engages students by relating law to everyday events with which they are already familiar (or with which they are familiarizing themselves in other business courses) and by its clear, concise, and readable style. (An earlier business law text by authors Lieberman and Siedel was hailed “the best written text in a very crowded field.”)This textbook provides context and essential concepts across the entire range of legal issues with which managers and business executives must grapple. The text provides the vocabulary and legal acumen necessary for businesspeople to talk in an educated way to their customers, employees, suppliers, government officials—and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-law-and-the-legal-environment"
    },
    {
        "title": "eMarketing: The Essential Guide to Marketing in a Digital World - 7th Edition",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Dionne Solomons",
            "Tania Kliphuis",
            "Michelle Wadley"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2NzgsInB1ciI6ImJsb2JfaWQifX0=--0096dc40a3d721437d93a14e2440d4c67867c863/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/eMarketing.jpg",
        "description": "Since our 10th Anniversary Edition ofeMarketing: The Essential Guide to Marketing in a Digital World, we have witnessed a global wave of change that has had an undeniable impact on how we live, connect, and communicate worldwide. There is no doubt that the COVID-19 pandemic has, and will continue to have, a lasting effect on human reality. With this in mind, we are incredibly proud to present the 7th Edition of our textbook.",
        "publisher": "Red & Yellow",
        "language": "English",
        "isbn13": "9780639707808",
        "source": "https://open.umn.edu/opentextbooks/textbooks/emarketing-the-essential-guide-to-marketing-in-a-digital-world"
    },
    {
        "title": "Sustainable Property Management",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Erin A. Hopkins, Virginia Tech"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDE3MiwicHVyIjoiYmxvYl9pZCJ9fQ==--522e1ab567e86bd2856e27f7b0b869b949b1a4d8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Cover-SustainablePropertyMgmt.JPG",
        "description": "Although “sustainability,” as used in the real estate context, is about preserving the environment, it is about more than that. In sustainable property management, sustainability encompasses three spheres—environmental, social, and economic. Sustainable property management is about reconciling these three spheres throughout the operations and maintenance phase of the building lifecycle in such a way that a balance is achieved between economic development and protection of environmental and social resources.This textbook explains how ecologically sustainable concepts may be implemented throughout the various property management operation functions while also considering the other spheres of sustainability. It also incorporates the theme of sustainable building practices as a human science as well as a building science by highlighting motivations and impacts to various stakeholders. The author draws on various industry examples to illustrate these concepts and provides many experiential activities for students to apply these concepts.Sustainable Property Managementis intended for students majoring in property management and real estate at both the undergraduate and graduate levels. It can be incorporated into an existing property management operations course or used for a stand-alone course focused on sustainable property management. It is available online for free in multiple formats and also as an affordable print edition.Are you reviewing or adopting this book for a course?Please help us understand your use by completing this form https://bit.ly/interest_sustainable_property_management.",
        "publisher": "Virginia Tech Publishing",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/sustainable-property-management"
    },
    {
        "title": "Business Writing For Everyone",
        "copyright_year": "2021",
        "last_update": "2024",
        "authors": [
            "Arley Cruthers, Kwantlen Polytechnic University"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMDgsInB1ciI6ImJsb2JfaWQifX0=--d6c2101d53f7f5272328503a4c085935be25aee5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Open-Education_Pressbooks_Cover-Business-Writing-for-Everyone-350x453.jpg",
        "description": "Business Writing For Everyone is an inclusive guide to writing in the workplace. The book takes a process-oriented, storytelling approach to composition: focusing less on genre and more on the decisions that effective business communicators make. Business Writing For Everyone also contains interactive H5P activities for students to test their learning, and activities for further reflection that instructors can use in the classroom or assign as homework.",
        "publisher": "Kwantlen Polytechnic University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-writing-for-everyone"
    },
    {
        "title": "Beginning Management of Human Resources",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk2MiwicHVyIjoiYmxvYl9pZCJ9fQ==--9874f590b611f9bdb3c8b6eec58075b86b1097d6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Human-Resource-Management-683x1024.jpg",
        "description": "Human Resource Managementteaches HRM strategies and theories that any manager—not just those in HR—needs to know about recruiting, selecting, training, and compensating people.Most students will be managing people at some point in their careers and not necessarily in a human resource management capacity. As businesses cut back, they may outsource HR duties to outside vendors. Or, in smaller businesses, the HR department is sometimes small or non-existent, and managers from other departments have to perform their own HRM. Therefore, teaching HRM from the perspective of a general manager, in addition to an HR manager, provides more relevance to students' careers and will give them a competitive advantage in the workplace.This text also provides practical applications of theory relevant to today's workplace. You won't find discussions about “posting vacancies on a job board” or “sending memos.” In the real world, HRM leverages technology in every aspect of the job—from online training modules to technology for better managing flex-time workers and telecommuters.Consider how most companies have gone “paperless” with pay stubs by using software. While such technology has made HRM easier, it has also created a new set of challenges. For example, how does a manager actually implement a new pay system? Therefore, it's important for students to understand what kinds of platforms exist in today's workplace to enhance their effectiveness as future managers.The conversational style of Human Resource Management engages students, while the academic rigor of its content provides them with the tools that any manager needs—whether they work in HR or a different department. PLUS it offers an array of supplements that gives them practice creating real HR documents and role-playing real HR scenarios. Add value to your students' education, enhance the relevance of your curriculum, and make your students more employable by adopting this book for your HRM class. Read it now online today!",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135117",
        "source": "https://open.umn.edu/opentextbooks/textbooks/human-resource-management"
    },
    {
        "title": "Law of Commercial Transactions",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George J. Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School"
        ],
        "subjects": [
            "Business"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "Law of Commercial Transactionsis an up-to-date textbook that covers legal issues that students who engage in commercial transactions must understand. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Law of Commercial Transactionsprovides students with context and essential legal concepts relating to key commercial transactions topics: contracts, sales, commercial paper, debtors and creditors. The text provides the vocabulary and legal savvy students will need to talk in an educated way to customers, suppliers, creditors, government regulators and other stakeholders — and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343302",
        "source": "https://open.umn.edu/opentextbooks/textbooks/law-of-commercial-transactions"
    },
    {
        "title": "Fundamentals of Business - 4th Edition",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Stephen J. Skripak, Virginia Tech",
            "Ron Poff, Virginia Tech"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQ1NCwicHVyIjoiYmxvYl9pZCJ9fQ==--9afd76bc7e0636daedb59cb16d185fdedb0e3743/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-01-13%20at%209.56.14%20AM.png",
        "description": "Fundamentals of Business, 4th Editionis an open education resource intended to serve as a no-cost, faculty-customizable primary text for one-semester undergraduate introductory business courses. It covers the following topics in business: Teamwork; economics; ethics; entrepreneurship; business ownership, management, and leadership; organizational structures and operations management; human resources and motivating employees; managing in labor union contexts; marketing and pricing strategy; hospitality and tourism, accounting and finance, personal finances, and technology in business. The textbook was designed for use in Virginia Tech’s Pamplin College of Business introductory level business course, MGT1104 Foundations of Business and is shared under a Creative Commons Attribution Non-Commercial ShareAlike 4.0 license.If you are an instructor reviewing, adopting, or adapting this textbook, please help us understand your use by filling out this formhttp://bit.ly/business-interest.A testbank is now available by request for this book:http://hdl.handle.net/10919/93404. The testbank covers chapters 1-18 and (currently) aligns to previous editions of the textbook. It is  available to any instructor who has adopted Fundamentals of Business in their course.",
        "publisher": "Virginia Tech Libraries",
        "language": "English",
        "isbn13": "9780997920178",
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-business"
    },
    {
        "title": "Project Management",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Adrienne Watt"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg1LCJwdXIiOiJibG9iX2lkIn19--04ff60b462552b9e5290483e8b0fe01a22378bbd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ProManage.png",
        "description": "This book covers the basics of project management. This includes the process of initiation, planning, execution, control and close out that all projects share.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": "9781774200131",
        "source": "https://open.umn.edu/opentextbooks/textbooks/project-management"
    },
    {
        "title": "Equilibrium Displacement Models: Theory, Applications, & Policy Analysis",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Gary W. Brester, Montana State University",
            "Joseph A. Atwood, Montana State University",
            "Michael A. Boland, University of Minnesota"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTI4MCwicHVyIjoiYmxvYl9pZCJ9fQ==--73a59aaeedd51a6bcbad8a332a0cbc2a0902034b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/EquilibriumDisplacementModels-1ed.pdf.jpg",
        "description": "Applied economists frequently use equilibrium displacement models (EDMs), also termed linear elasticity models, for policy analyses because they can be used to estimate changes in prices and quantities that result from exogenous economic or policy shocks. These models are also widely used to estimate changes in producer and consumer surplus caused by exogenous economic shocks and to quantify the short- and long-term impacts of a variety of economic and regulatory actions across multiple markets. For the first time, a textbook that contains all of the theory and applications of EDMs along with a set of spreadsheet files is available in one place.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/equilibrium-displacement-models-theory-applications-policy-analysis"
    },
    {
        "title": "Launch! Advertising and Promotion in Real Time",
        "copyright_year": "2009",
        "last_update": null,
        "authors": [
            "Michael Solomon, St. Joseph’s University",
            "Lisa Duke Cornell, University of Florida",
            "Amit Nizan, Advertising Age"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTgsInB1ciI6ImJsb2JfaWQifX0=--af590901bd978407823790378d88a932e9549b6b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780982043028.png",
        "description": "Launch! Advertising and Promotion is written for advertising and promotion courses taught to students in the business school and journalism & mass communication students.This textbook is the first of its kind to teach advertising concepts by reverse engineering a real advertising campaign from beginning to end.In April 2007, SS+K, an innovative New York City communications agency, launched the first ever branding campaign for msnbc.com with the tag 'A Fuller Spectrum of News.' Launch! follows that campaign from initial agency pitch through roll-out of print and media assets to post-campaign analysis. Throughout, it exposes readers to the theory and concepts of advertising and promotion, and the personalities and decisions that drove this campaign. The book takes a rare look ”behind the curtain“ — even letting you see some of the paths not chosen by the agency and client.Students get a realistic sense of how theory plays out in practice, and get a flavor for the exciting field of advertising and promotion. And, they consistently learn the perspectives of both the advertising agency (where many journalism and communications students will work) and the client (where many marketing majors will work).This is a unique book, with a unique perspective, by a unique author team, and you won't find this kind of insight in any other text on the market. We think you're going to love it!This textbook has been used in classes at:Ball State University, Emerson College, Florida Institute of Technology, Grand Valley State University, Johnson County Community College, Manchester Business School, McLennan Community College, Michigan State University, North Hennepin Community College, Pierce College, Rochester Institute of Technology, Saint Louis University, Salem State College, South Dakota State University, Texas State University, Texas Tech University, University of New Hampshire, University of North Carolina, University of Notre Dame, University of South Florida, Virginia Tech, Western Kentucky University.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9780982043028",
        "source": "https://open.umn.edu/opentextbooks/textbooks/launch-advertising-and-promotion-in-real-time"
    },
    {
        "title": "Principles of Strategic Management Accounting",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Stijn Masschelein, University of Western Australia"
        ],
        "subjects": [
            "Business",
            "Accounting"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMjksInB1ciI6ImJsb2JfaWQifX0=--28c297825529633d7cf50b02d9f26e3099cb6e34/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Principles-of-Strategic-Management-Accounting-cover-350x529.png",
        "description": "This textbook explains the economic and sociological principles that underpin the use of strategic management accounting practices in organisations. Each chapter of the first part starts with a gentle, conversational introduction to the insights of one strand of academic literature and applies the insights to modern performance measurement and evaluation practices. The following parts apply the principles to specific accounting tools such as the budget, cost accounting, and the balanced scorecard. The textbook can be used in an advanced management accounting undergraduate unit or a post-graduate unit to give students a firm grounding to analyse measurement and evaluation practices in modern organisations. The textbook is meant to be a jumping off point for students and prepare them to analyse case studies and technical articles on strategic management accounting.",
        "publisher": "University of Western Australia",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-strategic-management-accounting"
    },
    {
        "title": "Digital Accessibility as a Business Practice",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Digital Education Strategies"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjI1LCJwdXIiOiJibG9iX2lkIn19--fdf0338ef8132453a12136dcd46f9decdbb4e5b0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000DigAccBus.jpg",
        "description": "Most business leaders would agree that reaching the broadest audience is good for a business’s bottom line. A good portion of that audience will be people with disabilities. How, though, would an organization go about ensuring it is as accessible as it can be to all its potential clients or customers, including people with disabilities? This book has been created to answer this question, and to demystify “digital accessibility” as a business practice. It brings together all the pieces of the digital accessibility picture, and provides strategies and resources that will help make digital accessibility a part of an organization’s business culture.",
        "publisher": "Ryerson University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/digital-accessibility-as-a-business-practice"
    },
    {
        "title": "Business Communication: Five Core Competencies",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Kristen Lucas, University of Louisville",
            "Jacob D. Rawlins, Brigham Young University",
            "Jenna Haugen, University of North Carolina at Chapel Hill"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA1OTYsInB1ciI6ImJsb2JfaWQifX0=--43598b2212996dd70937651f5474b19dc3f9aaef/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/BookCover-1-350x467.png",
        "description": "Business Communication: Five Core Competenciesis a practical, engaging book designed to help undergraduate students and business professionals develop competence and build confidence in their business writing skills. Readers will learn about the five core competencies of business communication: professional, clear, concise, evidence-driven, and persuasive. They also will learn strategies for applying each of these competencies across a range of real-world business scenarios. Each chapter includes Communication Tips, Your Turn Exercises, and how-to advice for writing a variety of business messages.",
        "publisher": "SAALCK",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-communication-five-core-competencies"
    },
    {
        "title": "Technical and Professional Writing Genres: A Study in Theory and Practice",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Eric Howerton, Oklahoma State University",
            "Michael Beilfuss, Missouri Southern State University",
            "Katrina Peterson, Roswell, New Mexico",
            "Staci Bettes",
            "Katie Rieger"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzE5LCJwdXIiOiJibG9iX2lkIn19--7123901ff48759e503be87c040b4a544e7b2864d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Technical%20Writing_Cover_Final_001.png",
        "description": "This modern, open-source guide to technical and professional writing explores workplace composition through theoretical and practical applications. Discussions of multiple writing genres will assist you in understanding how to apply for jobs, how to compose clear and precise business communications once the job has been acquired, and how to create documents -- such as proposals and reports -- that will be instrumental in helping to advance your career.",
        "publisher": "Oklahoma State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/technical-and-professional-writing-genres-study"
    },
    {
        "title": "Principles of Marketing",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Maria Gomez Albrecht, University of Texas",
            "Mark Green, Simpson College",
            "Linda Hoffman, Ivy Tech Community College"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQ5MiwicHVyIjoiYmxvYl9pZCJ9fQ==--2b0e5e3cb8d7d8cfbfd80d2e90d02211b393a66d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-01-30%20at%208.51.30%20AM.png",
        "description": "Principles of Marketingis designed to meet the scope and sequence for a one-semester marketing course for undergraduate business majors and minors.Principles of Marketingprovides a solid grounding in the core concepts and frameworks of marketing theory and analysis so that business students interested in a major or minor in marketing will also be prepared for more rigorous, upper-level elective courses. Concepts are further reinforced through detailed, diverse, and realistic company and organization scenarios and examples from various industries and geographical locations. To illuminate the meaningful applications and implications of marketing ideas, the book incorporates a modern approach providing connections between topics, solutions, and real-world problems.Principles of Marketingis modular, allowing flexibility for courses with varied learning outcomes and coverage.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781711471525",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-marketing-2022"
    },
    {
        "title": "Principles of Management",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Contributing Authors"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjQyLCJwdXIiOiJibG9iX2lkIn19--9d9e04c694b4e6aed775f3182d1193cd25c649e8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780998625775.png",
        "description": "Principles of Management is designed to meet the scope and sequence requirements of the introductory course on management. This is a traditional approach to management using the leading, planning, organizing, and controlling approach. Management is a broad business discipline, and the Principles of Management course covers many management areas such as human resource management and strategic management, as well behavioral areas such as motivation. No one individual can be an expert in all areas of management, so an additional benefit of this text is that specialists in a variety of areas have authored individual chapters.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9780998625775",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-management-2019"
    },
    {
        "title": "An Introduction to Cooperation and Mutualism",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Michael Boland, University of Minnesota"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDY0LCJwdXIiOiJibG9iX2lkIn19--10c4481ee1c1a07269c90baa003ac0b1d7ea3b11/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781946135384.png",
        "description": "This textbook introduces readers to the idea of cooperation and mutualism. Cooperatives and mutuals are participatory organizations in which members participate in control and governance, receive economic benefits through patronage refunds or net income, and become owners through equity. These mutual-benefit organizations exist alongside non-profit organizations and investor-benefit organizations through the global economy.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135384",
        "source": "https://open.umn.edu/opentextbooks/textbooks/an-introduction-to-cooperation-and-mutualism"
    },
    {
        "title": "Fundamentals of Global Strategy",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Cornelis A. de Kluyver, University of Oregon"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzLCJwdXIiOiJibG9iX2lkIn19--b3e7b05ffb85fd70b273c2a0f534c83c4fa6b3c8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453332870.png",
        "description": "The globalization of the competitive landscape has forced companies to fundamentally rethink their strategies. Whereas once only a few industries such as oil could be labeled truly global, today many—from pharmaceuticals to aircraft to computers—have become global in scale and scope. As a consequence, creating a global competitive advantage has become a key strategic issue for many companies, and students need to possess an understanding of the impact of global strategies on a business.Crafting a global strategy requires making decisions about which strategy elements can and should be globalized and to what extent, and de Kluyver's Fundamentals of Global Strategy can help you illuminate these facts to your students.Fundamentals of Global Strategy poses the following questions for your students to analyze:What markets and/or regions should a company compete in and why?To what degree can and should products and services be standardized?Is it advantageous to adopt a more or less uniform market positioning worldwide?What value-added activities should it keep in-house, outsource, or relocate for competitive advantage?How can competitive responses be most effectively coordinated on a global basis?",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453332870",
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-global-strategy"
    },
    {
        "title": "Focusing on Organizational Change",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "William Q. Judge, Old Dominion University"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTExLCJwdXIiOiJibG9iX2lkIn19--604a2149730bbf89264ae9190916bf66cc89c672/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453332887.png",
        "description": "Never before have strategic leaders been confronted with so much overwhelming change. The traditional approach is to teach the leader or leaders how to direct or control the organizations' reaction on a monthly, weekly, or even daily basis. This approach is stressful and overwhelming for executive leaders, makes middle managers feel torn between honoring their senior leaders and listening to the demands of front line employees, and is alienating for front line employees.Focusing on Organizational Change offers an alternative to the traditional approach by focusing on building the change capacity of the entire organization in anticipation of future pressures to change. Based on systematic research of more than 5,000 respondents working within more than 200 organization or organizational units conducted during the previous decade, this book offers a clear and proven method for diagnosing your organizational change capacity. While building organizational change capacity is not fast or easy, it is essential for effective leadership and organizational survival in the 21st century.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453332887",
        "source": "https://open.umn.edu/opentextbooks/textbooks/focusing-on-organizational-change"
    },
    {
        "title": "The Business Ethics Workshop",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "James Brusseau, Pace University"
        ],
        "subjects": [
            "Business"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "Ethics is about determining value; it's deciding what's worth doing and what doesn't matter so much.Business ethics is the way we decide what kind of career to pursue, what choices we make on the job,which companies we want to work with, and what kind of economic world we want to live in and thenleave behind for those coming after. There are no perfect answers to these questions, but there's adifference between thinking them through and winging it.The Business Ethics Workshopprovides aframework for identifying, analyzing, and resolving ethical dilemmas encountered through working life.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-business-ethics-workshop"
    },
    {
        "title": "International Finance: Theory and Policy",
        "copyright_year": "2010",
        "last_update": null,
        "authors": [
            "Steve Suranovic, George Washington University"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMsInB1ciI6ImJsb2JfaWQifX0=--3384bba2c46e09713c925406336920bb6817b9c6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781936126460.png",
        "description": "International Finance Theory and Policyis built on Steve Suranovic's belief that to understand the international economy, students need to learn how economic models are applied to real world problems. It is true what they say, that ”economists do it with models.“ That's because economic models provide insights about the world that are simply not obtainable solely by discussion of the issues.International Finance Theory and Policydevelops a unified model of the international macroeconomy. The text provides detailed descriptions of major macroeconomic variables, covers the interest rate parity and purchasing power parity theories of exchange rate determination, takes an exhaustive look at the pros and cons of trade imbalances and presents the well-known AA-DD model to explore the effects of fiscal and monetary policy under both fixed and flexible exchange rates.The models are developed, not by employing advanced mathematics, but rather by walking students through a detailed description of how a model's assumptions influence its conclusions. But more importantly, each model and theory is connected to real world policy issues.The Finance Text has the following unique features: o Begins with an historical overview of the international macroeconomy to provide context for the theory. o Concludes with a detailed discussion of the pros and cons of fixed and floating exchange rate systems. o Provides an extensive look at the issue of trade imbalances. Readers learn techniques to evaluate whether a country's trade deficit (or surplus) is dangerous, beneficial, or benign. o Explains how purchasing power parity is used to make cross country income comparisons. o Offers clear detailed explanations of the AA-DD model. o Applies the AA-DD model to understand the effects of monetary and fiscal policy on GDP, the exchange rate, and the trade balance.International Finance Theory and Policyby Steve Suranovic is intended for a one-semester course in International Finance. After March 2010, you can check out the entire book online or request a desk copy.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781936126460",
        "source": "https://open.umn.edu/opentextbooks/textbooks/international-finance-theory-and-policy"
    },
    {
        "title": "Accounting in the Finance World",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk2MSwicHVyIjoiYmxvYl9pZCJ9fQ==--423b90b6b5a5b211683ccff2599b1eb676bdc3f8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Financial-Accounting-683x1024.jpg",
        "description": "This book is intended for an undergraduate or MBA level Financial Accounting course. It covers the standard topics in a standard sequence, utilizing the Socratic method of asking and answering questions.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135100",
        "source": "https://open.umn.edu/opentextbooks/textbooks/financial-accounting"
    },
    {
        "title": "Management Communication",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Lisa Thomas, Brigham Young University",
            "Julie Haupt, Brigham Young University",
            "Andy Spackman, Brigham Young University"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjE2LCJwdXIiOiJibG9iX2lkIn19--202e96175af7dd17db556c0eb42e49e655f84f3f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000ManageCom.jpg",
        "description": "Communication is the heart of business. Short emails, complex reports, private chats, impassioned pitches, formal presentations, and team meetings move information and ideas around an organization, define strategy, and drive decisions. Business communication is concise, direct, clear, and compelling.",
        "publisher": "The Marriott School at Brigham Young University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/management-communication"
    },
    {
        "title": "Exploring Business",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk2MCwicHVyIjoiYmxvYl9pZCJ9fQ==--23a893a1a3af70bf45a2db9ec31cf92ad9a5cee1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Exploring-Business-683x1024.jpg",
        "description": "The author's goals in writingExploring BusinessVersion 2.0 was simple: introduce students to business in an exciting way.Exploring Businessis adapted from a work produced by a publisher who has requested that they and the original author not receive attribution. This adapted edition is produced by the University of Minnesota Libraries Publishing through the eLearning Support Initiative. Though the publisher has requested that they and the original author not receive attribution, this adapted edition reproduces all original text and sections of the book, except for publisher and author name attribution.This textbook has been used in classes at: College of Alameda, Columbia Basin College, Flagler College, Johnson County Community College, Pasadena City College, Penn State University, Renton Technical College, San Diego Mesa College, Sierra College, Yuba College.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135094",
        "source": "https://open.umn.edu/opentextbooks/textbooks/exploring-business"
    },
    {
        "title": "Government Regulation and the Legal Environment of Business",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE0LCJwdXIiOiJibG9iX2lkIn19--6f60418b572511d7722f062abd4298ad1eb721f7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453343272.png",
        "description": "Mayer, Warner, Siedel and Lieberman's Government Regulation and the Legal Environment of Business is an up-to-date textbook that covers legal issues that students must understand in today's highly regulated business environment. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business, Government Regulation and the Legal Environment of Business provides students with context and essential legal concepts relating to contracts, consumer credit transactions, bankruptcy, intellectual property, securities regulation, regulation of real estate, antitrust, unfair trade practices, employment law and labor relations. The text provides the vocabulary and legal savvy they will need to talk in an educated way to customers, suppliers, employees, creditors, shareholders, government regulators and other stakeholders — and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343272",
        "source": "https://open.umn.edu/opentextbooks/textbooks/government-regulation-and-the-legal-environment-of-business"
    },
    {
        "title": "Gestión Empresarial: Concepción Legal bajo enfoque del proceso administrativo. Apuntes desde la perspectiva académica.",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "César Andrés Guerrero-Velástegui, Universidad Técnica de Ambato",
            "Xavier Alexander Godoy-Calvachi, Universidad Técnica del Norte",
            "Leonardo Daniel Castro-Cruz, Universidad Técnica del Norte",
            "Jimena Maribel Torres-Pérez, Universidad Técnica del Norte",
            "Fernando Neptalí Terán-Guerrero, Instituto Superior Tecnológico Vicente León"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxMzEsInB1ciI6ImJsb2JfaWQifX0=--a4fd4e75579470eb7c1daa27812240e13d833fd2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_43_43_coverImage_es_ES.jpg",
        "description": "Los principios de gestión empresarial y la concepción jurídica de la empresa son dos aspectos cruciales para cualquier negocio exitoso. Mientras que los principios de la gestión empresarial se centran en el logro de los objetivos organizacionales mediante una planificación, organización y dirección eficaces, la concepción jurídica de la empresa se ocupa de los requisitos y regulaciones legales que las empresas deben cumplir. Comprender la intersección entre estas dos áreas es esencial para que cualquier propietario o gerente de negocio garantice el éxito de su empresa. En esta obra exploraremos los principios de la gestión empresarial, la concepción jurídica de la empresa y cómo se interrelacionan en su contenido. La gestión empresarial eficaz es esencial para lograr los objetivos organizacionales, maximizar las ganancias y mantener una ventaja competitiva. Los principios de la gestión empresarial incluyen la planificación, la organización y el liderazgo. La planificación implica definir objetivos, identificar recursos y crear estrategias para alcanzar las metas. Organizar implica crear estructuras organizativas, delegar responsabilidades y establecer canales de comunicación. Liderar implica motivar a los empleados, resolver conflictos y fomentar el trabajo en equipo. Estos tres principios son interdependientes y deben trabajar juntos para garantizar el éxito de cualquier negocio. Debiendo actuar de forma ética y apegado a derecho para su próspera gestión.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651037",
        "source": "https://open.umn.edu/opentextbooks/textbooks/gestion-empresarial-concepcion-legal-bajo-enfoque-del-proceso-administrativo-apuntes-desde-la-perspectiva-academica"
    },
    {
        "title": "Introduction to Apparel Production Workbook",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Laurie M. Apple, University of Arkansas"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTg2OCwicHVyIjoiYmxvYl9pZCJ9fQ==--8ae9d08a049a9724d6f49751799ef22551540054/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/intro%20to%20apparel.png",
        "description": "Welcome toIntroduction to Apparel Production. Whether you are part of the college class or learning on your own, you will gain important concepts and techniques in beginning apparel production. This workbook is to accompany the activities through in person teaching or online learning. There will be graphics and videos to help guide you through each step of this workbook. There are 6 learning units and a sewing projects unit in this workbook. The sewing projects unit contains 4 projects: tote bag, skirt, shirt and pants. The pattern numbers may change due to the availability of patterns.",
        "publisher": null,
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-apparel-production-workbook"
    },
    {
        "title": "Legal Aspects of Marketing and Sales",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George J. Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "Legal Aspects of Marketing and Salesis an up-to-date textbook that covers legal issues that students who will work in marketing or with marketing managers must understand. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Legal Aspects of Marketing and Salesprovides students with context and essential legal concepts relating to contracts, sales, intellectual property, antitrust law and unfair trade practices. The text provides the vocabulary and legal savvy they will need to talk in an educated way to customers, suppliers, shareholders, government regulators and other stakeholders — and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343289",
        "source": "https://open.umn.edu/opentextbooks/textbooks/legal-aspects-of-marketing-and-sales"
    },
    {
        "title": "Problem Solving in Teams and Groups - 2",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Cameron W. Piercy"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzQwLCJwdXIiOiJibG9iX2lkIn19--2a62f7600b57d8856f11b3fd2c269cbf51703e51/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000ProSolGro.jpg",
        "description": "This textbook covers content relevant to COMS342 Problem Solving in Teams and Groups at the University of Kansas.",
        "publisher": "University of Kansas Libraries",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/problem-solving-in-teams-and-groups"
    },
    {
        "title": "Sistema de Costos por Órdenes de Producción para PYMES",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Rosa Verónica Núñez-Liberio, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Marco Vinicio Suarez-Núñez, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Cecilia Mercedes Navarrete-Zambrano, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Silvana Elizabeth Ruiz-López, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Patricia Yajaira Almenaba-Guerrero, Universidad Técnica Luis Vargas Torres de Esmeraldas"
        ],
        "subjects": [
            "Business",
            "Accounting"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzQ1NywicHVyIjoiYmxvYl9pZCJ9fQ==--4ef9e70a70d623627b9c94a9a597c33348d1f105/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_26_26_coverImage_es_ES.jpg",
        "description": "El libro “Sistema de Costos por Órdenes de Producción para PYMES” es un libro que se enfoca en la contabilidad de costos y cómo se puede aplicar en las pequeñas y medianas empresas. El libro se enfoca en el sistema de costos por órdenes de producción, que es un sistema que se utiliza para calcular los costos de producción de un producto específico. Este sistema es muy útil para las empresas que producen productos personalizados o productos que tienen una gran cantidad de variaciones. El libro cubre los conceptos básicos de la contabilidad de costos y cómo se pueden aplicar en las pequeñas y medianas empresas. También cubre los diferentes tipos de costos que existen y cómo se pueden calcular. Además, el libro cubre el sistema de costos por órdenes de producción en detalle y cómo se puede utilizar para calcular los costos de producción. El libro “Sistema de Costos por Órdenes de Producción para PYMES” es una guía útil para las pequeñas y medianas empresas que buscan mejorar su contabilidad de costos. El libro cubre los conceptos básicos de la contabilidad de costos y cómo se pueden aplicar en las pequeñas y medianas empresas. También cubre los diferentes tipos de costos que existen y cómo se pueden calcular. Además, el libro cubre el sistema de costos por órdenes de producción en detalle y cómo se puede utilizar para calcular los costos de producción.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/sistema-de-costos-por-ordenes-de-produccion-para-pymes"
    },
    {
        "title": "Introduction to Financial Analysis",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Kenneth S. Bigel, New York City, New York"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg4MywicHVyIjoiYmxvYl9pZCJ9fQ==--2dd6185184de3c1fc7746980a9923a24d9d425ba/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/thumbnail.jpeg",
        "description": "This Open Textbook is a dynamic guide incorporating the essential skills needed to build a foundation inFinancial Analysis. Students and readers will learn how to insightfully read a Financial Statement, utilize key financial ratios in order to derive forward-looking investment-related inferences from the accounting data, engage in elementary forecasting and modeling, master the theory of theTime Value of Money, and learn to price stocks and bonds in an environment in which interest rates constantly change. Ample problems and solutions, and review questions are provided to the student so that s/he can gauge his/her progress. This text will be continually updated in order to provide novel information and enhance students’ experiences.",
        "publisher": "Open Touro",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-financial-analysis"
    },
    {
        "title": "The Legal and Ethical Environment of Business",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Terence Lau, University of Dayton",
            "Lisa Johnson, University of Puget Sound"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDEsInB1ciI6ImJsb2JfaWQifX0=--55bdd011c174045f2f481f3e96c7a11be6524cd9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781936126583.png",
        "description": "Terence Lau & Lisa Johnson'sThe Legal and Ethical Environment of Businessis a book for today's student, who expects learning to be comprised not only of substance, but also of interactive exercises and multimedia. This book streamlines the presentation of material to ensure that every page is relevant, engaging, and interesting to undergraduate business students, without losing the depth of coverage that they need to be successful in their academic journeys and in their professional careers. This is not Legal Environment of Business (LEB) ”light.“ Rather, this is LEB without risk of students' eyes glazing over in boredom or from lack of comprehension. This is LEB presented in an exciting way, where every page is interesting to students and relevant to real life.The authors recognize that the sheer volume of information to be covered in a LEB course makes it one of the more challenging courses for the business undergraduate. Not only do typical LEB texts read like the first year curriculum at law school, but also the LEB course is grounded in the humanities, which can make the subject even more demanding for students who are also taking statistics, economics, finance, and accounting.Each chapter contains not only substantive law, but also illustrative videos, interactive exercises for hands-on learning, and discussion questions for critical thought. Additionally, each chapter presents ”A Question of Ethics“ section, which contains real world ethical dilemmas relevant to the topic under study. These videos, exercises, discussion questions, and ethics sections all provide opportunities for students to apply concepts that they are learning in the context of relevant LEB topics that shape or restrain actual decision-makers' actions. It's real world practice in the safety of the classroom environment.Lau & Johnson's The Legal and Ethical Environment of Businessis a textbook that students will enjoy reading. This will encourage them to come to class prepared, and free you to teach the kind of course you want to teach. Request a desk copy and see for yourself.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781936126583",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-legal-and-ethical-environment-of-business"
    },
    {
        "title": "Sustainability, Innovation, and Entrepreneurship",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Andrea Larson, University of Virginia"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzAsInB1ciI6ImJsb2JfaWQifX0=--ecb6ac16b80a31ac7e04e4ca02f647cf1ab82255/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453314128.png",
        "description": "This book is suited for the Entrepreneurship or Innovation course with an emphasis on Sustainability or for a course devoted entirely to Sustainability.What are the trends and forces underlying the changing character of the business-environment relationship? How they are creating significant entrepreneurial opportunities for individuals and companies? Around the world, the movement toward ”sustainable development“ has caused many firms to adopt policies and practices that reflect what is sometimes called a ”sustainable business“ or ”triple bottom line“ approach. ”Triple bottom line“ refers to the demonstration of strong performance across economic, social, and environmental indicators.Those measures serve as indicators of fiduciary responsibility to a growing set of concerned investors and therefore can help ensure access to capital. They also enable innovators to lower costs, create strategic differentiation, reduce risk, and position themselves for competitive advantage over rivals less attuned to trends.The deep roots of sustainability thinking are now evident in widespread and increasingly visible activities worldwide, and Sustainability, Innovation, and Entrepreneurship explores this evolution; its necessity, its implications and its progression.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453314128",
        "source": "https://open.umn.edu/opentextbooks/textbooks/sustainability-innovation-and-entrepreneurship"
    },
    {
        "title": "Technical Project Management in Living and Geometric Order - Third Edition",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Jeffrey Russell, University of Wisconsin-Madison",
            "Wayne Pferdehirt, University of Wisconsin-Madison",
            "John Nelson, University of Wisconsin-Madison",
            "Brian Price, Aston University"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk1MiwicHVyIjoiYmxvYl9pZCJ9fQ==--1718b7355c7a0ca4ee3753e7649790024419cf80/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/TPM-cover-third-edition-683x1024.png",
        "description": "The Technical Project Management class is designed to help students build on their past experiences and develop effective strategies for managing complex technical projects, with an emphasis on applying project management concepts to real-world problems. In the weekly web conferences, the class comes together in community to discuss the lesson topics, considering the practical applications of the concepts in each subject area.",
        "publisher": "University of Wisconsin - Madison",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/technical-project-management-in-living-and-geometric-order"
    },
    {
        "title": "Foundations in Digital Marketing",
        "copyright_year": "2023",
        "last_update": "2024",
        "authors": [
            "Rochelle Grayson, Langara College"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMTEsInB1ciI6ImJsb2JfaWQifX0=--c9dad625cbfa05a975655d1bbbf25680976afea2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/small_cover_textbook_404_94666f29a8.jpg",
        "description": "Foundations in Digital Marketing is a textbook intended to introduce marketing students to the world of digital marketing. The book covers fundamental frameworks, practical applications, and online tools that can all be applied to build and execute a cohesive and engaging digital marketing strategy. The book covers the fundamental aspects of digital marketing, including areas such as:visual storytelling,design principles and frameworks,search engine optimization and marketing,website and landing page optimization,content marketing,content creation tools and technologies,paid advertising,social media marketing,mobile marketing,email marketing,attribution,conversion rate optimization,data and marketing analytics, andthe future of digital marketing.The book also features chapter learning objectives, videos, summaries, interactive learning activities, and discussion points, as well as recommended industry certifications and online resources to augment the textbook.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/foundations-in-digital-marketing"
    },
    {
        "title": "Customer Centric Strategy",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Kerri Shields, Toronto, CA"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg2MSwicHVyIjoiYmxvYl9pZCJ9fQ==--12a65b176d119f4e75e1588a4b6b534d69fc760e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/cover3-350x389.jpeg",
        "description": "Customer centricity is about organizational transformation making the customer the focus for business decisions, processes, product development, services, and procedures. Some companies purport to be customer centric but they fall short in connecting this concept throughout all functional areas of the business.  While it is important to offer superb customer service, being customer centric is far more than that.  It's about mapping the customer journey to discover customer needs and wants, what's working and what is not, then taking action to improve the customer experience. Customer loyalty is built through providing exceptional customer experiences.  This in turn increases revenues through positive company image, referrals, and increased customer lifetime value. Most organizations today realize that they must focus on the customer to remain competitive.",
        "publisher": "eCampusOntario",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/customer-centric-strategy"
    },
    {
        "title": "Creating a circular healthcare economy: Sustainable strategies for a circular healthcare",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Bart van Straten, Delft University of Technology",
            "Letizia Alvino, University of Twente",
            "Tim Horeman, Delft University of Technology"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTg3NywicHVyIjoiYmxvYl9pZCJ9fQ==--6aa5d3c7b23df83fdeb85a76761511f4a239e9fd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_69_86_coverImage_en_US_t.png",
        "description": "Our world is the only planet, as far as we know, which harbors life. The number of humans on our planet has grown tremendously in recent centuries. In 1800 one billion humans occupied our earth; on 15 November 2022, this number reached 8 billion.A result of this growth, the emissions of carbon dioxide (CO2), the primary greenhouse gas emitted by human activities, drastically increased. The increased concentrations of greenhouse gases in our atmosphere foster the long-term increase of our earth’s temperatures, also referred to as global warming.While the earth’s population grew, so did our mass consumption society. After the Second World War humanity witnessed gigantic global economic development with great technological improvements. Computers, laptops, airplanes, tablets and Internet of Things connected humans all over the world. The hunger for plastics and steel grew as all products had to be manufactured in ever-increasing volumes. As the economy developed, our consumption grew apace.The healthcare sector has seen the same increase of consumption. The number of patients grew, and so did the number of single-use medical products. As products become more complex and more different materials were combined., recycling became more difficult. Thus, hospitals transformed into waste factories with ever-growing waste streams. The consumption of (disposable) medical devices takes up scarce raw materials and contributes to the growing CO2 emissions.In this book, Van Straten, Alvino and Horeman present their findings on how to create a sustainable healthcare economy by introducing different circular strategies. In 9 chapters, they present a wide variation of studies as practical cases to show what strategies and actions can be taken in order to implement sustainable strategies for a circular healthcare.This book was written in line with the courses the authors developed at TU Extension School, the open online education edX platform of Delft University of Technology/TU Delft, a leading university in science and technology, recognized for its world-class research. This book is a manual for everyone who follows the online course ‘Circular strategies for a sustainable healthcare’, but certainly also for everyone who wants to discover more about circular strategies and wants to understand the principles and practices of circular economy and urban mining. This book is suitable for students, researchers, policymakers and practitioners in the fields of healthcare sustainability, management, business and economics.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463667302",
        "source": "https://open.umn.edu/opentextbooks/textbooks/creating-a-circular-healthcare-economy-sustainable-strategies-for-a-circular-healthcare"
    },
    {
        "title": "Intermediate Financial Accounting Volume 2",
        "copyright_year": "2017",
        "last_update": "2021",
        "authors": [
            "Glenn Arnold, Athabasca University",
            "Suzanne Kyle"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE5NiwicHVyIjoiYmxvYl9pZCJ9fQ==--9e0e0008d817e4d1b830619bfcb1ceb6799802e3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/ArnoldKyle-IntermFinAcct-Vol2-2021A-Thumbnail.png",
        "description": "This new text by G. Arnold and S. Kyle, developed in collaboration by Athabasca University and Lyryx, is intended for the second of two in Intermediate Financial Accounting courses. It presumes that students have already completed the Introductory Financial Accounting, and the first Intermediate Financing Accounting course. The text reflects both current International Financial Reporting Standards (IFRS) and ASPE.This text covers all topics essential to a second level Intermediate Accounting course: current, long-term and complex liabilities, income taxes, pensions, leases, shareholders' equity, earnings per share, statement of cash flows including the direct approach, effects of changes and errors, and disclosures and analysis.Topics that are covered in Advanced Financial Accounting courses, such as consolidations and foreign exchange, are not included here.",
        "publisher": "Lyryx",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/intermediate-financial-accounting-volume-2"
    },
    {
        "title": "Business Plan Development Guide",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Lee Swanson, University of Saskatchewan"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDIzLCJwdXIiOiJibG9iX2lkIn19--b0e41653d32718bf18de224d0d348526fa274696/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000BusPlaDev.png",
        "description": "This textbook and its accompanying spreadsheet templates were designed with and for students wanting a practical and easy-to-follow guide for developing a business plan. It follows a unique format that both explains what to do and demonstrates how to do it.",
        "publisher": "OPENPRESS.USASK.CA",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-plan-development-guide"
    },
    {
        "title": "The Fundamentals of Healthcare Administration: Navigating Challenges and Coordinating Care",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Whitney N. Hamilton, Macon, GA",
            "Dorothy J. Howell, Macon, GA",
            "Melissa Jordan, Macon, GA"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk0NiwicHVyIjoiYmxvYl9pZCJ9fQ==--e48a195c24f66478fee96ea685f164e8b6e97dff/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/fundamentals-of-healthcare-admin-cover.jpeg",
        "description": "This book is written for those interested in acquiring a thorough knowledge base relative to the intricacies of the organizational theories, customs, and insights significant to the management of health service organizations. It examines the foundational aspects of leadership and management as they relate to establishing and maintaining the principles and practices within healthcare organizations. The book opens with a discussion on the differences between health, healthcare, and health care while providing an overview of healthcare management and organizational trends. It culminates in discussions of leadership, management, motivation, organizational behavior, and management thinking. Additionally, it discusses topics of information technology, teamwork, health disparities, organizational culture, performance, and change.",
        "publisher": "University of North Georgia Press",
        "language": "English",
        "isbn13": "9781940771885",
        "source": "https://open.umn.edu/opentextbooks/textbooks/the-fundamentals-of-healthcare-administration-navigating-challenges-and-coordinating-care"
    },
    {
        "title": "Introduction to Contracts, Sales and Product Liability",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George J. Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School"
        ],
        "subjects": [
            "Business"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "This textbook provides context and essential concepts across the entire range of legal issues with whichmanagers and business executives must grapple. The text provides the vocabulary and legal acumennecessary for businesspeople to talk in an educated way to their customers, employees, suppliers,government officials—and to their own lawyers.Traditional publishers often create confusion among customers in the text selection process by offering ahuge array of publications. Once a text is selected, customers might still have to customize the text to meettheir needs. For example, publishers usually offer books that include either case summaries or excerptedcases, but some instructors prefer to combine case summaries with a few excerpted cases so that studentscan experience reading original material. Likewise, the manner in which most conventional textsincorporate video is cumbersome because the videos are contained in a separate library, which makesaccess more complicating for instructors and students.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343265",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-contracts-sales-and-product-liability"
    },
    {
        "title": "Customer Insights - Second Edition",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Aila Khan, Western Sydney University",
            "Mohammad Munir Hossain, Western Sydney University",
            "Sabreena Zoha Amin, Western Sydney University"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE3MTcsInB1ciI6ImJsb2JfaWQifX0=--07d37e924b286491d7332f40a310a6df24867cec/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Customer-Insights-Cover-Final-Version-768x1024.png",
        "description": "Increasingly, the concept of marketing research is being replaced with the term ‘customer or consumer insights’. As decision-makers are bombarded with data, it is important to have an Insights Team or Department which can sift through it all and identify those nuggets of information that can meaningfully explain human behaviour. Such insights must translate into an informed business strategy for success. This book has been curated to ensure that the practice of data collection, analysis, and interpretation is presented from an industry perspective.",
        "publisher": "Western Sydney University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/customer-insights"
    },
    {
        "title": "Personal Finance",
        "copyright_year": "2009",
        "last_update": null,
        "authors": [
            "Rachel Siegel, Lyndon State University",
            "Carol Yacht, University of South Florida Sarasota-Manatee"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjMsInB1ciI6ImJsb2JfaWQifX0=--3fea903cda74744e902bf007eabdf0943c1dabc0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780982361863.png",
        "description": "Personal Financeby Rachel Siegel and Carol Yacht is a comprehensive Personal Finance text which includes a wide range of pedagogical aids to keep students engaged and instructors on track.This book is arranged by learning objectives. The headings, summaries, reviews, and problems all link together via the learning objectives. This helps instructors to teach what they want, and to assign the problems that correspond to the learning objectives covered in class.Personal Financeincludes personal finance planning problems with links to solutions, and personal application exercises, with links to their associated worksheet(s) or spreadsheet(s). In addition, the text boasts a large number of links to videos, podcasts, experts' tips or blogs, and magazine articles to illustrate the practical applications for concepts covered in the text.Rachel would love to hear from you. If you have questions about teaching with her book, comments about teaching Personal Finance, or just feedback, feel free to email her at rachelsiegelcfa@hughes.net.This textbook has been used in classes at:Miami University.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9780982361863",
        "source": "https://open.umn.edu/opentextbooks/textbooks/personal-finance"
    },
    {
        "title": "Principles of Managerial Accounting",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Christine Jonick, Dahlonega, GA"
        ],
        "subjects": [
            "Business",
            "Accounting"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk1MSwicHVyIjoiYmxvYl9pZCJ9fQ==--95255503a2a82573823d8ad03666c37bd3f78321/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/managerial-acct.jpeg",
        "description": "The University of North Georgia Press and Affordable Learning Georgia bring youPrinciples of Managerial Accounting. Well-written and straightforward,Principles of Managerial Accountingis a needed contribution to open source pedagogy in the business education world. Written in order to directly meet the needs of her students, this textbook developed from Dr. Jonick’s years of teaching and commitment to effective pedagogy.Features:Peer reviewed by academic professionals and tested by studentsOver 100 charts and graphsInstructional exercises appearing both in-text and for ExcelResources for student professional developmentThis textbook is an Open Education Resource. It can be reused, remixed, and reedited freely without seeking permission.",
        "publisher": "University of North Georgia Press",
        "language": "English",
        "isbn13": "9781940771458",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-fo-managerial-accounting"
    },
    {
        "title": "A Primer on Sustainable Business",
        "copyright_year": "2012",
        "last_update": "2020",
        "authors": [],
        "subjects": [
            "Business",
            "Finance",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjIyLCJwdXIiOiJibG9iX2lkIn19--a9c69b91d7af552e5e85c34e0c9dc87c7e611f65/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000PriSusBus.png",
        "description": "Going green, green business, and sustainable business are topics on everyone’s mind. But what does all this mean exactly? A Primer on Sustainable Business answers that question and provides an introduction to the basics you need to know.",
        "publisher": "LibreTexts",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/a-primer-on-sustainable-business"
    },
    {
        "title": "Principles of Management",
        "copyright_year": "2015",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjAxMCwicHVyIjoiYmxvYl9pZCJ9fQ==--cc3412ce9f6eca13111d68bafb1574f87f8596bd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Principles-of-Management-683x1024.jpg",
        "description": "Principles of Managementteaches management principles to tomorrow's business leaders by weaving three threads through every chapter: strategy, entrepreneurship and active leadership.Strategic — All business school teachings have some orientation toward performance and strategy and are concerned with making choices that lead to high performance.Principles of Managementwill frame performance using the notion of the triple bottom-line — the idea that economic performance allows individuals and organizations to perform positively in social and environmental ways as well. The triple bottom line is financial, social, and environmental performance. It is important for all students to understand the interdependence of these three facets of organizational performance.The Entrepreneurial Manager — While the 'General Management' course at Harvard Business School was historically one of its most popular and impactful courses (pioneered in the 1960s by Joe Bower), recent Harvard MBAs did not see themselves as 'general managers.' This course was relabeled 'The Entrepreneurial Manager' in 2006, and has regained its title as one of the most popular courses. This reflects and underlying and growing trend that students, including the undergraduates this book targets, can see themselves as entrepreneurs and active change agents, but not just as managers.By starting fresh with an entrepreneurial/change management orientation, this text provides an exciting perspective on the art of management that students can relate to. At the same time, this perspective is as relevant to existing for-profit organizations (in the form intrapreneurship) as it is to not-for-profits and new entrepreneurial ventures.Active Leadership — Starting with the opening chapter,Principles of Managementshows students how leaders and leadership are essential to personal and organizational effectiveness and effective organizational change. Students are increasingly active as leaders at an early age, and are sometimes painfully aware of the leadership failings they see in public and private organizations. It is the leader and leadership that combine the principles of management (the artist's palette, tools, and techniques) to create the art of management.This book's modular format easily maps to a POLC (Planning, Organizing, Leading, and Controlling) course organization, which was created by Henri Fayol (General and industrial management (1949). London: Pitman Publishing company), and suits the needs of both undergraduate and graduate course in Principles of Management.This textbook has been used in classes at: College of Alameda, Columbia Basin College, Flagler College, Johnson County Community College, Pasadena City College, Penn State University, Renton Technical College, San Diego Mesa College, Sierra College, Yuba College.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135186",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-management"
    },
    {
        "title": "Guidelines for Improving the Effectiveness of Boards of Directors of Nonprofit Organizations",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Yvonne Harrison, University at Albany",
            "Vic Murray, University of Victoria"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTY1LCJwdXIiOiJibG9iX2lkIn19--d9c6760a469eef6c92a2a67ba33f2652f415cfa9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781942341000.png",
        "description": "The purpose of this book is to help boards of directors of nonprofit organizations improve their performance after completing the online board self-assessment tool found at www.boardcheckup.com. However, it can also be used as a stand-alone resource for any board seeking to enhance its effectiveness in that it also contains the diagnostic questions on which the online tool is based.The approach taken here is similar to that which lies behind health checkups for individuals. Doctors usually begin by asking us to review a lengthy list of many possible health issues and we check those about which we have concerns. The doctor and patient then focus their discussions on these issues. The typical process proceeds through the following three stages:Understanding the symptoms.The doctor and patient begin by trying to define the issues more clearly.Diagnosis. Effort is made to understand the causes of the problems through tests and further examination.Treatment. Once the problem has been properly diagnosed, a treatment program to remedy it is begun.While the Board Check-Up survey on which this book is based does not pretend to be as scientifically rigorous as a medical examination, it is based on the same logic. It begins by having those who belong to, or relate to, boards provide their perceptions of how well the board is working by guiding them through a list of potential 'health issues”, i.e. statements of possible problems, issues or challenges that boards might encounter in their work. These statements have been derived from comments made by those who serve on boards or interact with them as well as from the work of researchers and consultants who have studied boards over the past 30 years. Once issues (symptoms) have been identified, they become the focal point for discussions that explore how serious they are, what might be causing them (diagnosis) and what can be done to resolve them (treatment).As noted above, this book is intended to help boards assess performance and make decisions to improve the effectiveness of the governance process. Each chapter deals with one of the nine dimensions of governance effectiveness. It starts with the items dealing with that dimension on the Board Performance Self-Assessment Questionnaire. These items represent the symptoms that indicate possible issues, problems or challenges faced by the board. This is followed by a discussion of possible reasons that such symptoms might exist (diagnosis) The third part of each chapter looks at what might be done to alleviate the symptoms once a diagnosis is made (treatment). Included in this final part of the chapter are references to websites, books and articles that provide additional advice and assistance on how to deal with the issues raised.",
        "publisher": "Open SUNY",
        "language": "English",
        "isbn13": "9781942341000",
        "source": "https://open.umn.edu/opentextbooks/textbooks/guidelines-for-improving-the-effectiveness-of-boards-of-directors-of-nonprofit-organizations"
    },
    {
        "title": "Introducing Marketing",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "John Burnett"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzIyLCJwdXIiOiJibG9iX2lkIn19--b3a9f90fa7bb0b4ba96870f7122c4851587efd23/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000IntrMarke.png",
        "description": "Through good economic times and bad, marketing remains the pivotal function in any business. Determining and satisfying the needs of customers through products that have value and accessibility and whose features are clearly communicated is the general purpose of any business. It is also a fundamental definition of marketing. This text introduces students to the marketing strategies and tools that practitioners use to market their products.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introducing-marketing"
    },
    {
        "title": "Business Ethics",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "OpenStax College"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTQ4LCJwdXIiOiJibG9iX2lkIn19--9618a65cd25c30be9718ab8ef49aa8f83d4b3642/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/9781947172579.PNG",
        "description": "Business Ethicsis designed to meet the scope and sequence requirements of the single-semester business ethics course. This title includes innovative features designed to enhance student learning, including case studies, application scenarios, and links to video interviews with executives, all of which help instill in students a sense of ethical awareness and responsibility.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781947172579",
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-ethics-2018"
    },
    {
        "title": "Principles of Accounting Volume 2 Managerial Accounting",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Contributing Authors"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjQ0LCJwdXIiOiJibG9iX2lkIn19--f31bcb0658e043e70956053bb324f8f8a39ef47c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781947172593.png",
        "description": "Principles of Accounting is designed to meet the scope and sequence requirements of a two-semester accounting course that covers the fundamentals of financial and managerial accounting. Due to the comprehensive nature of the material, we are offering the book in two volumes. This book is specifically designed to appeal to both accounting and non-accounting majors, exposing students to the core concepts of accounting in familiar ways to build a strong foundation that can be applied across business fields. Each chapter opens with a relatable real-life scenario for today’s college student. Thoughtfully designed examples are presented throughout each chapter, allowing students to build on emerging accounting knowledge. Concepts are further reinforced through applicable connections to more detailed business processes. Students are immersed in the “why” as well as the “how” aspects of accounting in order to reinforce concepts and promote comprehension over rote memorization.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781947172593",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-accounting-volume-2-managerial-accounting"
    },
    {
        "title": "Entrepreneurship and Innovation Toolkit",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Lee Swanson, University of Saskatchewan"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDIxLCJwdXIiOiJibG9iX2lkIn19--e65dbbdfc24aed4396b12b31e817d7c245b7039e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000EntInnToo.png",
        "description": "This book is designed for upper year undergraduate students and graduate students studying fundamental entrepreneurship concepts.",
        "publisher": "OPENPRESS.USASK.CA",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/entrepreneurship-and-innovation-toolkit"
    },
    {
        "title": "Organizational Behavior",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Human Resources"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk3NSwicHVyIjoiYmxvYl9pZCJ9fQ==--f6487ea274213a492baffd656fb5eb807fcf712e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Organizational-Behavior-683x1024.jpg",
        "description": "Organizational Behaviorbridges the gap between theory and practice with a distinct 'experiential' approach.On average, a worker in the USA will change jobs 10 times in 20 years. In order to succeed in this type of career situation, individuals need to be armed with the tools necessary to be life-long learners. To that end, this book is not be about giving students all the answers to every situation they may encounter when they start their first job or as they continue up the career ladder. Instead, this book gives students the vocabulary, framework, and critical thinking skills necessary to diagnose situations, ask tough questions, evaluate the answers received, and to act in an effective and ethical manner regardless of situational characteristics.Often, students taking OB either do not understand how important knowledge of OB can be to their professional careers, or they DO understand and they want to put that knowledge into practice. Organizational Behavior takes a more experiential angle to the material to meet both of those needs. The experiential approach can be incorporated in the classroom primarily through the 'OB Toolbox.' This feature brings life to the concepts and allows students to not only see how the OB theories unfold, but to practice them, as well.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135155",
        "source": "https://open.umn.edu/opentextbooks/textbooks/organizational-behavior"
    },
    {
        "title": "Introduction to Financial Accounting",
        "copyright_year": "2017",
        "last_update": "2021",
        "authors": [
            "David Annand, Athabasca University",
            "Henry Dauderis"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE5NSwicHVyIjoiYmxvYl9pZCJ9fQ==--aeb669cc1b90e38aa98ce95d0209532a2fca9be9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/DauderisAnnand-IntroFinAcct-2021A-Thumbnail.png",
        "description": "This textbook is an adaptation by Athabasca University of the original text written by D. Annand and H. Dauderis. It is intended for use in entry-level college and university courses in financial accounting. A corporate approach is utilized consistently throughout the book.The adapted textbook includes multiple ancillary student and instructor resources. Student aids include solutions to all end-of-chapter questions and problems, and randomly-generated spreadsheet problems that cover key concepts of each chapter. These provide unlimited practice and feedback for students. Instructor aids include an exam bank, lecture slides, and a comprehensive end-of-term case assignment. This requires students to prepare 18 different year-end adjusting entries and all four types of financial statements, and to calculate and analyze 16 different financial statement ratios. Unique versions can be created for any number of individual students or groups. Tailored solutions are provided for instructors.The original Annand/Dauderis version of the textbook including .docx files and ancillary material remains available upon request to D. Annand (davida@athabascau.ca).",
        "publisher": "Lyryx",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-financial-accounting"
    },
    {
        "title": "Introduction to Speech Communication",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Sarah E. Hollingsworth, Oklahoma State University",
            "Megan Linsenmeyer, Oklahoma State University",
            "Terrisa Elwood, Oklahoma State University",
            "Sasha Hanrahan, Oklahoma State University",
            "Mary Walker, Oklahoma State University",
            "Kathryn Weinland, Oklahoma State University"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI1NzgsInB1ciI6ImJsb2JfaWQifX0=--cec08780ea3f7ae116b0a7532b1bb285c12d670c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Intro%20to%20Speech%20cover.JPG",
        "description": "Introduction to Speech Communication is used to support teaching, learning and research for SPCH 2713 at Oklahoma State University (OSU). In addition to inclusion of original work authored by the editors to meet the needs of their course at OSU, the editors adapted portions of Exploring Public Speaking: 4th Edition,  Stand Up, Speak Out, and Fundamentals of Public Speaking. Please see the Acknowledgements chapter for full citations. We at Oklahoma State University Libraries acknowledge our gratitude for the expertise and generosity of the scholars at Affordable Learning Georgia, College of the Canyons, the Open Education Network and elsewhere for creating and sharing customizable versions of their work. This book also includes an audio version funded by Women for OSU, as well as updated images enabled by a grant from the Oklahoma State Regents for Higher Education.",
        "publisher": "Oklahoma State University",
        "language": "English",
        "isbn13": "9781957983059",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-speech-communication"
    },
    {
        "title": "Contract Doctrine, Theory & Practice Volume 2",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "J.H. Verkerke, University of Virginia"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODMsInB1ciI6ImJsb2JfaWQifX0=--23660a7e14560d2b73fbbb50b150183751912a30/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ConDocVo2.png",
        "description": "This is Volume 2 in a three volume series written for Contracts Law. Its orginal title was 'Collaborative Teaching Materials for Contracts.'The first semester of law school is mostly about learning to speak a new legal language (but emphatically not “legalese”), to formulate and evaluate legal arguments, to become comfortable with the distinctive style of legal analysis. We could teach these skills using almost any legal topic. But we begin the first-year curriculum with subjects that pervade the entire field of law. Contract principles have a long history and they form a significant part of the way that lawyers think about many legal problems. As you will discover when you study insurance law, employment law, family law, and dozens of other practice areas, your knowledge of contract doctrine and theory will be invaluable.",
        "publisher": "CALI's eLangdell® Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/contract-doctrine-theory-practice-volume-2"
    },
    {
        "title": "Leading Innovation",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Kerri Shields, Toronto, CCA"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg1OCwicHVyIjoiYmxvYl9pZCJ9fQ==--0888f51cbefe55648932843ed07125377f9e5146/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/cover8-768x845.jpeg",
        "description": "Innovation today considers the economic, environmental, and/or social sustainability of an innovative initiative from its inception or idea generation through to its commercialization or implementation. This concept applies to many types of innovation such as products, processes, services, technologies, and business models. Companies use innovation as a means to gain a competitive advantage and bring value to business stakeholders.  This book introduces business innovation, from incremental innovation such as enhancing the performance of an existing product, service, or process, to radical or disruptive innovation such as one that has a significant impact on a market. The content examines how leaders foster a culture of innovation, how companies turn creativity into innovation, and how innovation transforms not only organizations but economies as well.",
        "publisher": "eCampusOntario",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/leading-innovation"
    },
    {
        "title": "Legal Aspects of Corporate Management and Finance",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George J. Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp",
        "description": "Legal Aspects of Corporate Management and Financeis an up-to-date textbook that covers key legal issues relating to corporate management and finance. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Legal Aspects of Corporate Management and Financeprovides students with context and essential legal concepts relating to contracts, agency law, partnerships, corporations, commercial paper, debtors and creditors. The text provides the vocabulary and legal savvy students will need to talk in an educated way to customers, suppliers, employees, creditors, shareholders, government regulators and other stakeholders — and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343258",
        "source": "https://open.umn.edu/opentextbooks/textbooks/legal-aspects-of-corporate-management-and-finance"
    },
    {
        "title": "Design Roadmapping: Guidebook for Future Foresight Techniques",
        "copyright_year": "2024",
        "last_update": null,
        "authors": [
            "Lianne Simonse, Delft University of Technology"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE5MzIsInB1ciI6ImJsb2JfaWQifX0=--a769581d193efc00c3d71ee7f0383846c6448d49/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/drm.jpg",
        "description": "DESIGN ROADMAPPING is for anyone interested in design, strategy and innovation, and its wonderful combinations. For those who dare to create a future vision, frame the time pacing and map the pathways towards it.This guidebook teaches you how to create a roadmap. It outlines the origins, design theories and science results. Strategic designers, innovation managers and professors share their roadmapping experiences, views and achievements, including venture CPOs, Head of Design, product and program managers of international companies such as Canon, Peerby, Ferrari, Philips, Victoria State Library and many more.By design roadmapping you devise creative responses to future strategic challenges. Guided by future foresight techniques, you uncover new trends, scout for new technologies and map the values and ideas on the roadmap. Through strong visualization, a design roadmap supports an organizational mindset on value innovations.",
        "publisher": "TU Delft Open",
        "language": "English",
        "isbn13": "9789463667968",
        "source": "https://open.umn.edu/opentextbooks/textbooks/design-roadmapping-guidebook-for-future-foresight-techniques"
    },
    {
        "title": "Mastering Strategic Management",
        "copyright_year": "2015",
        "last_update": "2024",
        "authors": [],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEwMjAsInB1ciI6ImJsb2JfaWQifX0=--8abba50dec13b2aecf76afd8f7861e808b81d8b7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Mastering-Strategic-Management-350x525.jpg",
        "description": "Teaching the strategic management course can be a challenge for many professors. In most business schools, strategic management is a “capstone” course that requires students to draw on insights from various functional courses they have completed (such as marketing, finance, and accounting) in order to understand how top executives make the strategic decisions that drive whether organizations succeed or fail. Although students have taken these functional courses, many students have very little experience with major organizational choices. It is this inexperience that can undermine many students’ engagement in the course. For questions about this textbook please contact textbookuse@umn.edu",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/mastering-strategic-management-2015"
    },
    {
        "title": "Business Law, Ethics, and Sustainability",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Andrew J Hosmanek, University of Iowa",
            "Brendan Smith, Birmingham, Alabama",
            "Michael J Dayton, Des Moines, Iowa"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDY4OCwicHVyIjoiYmxvYl9pZCJ9fQ==--04302f9e20e420fba8998b5e01f2032b1f66d870/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9984376757702771.jpeg",
        "description": "Business Law, Ethics, and Sustainability is a textbook for undergraduate law courses. It covers business law topics such as contracts, business organizations, employment law, and torts, as well as a general survey of American law. Additional topics include Constitutional law, civil rights, environmental law, criminal law, and litigation.",
        "publisher": "OpenHawks OER",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-law-ethics-and-sustainability"
    },
    {
        "title": "Accounting Principles: A Business Perspective",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Roger H. Hermanson, Georgia State University",
            "James D. Edwards, University of Georgia",
            "Michael W. Maher, University of California at Davis"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzE4LCJwdXIiOiJibG9iX2lkIn19--8a5499d02d429d732ece11da464b0328136d7bf6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000AcctPrinc.png",
        "description": "Accounting Principles: A Business Perspectiveuses annual reports of real companies to illustrate many of the accounting concepts in use in business today. Gaining an understanding of accounting terminology and concepts, however, is not enough to ensure your success. You also need to be able to find information on the Internet, analyze various business situations, work effectively as a member of a team, and communicate your ideas clearly. This text was developed to help you develop these skills.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/accounting-principles-a-business-perspective"
    },
    {
        "title": "Introduction to Intellectual Property",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "David Kline",
            "David Kappos"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDUzNywicHVyIjoiYmxvYl9pZCJ9fQ==--517484b6e9b901a7b77fbcc4cc6f7e983f2fbcc5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-02-13%20at%2012.08.50%20PM.png",
        "description": "Introduction to Intellectual Propertyprovides a clear, effective introduction to patents, copyright, trademarks, and trade secrets. The text may be used by students and instructors in formal courses, as well as those applying intellectual property considerations to entrepreneurship, marketing, law, computer science, engineering, design, or other fields. The luminaries involved with this project represent the forefront of knowledge and experience, and the material offers considerable examples and scenarios, as well as exercises and references.Introduction to Intellectual Propertywas originally developed by the Michelson 20MM Foundation, released under the titleThe Intangible Advantage.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781951693350",
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-intellectual-property"
    },
    {
        "title": "Intermediate Microeconomics with Microsoft Excel - 2nd Edition",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Humberto Barreto, DePauw University"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTg4NywicHVyIjoiYmxvYl9pZCJ9fQ==--7e5c799089ac0eee80505114babb8acdc2310608/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/macrossss.png",
        "description": "This book is based on the idea that there is a particular framework used by economists to interpret observed reality. This framework has been called the economic way of thinking, the economic approach, and the method of economics.This book is different from the many other books that attempt to teach microeconomics in three ways:It explicitly applies the recipe of the economic approach in every example.It uses concrete examples via Microsoft Excel in every application, which enables the reader to manipulate live graphs and learn numerical methods of optimization.The majority of the content is in the Excel workbooks which the reader uses to create meaning.You learn by doing, not by reading.",
        "publisher": "Humberto Barreto",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/intermediate-microeconomicswith-microsoft-excel-2nd-edition-barreto"
    },
    {
        "title": "Introduction to Financial Accounting: U.S. GAAP Adaptation",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "David Annand, Athabasca University",
            "Donna Marchand, Emmanuel College",
            "Henry Dauderis"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjIwMiwicHVyIjoiYmxvYl9pZCJ9fQ==--19cc29b232aad141eae7e741ef0a68cb13e579fa/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/DauderisAnnandMarchand-IntroFA-USGAAP-2021A-Thumbnail.png",
        "description": "This textbook is an adaptation by D. Marchand and Athabasca University of the original text written by D. Annand and H. Dauderis. It is intended for use in entry-level college and university courses in financial accounting. A corporate approach is utilized consistently throughout the book.The adapted textbook includes multiple ancillary student and instructor resources. Student aids include solutions to all end-of-chapter questions and problems, and randomly-generated spreadsheet problems that cover key concepts of each chapter. These provide unlimited practice and feedback for students. Instructor aids include an exam bank, lecture slides, and a comprehensive end-of-term case assignment. This requires students to prepare 18 different year-end adjusting entries and all four types of financial statements, and to calculate and analyze 16 different financial statement ratios. Unique versions can be created for any number of individual students or groups. Tailored solutions are provided for instructors.Another version of the textbook written by D. Annand and adapted by T. Thompson, including .docx files and ancillary material, can be obtained upon request to D. Annand (davida@athabascau.ca).",
        "publisher": "Lyryx",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introduction-to-financial-accounting-u-s-gaap-adaptation"
    },
    {
        "title": "Business Computers 365 Version 2.0 - Version 2.0",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Marcus Lacher, Minnesota State Community & Technical College"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTM2MSwicHVyIjoiYmxvYl9pZCJ9fQ==--ea5d3b19da40c7ceb699866954dd09715852ec97/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-18%20at%206.38.23%20PM.png",
        "description": "Intro to Computer Applications or Business Computers for Office 365",
        "publisher": "Opendora",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-computers-365-lacher"
    },
    {
        "title": "Corporate Governance",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "William Frey",
            "Jose a Cruz-Cruz"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTEyLCJwdXIiOiJibG9iX2lkIn19--4008b1591c14a60a3db15f259a44fd9dd111dc41/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000CorGovern.png",
        "description": "This course takes an interdisciplinary approach to ethics in business and provides modules in Ethical Leadership, Ethical Decision-Making, Social Responsibility, and Corporate Governance. Students will actively study ethical theory by carrying out exercises to help them build theory-based tools for encountering ethical problems in business practice. They will also work with cases in business ethics designed to give them practice in developing skills of ethical leadership, ethical decision-making, and carrying out socio-technical analyses to respond to issues of social responsibility. This course will culminate in an Ethics Bowl competition in which students will practice ethics advocacy in a variety of organizational contexts in business.",
        "publisher": "OpenStax CNX",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/corporate-governance-2014"
    },
    {
        "title": "Principles of Financial Accounting",
        "copyright_year": "2017",
        "last_update": null,
        "authors": [
            "Christine Jonick"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTc1LCJwdXIiOiJibG9iX2lkIn19--8fca2fbc3067e96a912ff9a6d4c9d153b2e4de27/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781940771151.jpg",
        "description": "The University of North Georgia Press and Affordable Learning Georgia bring youAccounting I. Well-written and straightforward,Principles of Financial Accountingis a needed contribution to open source pedagogy in the business education world. Written in order to directly meet the needs of her students, this textbook developed from Dr. Christine Jonick’s years of teaching and commitment to effective pedagogy.Features:Peer reviewed by academic professionals and tested by studentsOver 100 charts and graphsInstructional exercises appearing both in-text and for ExcelResources for student professional developmentThis textbook is an Open Education Resource. It can be reused, remixed, and reedited freely without seeking permission.",
        "publisher": "University of North Georgia Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-financial-accounting"
    },
    {
        "title": "Liquidity, Markets and Trading in Action",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Deniz Ozenbas , Montclair State University",
            "Michael S. Pagano, Villanova University",
            "Robert A. Schwartz , City University of New York",
            "Bruce W. Weber, University of Delaware"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk4MSwicHVyIjoiYmxvYl9pZCJ9fQ==--1544d8b817b882e41ab49cc310df13646208070b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9783030748173.jpg",
        "description": "This open access book addresses four standard business school subjects: microeconomics, macroeconomics, finance and information systems as they relate to trading, liquidity, and market structure. It provides a detailed examination of the impact of trading costs and other impediments of trading that the authors call “frictions”. It also presents an interactive simulation model of equity market trading, TraderEx, that enables students to implement trading decisions in different market scenarios and structures. Addressing these topics shines a bright light on how a real-world financial market operates, and the simulation provides students with an experiential learning opportunity that is informative and fun.Each of the chapters is designed so that it can be used as a stand-alone module in an existing economics, finance, or information science course. Instructor resources such as discussion questions, Powerpoint slides and TraderEx exercises are available online.",
        "publisher": "Springer",
        "language": "English",
        "isbn13": "9783030748173",
        "source": "https://open.umn.edu/opentextbooks/textbooks/liquidity-markets-and-trading-in-action"
    },
    {
        "title": "Advanced Macroeconomics: An Easy Guide",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Filipe Campante, Cambridge, MA",
            "Federico Sturzenegger, Buenos Aires, Argentina",
            "Andrés Velasco, London, England"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU4NiwicHVyIjoiYmxvYl9pZCJ9fQ==--bb00440987c49f8f305c9b6762370272279e4507/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/cover.png",
        "description": "Macroeconomic policy is one of the most important policy domains, and the tools of macroeconomics are among the most valuable for policy makers. Yet there has been, up to now, a wide gulf between the level at which macroeconomics is taught at the undergraduate level and the level at which it is practiced. At the same time, doctoral-level textbooks are usually not targeted at a policy audience, making advanced macroeconomics less accessible to current and aspiring practitioners.This book, born out of the Masters course the authors taught for many years at the Harvard Kennedy School, fills this gap. It introduces the tools of dynamic optimization in the context of economic growth, and then applies them to a wide range of policy questions – ranging from pensions, consumption, investment and finance, to the most recent developments in fiscal and monetary policy. It does so with the requisite rigor, but also with a light touch, and an unyielding focus on their application to policy-making, as befits the authors’ own practical experience.Advanced Macroeconomics: An Easy Guideis bound to become a great resource for graduate and advanced undergraduate students, and practitioners alike.",
        "publisher": "LSE Press",
        "language": "English",
        "isbn13": "9781909890695",
        "source": "https://open.umn.edu/opentextbooks/textbooks/advanced-macroeconomics-an-easy-guide"
    },
    {
        "title": "Crawford Automation – A Guided Application of Structured Problem Solving",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Stephen Thomson, Institute of Technology and Advanced Learning",
            "Kevin Hollis, Conestoga College",
            "Laurie Turnbull, Conestoga College"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzQ0NSwicHVyIjoiYmxvYl9pZCJ9fQ==--d17187b1c620322df7ad051245fae457c27ac9ea/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/crawford-case-cover-1-12-1-768x1024%20(1).png",
        "description": "This is a multimedia-enabled case in which students will be guided, by an industry expert, to apply structured problem-solving that addresses a typical supply chain problem, missing parts.  What first appears as the issue may be a symptom of a root cause(s). The case utilizes videos, data files for analytics, audio recording, and videogame-style exercises to find the missing box of parts.  The case is a collaboration between the Conestoga Centre for Supply Chain Innovation and ATS Automation and utilizes the ATS Business Model (ABM) approach to identifying and solving root causes. The case can be used in any Continuous Improvement course or program for either Business or Engineering students.",
        "publisher": "eCampusOntario",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/crawford-automation-a-guided-application-of-structured-problem-solving"
    },
    {
        "title": "Project Management from Simple to Complex",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk3NCwicHVyIjoiYmxvYl9pZCJ9fQ==--5cf899a696bd2bbd04d804239df7422cbd0b9146/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Project-Management-683x1024.jpg",
        "description": "In a world that is becoming more virtual, more global, and more complex, the project manager's ability to function in this environment becomes critical to the success of the project.Project Management from Simple to Complexexplores project management within this complex, virtual, and global environment.This is not a standard textbook that was adapted to the new publishing paradigm; it was designed from the beginning to utilize its capabilities. The book is written in collaboration by an expert in Project Management and an expert in writing instructional textbooks and using technology for communicating online to create a unique learning environment that prepares students to manage projects in a global, multicultural, and online environment.Project Management from Simple to Complexfeatures a new model for managing projects, as well as, exploration into the personal dynamics of project management and the role those dynamics play in project outcomes.",
        "publisher": "University of Minnesota Libraries Publishing",
        "language": "English",
        "isbn13": "9781946135216",
        "source": "https://open.umn.edu/opentextbooks/textbooks/project-management-from-simple-to-complex"
    },
    {
        "title": "eMarketing - The Essential Guide to Online Marketing",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTk5LCJwdXIiOiJibG9iX2lkIn19--8449ff06b7f56529c40d519c2935d6efca2783d3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000eMaEssMar.jpg",
        "description": "eMarketing: The Essential Guide to Online Marketing is a textbook intended for third and fourth year marketing students and draws on both academic theory and practical experience. The book offers students information that is applicable to the eMarket industry by providing examples that are easily relatable. The book covers all of the important aspects of online marketing, including the areas associated with search engine marketing, affiliate marketing, web analytics and conversion optimization, web development, online copywriting, online advertising, webPR, online reputation management, pay per click advertising, viral marketing, social media marketing, search engine optimization, eMarketing strategy, market research, mobile marketing, crowd sourcing, and customer relationship management. The book also features summaries, learning objectives and discussion points for each chapter, as well as, a glossary and index.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/emarketing-the-essential-guide-to-online-marketing"
    },
    {
        "title": "Contract Doctrine, Theory & Practice Volume 1",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "J.H. Verkerke, University of Virginia"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODQsInB1ciI6ImJsb2JfaWQifX0=--a2aa4e392cd92c11b6c9aed920873b4874b389b2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ConDocVo3.png",
        "description": "This is the first in a series of Contracts casebooks. It was originally titled 'Collaborative Teaching Materials for Contracts.'The first semester of law school is mostly about learning to speak a new legal language (but emphatically not “legalese”), to formulate and evaluate legal arguments, to become comfortable with the distinctive style of legal analysis. We could teach these skills using almost any legal topic. But we begin the first-year curriculum with subjects that pervade the entire field of law. Contract principles have a long history and they form a significant part of the way that lawyers think about many legal problems. As you will discover when you study insurance law, employment law, family law, and dozens of other practice areas, your knowledge of contract doctrine and theory will be invaluable.",
        "publisher": "CALI's eLangdell® Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/contract-doctrine-theory-practice-volume-1"
    },
    {
        "title": "Developing New Products and Services",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "G. Lawrence Sanders, State University of New York at Buffalo"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA4LCJwdXIiOiJibG9iX2lkIn19--7f5936c28b79237b3fb221b002632c57b13fdcd1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453343609.png",
        "description": "Developing New Products and Services by Sanders is an outstanding contribution to market research. The book focuses on the upfront activities and ideas for new product and service development.A central theme of Developing New Products and Services is that there is, or should be, a constant struggle going on in every organization, business, and system between delivering feature-rich versions of products and services using extravagant engineering and delivering low-cost versions of products and services using frugal engineering. Students will come away with this notion and how to manifest it as a contributing employee at any company.A number of powerful concepts and tools are presented so your students can better understand how to facilitate new product development. For example, three templates are featured that facilitate new product and service development. The FAD (features, attributes, and design) template is used to identify the features and attributes that can be used for product and service differentiation. The Ten–Ten planning process contains two templates: an Organizational and Industry Analysis template and the Business Plan Overview template. These two templates coupled with the FAD template can be used to develop a full-blown business plan.In addition, Developing New Products and Services includes the following topics: entrepreneurship, technology and product life cycles, product and service versioning, product line optimization, creativity, lock-in real options, business valuation, and project management.Evaluate Developing New Products and Services by Sanders for your marketing courses today.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343609",
        "source": "https://open.umn.edu/opentextbooks/textbooks/developing-new-products-and-services"
    },
    {
        "title": "Strategic Management",
        "copyright_year": "2020",
        "last_update": null,
        "authors": [
            "Kennedy B. Reed, Virginia Tech"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTg0NiwicHVyIjoiYmxvYl9pZCJ9fQ==--b64c112412b5a3c88789666c5e87b41563dfd202/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Front-Cover-online-version-350x464.png",
        "description": "STRATEGIC MANAGEMENToffers an introduction to the key topics and themes of strategic management. The authors draw on examples of familiar companies and personalities to illustrate the different strategies used by today’s firms—and how they go about implementing those strategies. Students will learn how to conduct a case analysis, measure organizational performance, and conduct external and internal analyses. In short, they will understand how organizations operate at the strategic level to be successful.An older version ofMastering Strategic Management(2015) by University of Minnesota Libraries Publishing can be found here: https://open.lib.umn.edu/strategicmanagement/",
        "publisher": "Virginia Tech Publishing",
        "language": "English",
        "isbn13": "9781949373950",
        "source": "https://open.umn.edu/opentextbooks/textbooks/mastering-strategic-management"
    },
    {
        "title": "Financial and Managerial Accounting",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Lolita Paff, Pennsylvania State University"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE2ODgsInB1ciI6ImJsb2JfaWQifX0=--91d05fb5fd14ee9bcfb62671cfbbd9ebd9f67c25/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/acctg211_4-350x525.png",
        "description": "Textbook prices for introductory accounting courses are typically very high and new editions are frequently introduced, limiting the resale value and use of older editions.  Simply put, a free, open-source textbook increases accessibility by eliminating the cost barrier.  Free is my favorite price! Second... Accounting textbooks also commonly seen as… BORING!This book is uniquely constructed to integrate reading, video tutorials, links and practice to make learning… dare I write it… FUN!  OK, maybe that’s overstating a bit, but this is not your typical accounting text.",
        "publisher": "Pennsylvania State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/financial-and-managerial-accounting"
    },
    {
        "title": "Principles of Accounting Volume 1 Financial Accounting",
        "copyright_year": "2019",
        "last_update": null,
        "authors": [
            "Contributing Authors"
        ],
        "subjects": [
            "Business",
            "Accounting"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjQzLCJwdXIiOiJibG9iX2lkIn19--92c874fb8126ac3885525aca6047cb3a9e476899/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781947172678.png",
        "description": "Principles of Accounting is designed to meet the scope and sequence requirements of a two-semester accounting course that covers the fundamentals of financial and managerial accounting. Due to the comprehensive nature of the material, we are offering the book in two volumes. This book is specifically designed to appeal to both accounting and non-accounting majors, exposing students to the core concepts of accounting in familiar ways to build a strong foundation that can be applied across business fields. Each chapter opens with a relatable real-life scenario for today’s college student. Thoughtfully designed examples are presented throughout each chapter, allowing students to build on emerging accounting knowledge. Concepts are further reinforced through applicable connections to more detailed business processes. Students are immersed in the “why” as well as the “how” aspects of accounting in order to reinforce concepts and promote comprehension over rote memorization.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781947172678",
        "source": "https://open.umn.edu/opentextbooks/textbooks/principles-of-accounting-volume-1-financial-accounting"
    },
    {
        "title": "Financial Strategy for Public Managers",
        "copyright_year": "2016",
        "last_update": null,
        "authors": [
            "Sharon Kioko, University of Washington",
            "Justin Marlowe, University of Washington"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Finance",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDI0LCJwdXIiOiJibG9iX2lkIn19--e0cab1e8567639160ad757239c285f527fd8613c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000FinStrPub.png",
        "description": "Financial Strategy for Public Managersis a new generation textbook for financial management in the public sector. It offers a thorough, applied, and concise introduction to the essential financial concepts and analytical tools that today's effective public servants need to know. It starts “at the beginning” and assumes no prior knowledge or experience in financial management. Throughout the text, Kioko and Marlowe emphasize how financial information can and should inform every aspect of public sector strategy, from routine procurement decisions to budget preparation to program design to major new policy initiatives. They draw upon dozens of real-world examples, cases, and applied problems to bring that relationship between information and strategy to life. Unlike other public financial management texts, the authors also integrate foundational principles across the government, non-profit, and “hybrid/for-benefit” sectors. Coverage includes basic principles of accounting and financial reporting, preparing and analyzing financial statements, cost analysis, and the process and politics of budget preparation. The text also includes several large case studies appropriate for class discussion and/or graded assignments.",
        "publisher": "Rebus Community",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/financial-strategy-for-public-managers"
    },
    {
        "title": "Building Strategy and Performance",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Kim Warren, London Business School"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA1LCJwdXIiOiJibG9iX2lkIn19--ccfef4149f338dcd4bca0ffee6dbc1f2bd8c6a6c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453332917.png",
        "description": "This book uses a balanced blend of frameworks and illustrations to teach you how to tackle the challenge of driving performance into the future.Kim Warren takes special care with this new textbook,Building Strategy and Performance, to ensure that it delivers instruction on how to deliver strategy powerfully over a sustained period of time.This book helps you to show your students where the levers are that they can control and how to choose what to do, when, and how much to achieve their specific goals.This book effectively outlines the dynamics of strategy, how one drives performance - past, today and into the future. It shows what causes performance to improve or deteriorate and what your students can do to change this trajectory for the better.But don't take our word for it, review the book now to see if it can help you to deliver the kind of tactical strategy course you desire for your students.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453332917",
        "source": "https://open.umn.edu/opentextbooks/textbooks/building-strategy-and-performance"
    },
    {
        "title": "Workplace Software and Skills",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Tammie Bolling, Pellissippi State Community College",
            "Angela Mitchell, Wilmington College",
            "Tanya Scott, Southern New Hampshire University/University of Arizona Global Campus",
            "Nyrobi Wheeler, Bellevue University",
            "Bridget Lepore, Lehman College",
            "Janine Walton, Louisiana State University Shreveport",
            "Timothy Burgoyne, Wilmington College",
            "Rick Arguello, Independent researcher",
            "Valeree Falduto, Broward College"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA1NzksInB1ciI6ImJsb2JfaWQifX0=--0886669c26b003fbbec20a641e7896c23f0cfec2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/openstax.jpg",
        "description": "Workplace Software and Skillsis designed to flexibly support a range of courses covering computer literacy, Microsoft Office, and Google Suite applications. The textbook covers both hard and soft skills that are applicable to a broad range of academic majors and careers. Chapters combine studio learning and guided practice with scaffolded activities designed to reinforce a student’s ability to perform higher-order tasks independently.Workplace Software and Skillsleverages complementary product features in spreadsheet, word processing, presentation, and similar applications. Modules are designed for maximum flexibility by including both Microsoft Office Suite and Google Suite applications, in order to best reflect the skills needed for today’s workforce. Authentic activities and real-world contexts develop a cumulative and thorough understanding, which reinforces the importance of cross-platform proficiency. Highly visible features also note Apple/Mac functions as needed.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "9781961585310",
        "source": "https://open.umn.edu/opentextbooks/textbooks/workplace-software-and-skills"
    },
    {
        "title": "Business English for Success",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Scott McLean, Arizona Western College"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTEsInB1ciI6ImJsb2JfaWQifX0=--56d2604ca26f87f3bec765e074a017863576b575/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453320181.png",
        "description": "Business English for Successis a creative solution to a common challenge across Business Communication courses: Business English or Business Presentations? Some classes place an equal emphasis on oral and written communication. If that's the case for you check out our text Business Communication for Success. If, however, your class places the emphasis squarely on written communication and writing proficiency, then Business English for Success is for you.Business English for Successprovides instruction in steps, builds writing, reading, and critical thinking, and combines comprehensive grammar review with an introduction to paragraph writing and composition. This step-by-step approach provides a clear path to student-centered learning. A wide range of writing levels and abilities are addressed, helping each student prepare for the next writing or university course.The text opens with a discussion on the sentence and then breaks it down into its elemental components, before reconstructing them into effective sentences, paragraphs, and larger assignments. Then, starting in Chapter 9: Effective Business Writing, the discussion applies lessons learned from the previous foundational chapters into common business issues and applications. From paraphrasing and plagiarism to style to the research process, the expectations increase as several common business documents are presented, including text messages and e-mail, memorandums and letters, the business proposal, business report, resume, and the sales message.This textbook has been used in classes at:Arizona Western College, Hostos Community College, Virginia State University, Truckee Meadows Community College, San Jose State University, Concordia University - Irvine, University New Brunswick - Fredericton, Cerritos College, University of Houston - Downtown, Flat World Knowledge University, A-C Central High School, University of The People, Truckee Meadows Community College, Danville Community High School",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453320181",
        "source": "https://open.umn.edu/opentextbooks/textbooks/business-english-for-success"
    },
    {
        "title": "Advanced Business Law and the Legal Environment",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Don Mayer, University of Denver",
            "Daniel Warner, Western Washington University",
            "George J. Siedel, University of Michigan",
            "Jethro K. Lieberman, New York Law School",
            "Alyssa Rose Martina, Metro Parent Publishing Group"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA0LCJwdXIiOiJibG9iX2lkIn19--03a0ed03e7578dcd9ca9f6249a65a7559229ce74/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000AdvanBusi.png",
        "description": "Mayer, Warner, Siedel and Lieberman's Advanced Business Law and the Legal Environment is an up-to-date textbook with coverage of legal and regulatory issues that are more technical than the topics in the authors' Foundations of Business Law and the Legal Environment.Appropriate for students who have already taken an introductory Legal Environment or Business Law course, the text is organized to permit instructors to tailor the materials to their particular approach.The authors take special care to engage students by relating law to everyday events with which they are already familiar with their clear, concise and readable style.Advanced Business Law and the Legal Environmentprovides students with context and essential legal concepts relating to the Uniform Commercial Code and various aspects of property law. The text provides the vocabulary and legal savvy necessary for business people to talk in an educated way to their customers, employees, suppliers, and other stakeholders — and to their own lawyers.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/advanced-business-law-and-the-legal-environment"
    },
    {
        "title": "NIIF FULL: Una guía práctica para su aplicación",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Patricio Javier López-Pérez, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Betty Maribel Quiñónez-Cabeza, Universidad Técnica Luis Vargas Torres de Esmeraldas",
            "Joffre Danny Preciado-Ramírez, Universidad Técnica Luis Vargas Torres de Esmeraldas"
        ],
        "subjects": [
            "Business",
            "Finance"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjY0NCwicHVyIjoiYmxvYl9pZCJ9fQ==--a873e2105767be6ccc949dca95059377f2e8e5e1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_22_22_coverImage_es_ES.jpg",
        "description": "El presente manual de NIIF proporciona una visión completa y detallada de los principales aspectos que deben requerir en la aplicación de las normas internacionales de información financiera. En primer lugar, se aborda el marco conceptual de las NIIF y su importancia en la elaboración de estados financieros de alta calidad y comprensibilidad. A continuación, se profundizará en la contabilización de inventarios, propiedad, planta y equipo, y el deterioro de activos, presentando los principales criterios para la medición, reconocimiento y presentación de dichas partidas. Por último, se explica de manera clara y precisa el proceso de conversión de monedas en los estados financieros, detallando los métodos y tasas de cambio a utilizar en la contabilización de transacciones y saldos en moneda extranjera.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/niif-full-una-guia-practica-para-su-aplicacion"
    },
    {
        "title": "Fundamentals of Business - Canadian Edition",
        "copyright_year": "2018",
        "last_update": null,
        "authors": [
            "Stephen J. Skripak",
            "Richard Parsons",
            "Anastasia Cortes"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTk4LCJwdXIiOiJibG9iX2lkIn19--397613d99135a4bf980cd08d50209a431e5b3898/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000FunBusCan.jpg",
        "description": "An introductory textbook in business that covers a variety of topics: The Foundations of Business, Economics and Business, Ethics and Social Responsibility, Business in a Global Environment, Forms of Business Ownership, Entrepreneurship: Starting a Business, Management and Leadership, Structuring Organizations, Operations Management, Motivating Employees, Managing Human Resources, Union/Management Issues, Marketing: Providing Value, Accounting and Financial Information, and Personal Finances.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-business-canadian-edition"
    },
    {
        "title": "Strategic Management - 2nd Edition",
        "copyright_year": "2020",
        "last_update": "2023",
        "authors": [
            "John Morris, Oregon State University"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTM0MywicHVyIjoiYmxvYl9pZCJ9fQ==--26cb9ff000ae71b5b6db541a4ed62988c5d6917d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Strategic-Management-2E-350x470.png",
        "description": "This open source textbook is derived from many sources, initially from thePrinciples of Managementby Carpenter, Bauer, and Erdogan, but there is abundant new content as well. It is published under a Creative Commons license and as such there is no charge ever for this textbook. The most important change from 1e is that static content was removed to make room for student-generated dynamic content. Throughout the book look for the names of contributing students in the red colored example boxes. As the term progresses, you will see new examples appear as fellow students research and summarize topics for current events, all are curated by the instructor.",
        "publisher": "Oregon State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/strategic-management"
    },
    {
        "title": "Corporate Governance",
        "copyright_year": "2012",
        "last_update": null,
        "authors": [
            "Cornelis A. de Kluyver, University of Oregon"
        ],
        "subjects": [
            "Business",
            "Human Resources",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA3LCJwdXIiOiJibG9iX2lkIn19--f4f2798260fa156c96bc62f4bb35a5039d7457c2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453343630.png",
        "description": "Corporate Governance by de Kluyver is a primer on corporate governance. It is designed to help students understand corporate governance by looking at the subject from both a macro- and micro-perspective.Historical data and examples including the recent scandals that have torn the fabric of capitalism pave a pathway to the principal challenges facing today's corporate boards, and how to successfully manage them.Topics Include:Clear coverage on why proper corporate governance has become a moral imperative and how to corporations achieve it.Discussions on recent governance reforms in the United States.Outlines of the roles that each individual in the corporate governance process must take on and how to effectively execute on those roles.Exploration on the future of corporate governance in the epilogueTake some time to review Corporate Governance by de Kluyver to see if it is a good fit for your strategy courses.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453343630",
        "source": "https://open.umn.edu/opentextbooks/textbooks/corporate-governance"
    },
    {
        "title": "Indigenous Perspectives on Business Ethics and Business Law in British Columbia",
        "copyright_year": "2022",
        "last_update": "2024",
        "authors": [
            "Annette Sorensen, Coast Mountain College",
            "Scott van Dyk, Coast Mountain College"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMjAsInB1ciI6ImJsb2JfaWQifX0=--82adf064eaf12227ce0a9260c7f21dfe4f4bd220/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/small_cover_textbook_380_9bd66b43a2.jpg",
        "description": "This book explores business ethics and business law through the lens of Indigenous-settler relations in Canada (with a focus on British Columbia in particular). It aims to fill a gap in business curriculum and support instructors who want to bring Indigenous content into their classes. The book starts by exploring relevant history, focusing on treaties, legislation, and federal government policy. It then looks at business ethics and what it means for businesses to work ethically with Indigenous communities. And finally, the book discusses business law and the requirements and responsibilities for businesses doing work on Indigenous lands.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/indigenous-perspectives-on-business-ethics-and-business-law-in-british-columbia"
    },
    {
        "title": "Managerial Accounting",
        "copyright_year": "2012",
        "last_update": "2023",
        "authors": [
            "Kurt Heisinger, Sierra College",
            "Joe Hoyle, University of Richmond"
        ],
        "subjects": [
            "Business",
            "Accounting",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE5LCJwdXIiOiJibG9iX2lkIn19--ab12cab38b9c47cd6159a9d7b21d46d5d1fe4569/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453345290.png",
        "description": "Kurt Heisinger and Joe Ben Hoyle believe that students want to learn accounting in the most efficient way possible, balancing coursework with personal schedules. They tend to focus on their studies in short intense segments between jobs, classes, and family commitments. Meanwhile, the accounting industry has endured dramatic shifts since the collapse of Enron and WorldCom, causing a renewed focus on ethical behavior in accounting. This dynamic author team designed Managerial Accounting to work within the confines of today's students' lives while delivering a modern look at managerial accounting.Managerial Accounting was written around three major themes: Ready, Reinforcement and Relevance. This book is aimed squarely at the new learning styles evident with today's students and addresses accounting industry changes as well.Ready. Your students want to be as efficient as possible in their learning. This book adopts a concise, jargon-free, and easy-to-understand approach that is ready with concise sections and concepts when the student is ready to study in a format the student wants. Key concepts are provided in short segments with bullet points and step-by-step instructions to simplify concepts. This thoughtful, step-wise approach will help your students avoid distractions and focuses attention on the big picture.Reinforcement.Managerial Accounting boasts “Review Problems” at the end of each major section or learning objective which offer practical opportunities for students to apply what they have learned. These “Review Problems” allow students to immediately reinforce what they have learned and are provided within the body of the chapter along with the solutions.Relevance.Why is managerial accounting important? Since all students perform better when they can answer the “why” question, meaningful references to companies throughout the chapters help students tie the concepts presented in each chapter to real organizations. In addition, realistic managerial scenarios present an issue that must be addressed by the management accountant. These will pique your students' interest and were designed to show how issues can be resolved using the concepts presented in the chapter. Finally, “Business in Action” features in Managerial Accounting link managerial decision-making to real business decisions to help your students complete the learning cycle from concept, to accounting decision, to real-world application.Managerial Accountingby Heisinger and Hoyle also contains a handful of other pedagogical aids to compliment your lectures and help your students come to class prepared. From a focus on decision-making, to end of chapter materials that can only be characterized as very deep and very wide, to ethics coverage, group projects and spreadsheet applications—these features allow you to teach the course you want to teach and assign the materials you like to assign.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453345290",
        "source": "https://open.umn.edu/opentextbooks/textbooks/managerial-accounting"
    },
    {
        "title": "Análisis Científico de la Ética desde la Perspectiva Multidisciplinaria",
        "copyright_year": "2022",
        "last_update": null,
        "authors": [
            "Maybelline J. Herrera-Sánchez, Esmeraldas, Ecuador",
            "Geovely J. Olmedo Jumbo, Esmeraldas, Ecuador",
            "Yeska D. Quezada Valarezo, Esmeraldas, Ecuador"
        ],
        "subjects": [
            "Business",
            "Human Resources"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzgyMSwicHVyIjoiYmxvYl9pZCJ9fQ==--e4e77f227f5695268675c2aed054d07f969b12b3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-07-18%20at%205.18.46%20PM.png",
        "description": "El presente manuscrito es resultado de investigaciones multidisciplinarias bajo diferentes perspectivas científicas-académicas, mediante la confrontación de criterios de diferentes autores bajo un enfoque descriptivo que señala la importancia de ética en varios escenarios actuales como son en la discriminación de la mujer en ambiente laboral, el manejo de los individuos dentro de las organizaciones, dentro de la agricultura al momento de producir y cultivar, como la ética afecta al clima organizacional y lagestión docente dentro del caso de estudio de una universidad, la ética y la responsabilidad social empresarial como reto de las empresas, la discriminación laboral como comportamiento poco ético en el área de recursos humanos, y por ultimo una contrastación de la ética en la publicidad de las empresas. Estos estudios se realizan desde una mirada científica y se la acerca a la realidad ecuatoriana.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942701428",
        "source": "https://open.umn.edu/opentextbooks/textbooks/analisis-cientifico-de-la-etica-desde-la-perspectiva-multidisciplinaria"
    },
    {
        "title": "Beyond Lean: Simulation in Practice - Second Edition",
        "copyright_year": "2013",
        "last_update": null,
        "authors": [
            "Charles R. Standridge, Grand Valley State University"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTgxLCJwdXIiOiJibG9iX2lkIn19--ba700b633320739e91137d66767aa589afe95d6b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000BeyLeSiPr.png",
        "description": "Lean thinking, as well as associated processes and tools, have involved into a ubiquitous perspective for improving systems particularly in the manufacturing arena. With application experience has come an understanding of the boundaries of lean capabilities and the benefits of getting beyond these boundaries to further improve performance. Discrete event simulation is recognized as one beyond-the-boundaries of lean technique. Thus, the fundamental goal of this text is to show how discrete event simulation can be used in addition to lean thinking to achieve greater benefits in system improvement than with lean alone. Realizing this goal requires learning the problems that simulation solves as well as the methods required to solve them. The problems that simulation solves are captured in a collection of case studies. These studies serve as metaphors for industrial problems that are commonly addressed using lean and simulation.",
        "publisher": "Grand Valley State University",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/beyond-lean-simulation-in-practice-second-edition"
    },
    {
        "title": "Entorno Empresarial desde la Gestión del Derecho Laboral: Breves Apuntes desde una Perspectiva Académica",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "César Andrés uerrero-Velástegui, Universidad Técnica de Ambato"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxMjgsInB1ciI6ImJsb2JfaWQifX0=--e90357e3cad970ee2e9e2ac188854644131e1c50/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_42_42_coverImage_es_ES.jpg",
        "description": "El entorno empresarial permite analizar los factores exógenos y endógenos que influyen en la empresa y la actividad en la que se desenvuelve en el sector industrial, razón por la cual es necesario identificar los elementos del macro y micro entorno que inciden de forma positiva o negativa en la gestión empresarial. En ese sentido el ámbito legal es uno de los factores elementales que el Empresario debe considerar. El entorno empresarial y el derecho laboral son dos aspectos esenciales de la economía moderna que están estrechamente interconectados. El entorno empresarial se refiere a los factores externos que influyen en las operaciones de una organización, mientras que la legislación laboral regula la relación entre empleadores y empleados. Esta obra proporcionará una visión general del entorno empresarial y el derecho laboral, así como analizará los elementos necesarios para actuar de forma ética y legal en la gestión empresarial. El entorno empresarial está determinado por varios factores políticos, económicos, sociales, tecnológicos, ecológicos y legales que marcan el campo de acción de la gestión empresarial. Más aún en ámbitos de derecho laboral, los aspectos legales que intervienen en la relación entre el empleador y el empleado deben gestionarse conforme lo dictamina la normativa vigente, salvaguardando derechos y verificando el cumplimiento de obligaciones, pues el impacto del entorno empresarial en las organizaciones y sus operaciones puede ser significativo.",
        "publisher": "Editorial Grupo AEA",
        "language": "Spanish; Castilian",
        "isbn13": "9789942651020",
        "source": "https://open.umn.edu/opentextbooks/textbooks/entorno-empresarial-desde-la-gestion-del-derecho-laboral-breves-apuntes-desde-una-perspectiva-academica"
    },
    {
        "title": "Digital Marketing Strategy",
        "copyright_year": "2021",
        "last_update": null,
        "authors": [
            "Pierre-Yann Dolbec, Concordia University Research"
        ],
        "subjects": [
            "Business",
            "Marketing"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzQ1NSwicHVyIjoiYmxvYl9pZCJ9fQ==--94a4ec2ebfe7ac0cf65c1c6a1e8678b8ee6d8694/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/DMBCover_Photo-1-683x1024.jpg",
        "description": "The Internet has transformed how businesses conduct their activities and how consumers go about buying products. This textbook aims to provide a way of conceptualizing how to do marketing online and a strategic framework to do so.",
        "publisher": "Concordia University Open Textbooks",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/digital-marketing-strategy"
    },
    {
        "title": "Introductory Business Statistics with Interactive Spreadsheets - 1st Canadian Edition",
        "copyright_year": "2010",
        "last_update": null,
        "authors": [
            "Mohammad Mahbobi, Thompson Rivers University",
            "Thomas K. Tiemann, Elon University"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzYxLCJwdXIiOiJibG9iX2lkIn19--9815f4a4b97bba037a543f368ade2fe81628e76a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntBusCan.png",
        "description": "Introductory Business Statistics with Interactive Spreadsheets – 1st Canadian Editionis an adaptation of Thomas K. Tiemann's book,Introductory Business Statistics. This new edition still contains the basic ideas behind statistics, such as populations, samples, the difference between data and information, and sampling distributions as well as information on descriptive statistics and frequency distributions, normal and t-distributions, hypothesis testing, t-tests, f-tests, analysis of variance, non-parametric tests, and regression basics. New topics include the chi-square test and categorical variables, null and alternative hypotheses for the test of independence, simple linear regression model, least squares method, coefficient of determination, confidence interval for the average of the dependent variable, and prediction interval for a specific value of the dependent variable.This new edition also allows readers to learn the basic and most commonly applied statistical techniques in business in an interactive way — when using the web version — through interactive Excel spreadsheets. For each topic, a customized interactive template has been created within which selected values can be repeatedly changed to observe how the entire process, as well as the outcomes, are automatically adjusted.Also, in this adapted edition, the real-world examples throughout the text, and the information in general, have been revised to reflect Canadian content.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/introductory-business-statistics-with-interactive-spreadsheets-1st-canadian-edition"
    },
    {
        "title": "Mastering Strategic Management - 1st Canadian Edition",
        "copyright_year": "2014",
        "last_update": null,
        "authors": [
            "Janice Edwards, Centennial College",
            "Dave Ketchen, Auburn University",
            "Jeremy Short, University of Oklahoma"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzU5LCJwdXIiOiJibG9iX2lkIn19--66a2078f8fb61fdd53c9957cbbcdddcebc057ec2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000MasStrCan.png",
        "description": "Mastering Strategic Managementis designed to enhance student engagement in three innovative ways. The first is through visual adaptations of the key content in the book. It is well documented that many of today's students are visual learners. To meet students' wants and needs (and thereby create a much better teaching experience for professors), Mastering Strategic Management contains multiple graphic concept pages in ever section of every chapter of the book. Think of graphic concept pages as almost like info-graphics for key concepts in each section. This feature sets Mastering Strategic Management apart from any strategic management book on the market today. The second way the authors capture student interest through their textbook is by using a real-world company as the running example in each chapter. For example, Chapter 1 in Mastering Strategic Management utilizes Blackberry to harness the conceptual coverage of the chapter in a running, corporate, application to which students will relate. The third inventive way Mastering Strategic Management holds the attention of strategic management students is through the “strategy at the movies” feature in each chapter that links course concepts with a popular motion picture.",
        "publisher": "BCcampus",
        "language": "English",
        "isbn13": "9781774200094",
        "source": "https://open.umn.edu/opentextbooks/textbooks/mastering-strategic-management-1st-canadian-edition"
    },
    {
        "title": "International Business",
        "copyright_year": "2011",
        "last_update": null,
        "authors": [
            "Mason A Carpenter, University of Wisconsin at Madison",
            "Sanjyot P Dunung, Atma Global"
        ],
        "subjects": [
            "Business",
            "Management"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTgsInB1ciI6ImJsb2JfaWQifX0=--e1ac710123585d11ea8a8be0035548270851482f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453312995.png",
        "description": "International Business is one of the most challenging and exciting courses to teach in the Business School. To teach a current, dynamic and complete course you need a textbook by authors as passionate and informed about International Business as you are.Carpenter and Dunung's International Business: The Opportunities and Challenges of a Flat World provides exploration into building, leading, and thriving in global organizations in an increasingly flat world. The authors define ”Flat world“ as one where service industries that dwarf manufacturing industries in terms of scale and scope, an Internet that pervades life and work, and networks define modern businesses, whether service or manufacturing. Carpenter and Dunung's text is designed to speak to technologically-savvy students who see national borders as bridges and not barriers.The authors use the lexicon of international business, and additionally, develop students' knowledge of international contexts with the aim that they may launch, run, and work in any organization that is global in scope (or is wrestling with global competition or other global threats).The textbook is organized in 5 Sections:Section 1introduces the global business course and concludes with a chapter on seizing global opportunities.Section 2develops student knowledge about key facets of the global business environment, whileSection 3develops knowledge about how a student or organization can exploit opportunities in that global environment.Section 4is devoted to entrepreneurship in a flat world — this section will explore why the entrepreneurial context is changing, provide lenses for identifying and capitalizing on entrepreneurial opportunities, andSection 5shows how key organizational activities can be managed for global effectiveness. Every chapter has five enumerated learning objectives, each of these five sections concludes with a short summary (”Key Takeaways“) and five review questions.In addition, each chapter concludes with a mini case on a unique global business that encompasses the topics shown in the chapter. The authors even provide a set of end-of-chapter questions that are mapped to AACSB learning standards, so that you will be able to measure how well students are grasping course content that aligns with the AACSB guidelines. Request a desk copy of Carpenter and Dunung's International Business: The Opportunities and Challenges of a Flat World to experience its current and progressive look at International Business for yourself.",
        "publisher": "Saylor Foundation",
        "language": "English",
        "isbn13": "9781453312995",
        "source": "https://open.umn.edu/opentextbooks/textbooks/international-business"
    },
    {
        "title": "Adaptive Apparel Design",
        "copyright_year": "2023",
        "last_update": null,
        "authors": [
            "Ellen McKinney, University of Alabama",
            "Rachel Eike, Iowa State University"
        ],
        "subjects": [
            "Business"
        ],
        "image": "https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQ4MiwicHVyIjoiYmxvYl9pZCJ9fQ==--3506427cd9bb0c54f173d144b2a8fdce89f3cbd3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/McKinney-AdaptiveApparelDesign-Cover-350x453.png",
        "description": "This instructional text and designer resources have been prepared to support those learning about adaptive apparel design. The text is easy for students, scholars, and designers to use, and is organized around the apparel design process: research, sketching, developing a sample notebook, mood or inspiration board, pattern work, first sample, and the completed ensemble. Users can read from beginning to end or jump into resources related to their current phase of design.",
        "publisher": "Iowa State University Digital Press",
        "language": "English",
        "isbn13": null,
        "source": "https://open.umn.edu/opentextbooks/textbooks/adaptive-apparel-design"
    }
]