[
    "{\n    \"title\": \"Confident Supervisors: Creating Independent Researchers\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Susan Gasson, James Cook University\",\n        \"Christine Bruce, Queensland University of Technology\",\n        \"Ian Stoodley, Queensland University of Technology\",\n        \"Jillian Blacker, Queensland University of Technology\",\n        \"Abigail Winter, Queensland University of Technology\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTExODAsInB1ciI6ImJsb2JfaWQifX0=--475b6d23e7558f751812266f15875dfefe349a2f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Confident-Supervisors-Creating-Independent-Researchers2-350x467.png\",\n    \"description\": \"Confident Supervisors is intended to be both a textbook and a professional development resource for Higher Degree Research supervisors and researcher developers involved in providing workshops and resources to support research supervisors in their practice. Throughout this book, authors introduce different theoretical frameworks and concepts to provide supervisors with tools and strategies for responding to the challenges and opportunities associated with research supervision. It contains chapters written by current supervisors and research support partners who are engaged in the scholarship of supervision and can share the practical and theoretical constructs they employ in their practice. The authors have been drawn from a broad range of higher education and research contexts and contribute understandings of local and global relevance. This openly available eBook responds to turbulent times in higher education, offering practical tips and suggestions for supervisors to pivot to changing contexts.\",\n    \"publisher\": \"James Cook University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/confident-supervisors-creating-independent-researchers\"\n}",
    "{\n    \"title\": \"Advanced-Level Writing in the University Classroom and Beyond: Mindful Practices for Technical, Business, and Scientific Communication - 2024 Edition\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Dawn Atkinson, Montana Technological University\",\n        \"Stacey Corbitt, Montana Technological University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIwOTcsInB1ciI6ImJsb2JfaWQifX0=--51c1f78b7df4c5b53cd392dca800322470033e70/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/alw.jpg\",\n    \"description\": \"Welcome to Advanced-Level Writing in the University Classroom and Beyond: Mindful Practices for Technical, Business, and Scientific Communication. To encourage this open textbook’s use in various undergraduate classes, it has been developed as an all-in-one resource that concentrates on technical writing, business writing, scientific writing, and technical editing. It offers a no-cost alternative to commercial products, combining practical guidance with interactive exercises and thoughtfully designed writing opportunities.\",\n    \"publisher\": \"Montana Technological Unviersity\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/advanced-level-writing-in-the-university-classroom-and-beyond-mindful-practices-for-technical-business-and-scientific-communication\"\n}",
    "{\n    \"title\": \"Exploring Perspectives: A Concise Guide to Analysis\",\n    \"copyright_year\": \"2011\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Randall Fallows, University of California Los Angeles\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTQsInB1ciI6ImJsb2JfaWQifX0=--8bc9f3a376eb6c5e63d4e201413dfe583813f513/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453311455.png\",\n    \"description\": \"The reason why Randall Fallows wroteExploring Perspectives: A Concise Guide to Analysisis simple: to help give students a better understanding of how to discover, develop, and revise an analytical essay. Here is how his 5 chapter book goes about doing just that:The first two chapters focus on the nature of an analysis and what's involved in writing an analytical essay.Randall shows that analysis consists of a balance of assertions (statements which present their viewpoints or launch an exploration of their concerns), examples (specific passages/scenes/events which inspire these views), explanations (statements that reveal how the examples support the assertions), and significance (statements which reveal the importance of their study to personal and/or cultural issues).After showing why each feature should be present throughout an essay, he reveals how to \\\"set the stage\\\" for producing one of their own.He first helps students to evaluate their own views on a subject and to examine how these views emerge from their own experiences, values and judgments.He, then, shows them how to research what others have said about the subject and provides suggestions for evaluating and incorporating this research into their own perspectives.Finally, Randall discusses the nature of writing, not as a linear procedure, but as a recursive process where the discovery and clarification of a concept occur simultaneously.The remaining three chapters reveal more specific advice on how to develop an analytical essay.Exploring Perspectives: A Concise Guide to Analysisby Randall Fallows is a great text to prepare any student to write analytical essays for the argument and persuasion courses.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453311455\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/exploring-perspectives-a-concise-guide-to-analysis\"\n}",
    "{\n    \"title\": \"Creating Online Learning Experiences\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Matt Crosslin, University of Texas at Arlington\",\n        \"Brett Benham, University of Texas at Arlington\",\n        \"Justin T. Dellinger, University of Texas at Arlington\",\n        \"Amber Patterson, City of Mesquite, Texas\",\n        \"Peggy Semingson, The University of Texas at Arlington\",\n        \"Catherine A. Spann, University of Colorado\",\n        \"Brittany Usman, University of Texas at Arlington\",\n        \"Harriet Watkins\",\n        \"Justin T. Dellinger, University of Texas at Arlington\",\n        \"Rebecca Heiser, Penn State University\",\n        \"Katerina Riviou, Greece & Open University of Netherlands\",\n        \"Brittany Usman, University of Texas at Arlington\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjY4LCJwdXIiOiJibG9iX2lkIn19--0ac9014f5e860731018932a56fbf33d2e43ed946/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9780989887816.jpg\",\n    \"description\": \"This book provides an updated look at issues that comprise the online learning experience creation process. As online learning evolves, the lines and distinctions between various classifications of courses has blurred and often vanished. Classic elements of instructional design remain relevant at the same time that newer concepts of learning experience are growing in importance. However, problematic issues new and old still have to be addressed. This handbook explores many of these topics for new and experienced designers alike, whether creating traditional online courses, open learning experiences, or anything in between.\",\n    \"publisher\": \"Mavs Open Press\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780989887816\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/creating-online-learning-experiences\"\n}",
    "{\n    \"title\": \"Beyond the Horizon: Broadening Our Understanding of OER Efficacy\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kaitlin Schilling, Rebus Community\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTgzNSwicHVyIjoiYmxvYl9pZCJ9fQ==--687c9318e97927e5b5e05b679a5fdbbc7125b58c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/My-project1-350x467.png\",\n    \"description\": \"Beyond the Horizon: Broadening Our Understanding of OER Efficacyis a concise yet comprehensive resource designed to provide insight into the current state of research and reporting on Open Educational Resources (OER) efficacy. This guide explores existing frameworks, delves into key themes and gaps, and highlights emerging opportunities in the realm of OER efficacy.\",\n    \"publisher\": \"Rebus Community\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/beyond-the-horizon-broadening-our-understanding-of-oer-efficacy\"\n}",
    "{\n    \"title\": \"Game Based and Adaptive Learning Strategies\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Carrie Lewis Miller, Mankato, MN\",\n        \"Odbayar Batsaikhan, Mankato, MN\",\n        \"Elizabeth Pluskwik, Mankato, MN\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk4OCwicHVyIjoiYmxvYl9pZCJ9fQ==--b57c88ca473480ba40c491ec91dc91bacadf2118/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Game-Based-and-Adaptive-Learning-Strategies-768x1024.png\",\n    \"description\": \"This book is designed to accompany a graduate-level instructional design course:Game-Based and Adaptive Learning,but could also be used for undergraduate teacher education or instructional design courses.The original texts and material for this book came from the development of a course for Brandeis University as part of their MS in Learner Experience Design program. This material can be used to teach pre-service teachers, in-service teachers, and instructional designers about game-based and adaptive learning.  Assessments used in the actual Game-based and Adaptive Learning course are included in the final chapter and serve as recommendations for assessments of the learning outcomes. The material in this book pairs well withUsing Game-Based Learning Online – A Cookbook of Recipesby The EGG.The Faculty Showcase materials were developed by dedicated faculty during the course of a year-long game development workshop in which faculty were introduced to GBL, developed game prototypes, played a variety of games, and finally playtested their designs. The work they continue to do in the area of GBL is part of the inspiration for this book. If you would like to contribute your own case study, please contact me at carrie.miller@mnsu.edu for consideration.Carrie Lewis Miller, Ph.D.- editor/author- Instructional Designer, Minnesota State University, Mankato\",\n    \"publisher\": \"Minnesota State Colleges and Universities\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/game-based-and-adaptive-learning-strategies\"\n}",
    "{\n    \"title\": \"Beyond Dichotomy: Synergizing Writing Center and Classroom Pedagogies\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Steven J. Corbett, George Mason University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjM1LCJwdXIiOiJibG9iX2lkIn19--6cda45d309128f377fe0f2d3b645c4c6ecd0493d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602356320.png\",\n    \"description\": \"How closely can or should writing centers and writing classrooms collaborate?Beyond Dichotomyexplores how research on peer tutoring one-to-one and in small groups can inform our work with students in writing centers and other tutoring programs, as well as in writing courses and classrooms. These multi-method (including rhetorical and discourse analyses and ethnographic and case-study) investigations center on several course-based tutoring (CBT) partnerships at two universities. Rather than practice separately in the center or in the classroom, rather than seeing teacher here and tutor there and student over there, CBT asks all participants in the dynamic drama of teaching and learning to consider the many possible means of connecting synergistically.This book offers the \\\"more-is-more\\\" value of designing more peer-to-peer learning situations for developmental and multicultural writers, and a more elaborate view of what happens in these peer-centered learning environments. It offers important implications—especially of directive and nondirective tutoring strategies and methods—for peer-to-peer learning and one-to-one tutoring and conferencing for all teachers and learners of writing.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602356320\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/beyond-dichotomy-synergizing-writing-center-and-classroom-pedagogies\"\n}",
    "{\n    \"title\": \"Project Management for Instructional Designers\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Bobbie Sandberg, Brigham Young University\",\n        \"Royce Kimmons, Brigham Young University\",\n        \"Rebecca Zundel, Brigham Young University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI1MTYsInB1ciI6ImJsb2JfaWQifX0=--7028415b084c118271deab3a8946a5ef6b4909f4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/4_lg_09-06-2022_200704.png\",\n    \"description\": \"Project Management for Instructional Designers (PM4ID) is a textbook about project management tailored specifically for instructional designers, intended for use in graduate programs in educational technology. This book is based on a pre-existing openly licensed textbook which was donated to the commons by a benefactor that desires to remain anonymous, and has been collaboratively revised and remixed by faculty and students at Brigham Young University.\",\n    \"publisher\": \"David Wiley\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/project-management-for-instructional-designers\"\n}",
    "{\n    \"title\": \"Educational Psychology - Second Edition\",\n    \"copyright_year\": \"2009\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kelvin Seifert, University of Manitoba\",\n        \"Rosemary Sutton, Cleveland State University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjM4LCJwdXIiOiJibG9iX2lkIn19--941ae02e96adff6b6f47335f600f6a9a5e5b767c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000EducatPsy.png\",\n    \"description\": \"Chapters in the text can be assigned either from beginning to end, as with a conventional printed book, or they can be selected in some other sequence to meet the needs of particular students or classes. In general the first half of the book focuses on broader questions and principles taken from psychology per se, and the second half focuses on somewhat more practical issues of teaching. But the division between “theory” and “practice” is only approximate; all parts of the book draw on research, theory, and practical wisdom wherever appropriate. Chapter 2 is about learning theory, and Chapter 3 is about development; but as we point out, these topics overlap with each other as well as with the concerns of daily teaching. Chapter 4 is about several forms of student diversity (what might be called individual differences in another context), and Chapter 5 is about one form of diversity that has become prominent in schools recently—students with disabilities. Chapter 6 is about motivation, a topic that is heavily studied by psychological researchers, but that also poses perennial challenges to classroom teachers.Following these somewhat more basic psychological chapters, we turn to several lasting challenges of classroom life—challenges that seem to be an intrinsic part of the job. Chapter 7 offers ideas about classroom management; Chapter 8, ideas about communicating with students; Chapter 9, about ways to assist students' complex forms of thinking; and Chapter 10, about planning instruction systematically. The book closes with two chapters about assessment of learning: Chapter 11 focuses on teachers' own efforts to assess students, and Chapter 12 focuses on standardized measures of assessment.We have organized material and features in ways that we hope will allow for a variety of students, instructors, and institutions to use the book. For instructors and courses that seek a strong focus on research and the research process, for example, we have included an extra “chapter” on research methods—Appendix C, “The Reflective Practitioner”—that discusses the nature of research and the research process. We have also included a set of research-related case studies in Appendix B, “Deciding for yourself about the research”, that describe a number of particular educational research programs or topics in detail and that invite students to reflect on the quality and implications of the research.Whether or not a strong focus on research is a priority in your particular course, there are additional features of the book that are intended to help students in learning about educational psychology. In particular, each chapter ends with a “Chapter summary”, a list of “Key terms”, and links to Internet sites (called “Further resources”) relevant to the themes of the chapter. One of the sites that is cited frequently and that may be particularly helpful to instructors is the teachingedpsych wiki (http://teachingedpsych.wikispaces.com/), an archive of hundreds of teaching and learning materials that supports the teaching of introductory educational psychology. Teachingedpsych is a project of the Special Interest Group on the Teaching of Educational Psychology (TEP SIG), affiliated with the American Educational Research Association.All in all, we hope that you find Educational Psychology a useful and accessible part of your education. If you are preparing to be a teacher, good luck with your studies and your future! If you are an instructor, good luck with helping your students learn about this subject!\",\n    \"publisher\": \"University of Manitoba\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/educational-psychology\"\n}",
    "{\n    \"title\": \"The Asynchronous Cookbook\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"DLINQ staff contributors\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzUxMCwicHVyIjoiYmxvYl9pZCJ9fQ==--68aa568a0a77f55b6a40f7554aa7cd113cb12499/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/asynchronousCookbookCovercc-1-659x1024.png\",\n    \"description\": \"Whether you're teaching mostly in person but looking for some regular, asynchronous activities to add to your course, or teaching a fully online course, this resource is for you. The activities in this cookbook draw on research and good practice in online course design to provide recipes - concise and specific instructions and examples - for adding asynchronous activities to a course. Meaningful interaction between students and instructors is a key ingredient in all of these recipes.\",\n    \"publisher\": \"Office of Digital Learning & Inquiry, Middlebury College\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-asynchronous-cookbook\"\n}",
    "{\n    \"title\": \"Learning to Learn Online\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kwantlen Polytechnic University Learning Centres\",\n        \"Christina Page\",\n        \"Adam Vincent\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkwNywicHVyIjoiYmxvYl9pZCJ9fQ==--a3971a0d92b12f0f99400b78141dc93fc9ba6103/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Open-Education_Pressbooks_Cover-Learning-to-Learn-768x994.jpg\",\n    \"description\": \"Learning to Learn Online helps you prepare for online learning success by introducing you to the online learning environment and your role as a learner within it. As you come to understand yourself as an self-directed learner, you will also be introduced to effective learning strategies: time management for online learners, information management, professional communication, and reading strategies. Welcome to your online learning journey!\",\n    \"publisher\": \"Kwantlen Polytechnic University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/learning-to-learn-online\"\n}",
    "{\n    \"title\": \"Building Democracy for All: Interactive Explorations of Government and Civic Life\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Robert W. Maloy, University of Massachusetts Amherst\",\n        \"Torrey Trust, University of Massachusetts Amherst\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjczNSwicHVyIjoiYmxvYl9pZCJ9fQ==--c11d4a5059f7993c652db4f9ed25feb70fd81d7f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/110_md_01-31-2020_132914.jpg\",\n    \"description\": \"Designed as a core or supplementary text for upper elementary, middle and high school teachers and students, Building Democracy for All offers instructional ideas, interactive resources, multicultural content, and multimodal learning materials for interest-building explorations of United States government as well as students’ roles as citizens in a democratic society. It focuses on the importance of community engagement and social responsibility as understood and acted upon by middle and high school students—core themes in the 2018 Massachusetts 8th Grade Curriculum Framework, and which are found in many state history and social studies curriculum frameworks around the country.Building Democracy for All has been developed by a collaborative writing team of higher education faculty, public school teachers, educational librarians, and college students who are preparing to become history and social studies teachers. The primary editors and curators are from the University of Massachusetts Amherst College of Education. Contributing teachers come from school districts in the Connecticut River valley region of western Massachusetts (Amherst, Gateway, Westfield, Hampshire Regional, and Springfield). As an open resource, the book is being revised constantly by the members of the writing team to ensure timely inclusion of online resources and information.\",\n    \"publisher\": \"EdTech Books\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/building-democracy-for-all-interactive-explorations-of-government-and-civic-life\"\n}",
    "{\n    \"title\": \"ePortfolio Performance Support Systems: Constructing, Presenting, and Assessing Portfolios\",\n    \"copyright_year\": \"2013\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Katherine V. Wills, Indiana University Purdue University at Columbus\",\n        \"Rich Rice, Texas Tech University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjQzLCJwdXIiOiJibG9iX2lkIn19--2b2ea006b3008756df4867807f4d1624ddf5fb8c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602354432.png\",\n    \"description\": \"ePortfolio Performance Support Systems: Constructing, Presenting, and Assessing Portfoliosaddresses theories and practices advanced by some of the most innovative and active proponents of ePortfolios. Editors Katherine V. Wills and Rich Rice interweave twelve essays that address the ways in which ePortfolios can facilitate sustainable and measureable writing-related student development, assessment and accountability, learning and knowledge transfer, and principles related to universal design for learning, just-in-time support, interaction design, and usability testing.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602354432\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/eportfolio-performance-support-systems-constructing-presenting-and-assessing-portfolios\"\n}",
    "{\n    \"title\": \"Reading With My Eyes Open: Embracing the critical and the personal in language pedagogy\",\n    \"copyright_year\": \"2013\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Gerdi Quist, University College London\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk2LCJwdXIiOiJibG9iX2lkIn19--6ae0f9a9711db262cbd5903042c2a20e78eed73d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781909188211.png\",\n    \"description\": \"Untangling the various approaches to language teaching and their history, Gerdi Quist maps recent thinking in language studies at university. Using an interdisciplinary theoretical framework, drawn from educational philosophy, cultural studies, intercultural studies and language pedagogy, the author discusses the many tensions and currents in contemporary language teaching. The author puts forward an alternative pedagogy, that of a cultuurtekst-perspective, which engages learners at complex linguistic and cultural levels. In discussing the case study in which this approach is tested, the author develops her argument for embracing various critical perspectives through the personal engagement of students. From the start the author acknowledges her own engaged position as a language teacher in a liberal humanistic educational environment. She adopts a self-critical perspective through which her engagement with adverse student reaction leads to deepening insights both for the author and her students as part of the non-linear process of learning. Gerdi Quist teaches Dutch language and lectures on multiculturalism and intercultural communication. Recent publications included a book chapter and journal articles on language pedagogy and intercultural communication.\",\n    \"publisher\": \"Ubiquity Press\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781909188211\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/reading-with-my-eyes-open-embracing-the-critical-and-the-personal-in-language-pedagogy\"\n}",
    "{\n    \"title\": \"Parenting and Family Diversity Issues\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Diana Lang, Iowa State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\",\n        \"Elementary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTU4MiwicHVyIjoiYmxvYl9pZCJ9fQ==--03f3d0cb00bcd8275d2678e905fbeae39c9d203c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/familyparet.png\",\n    \"description\": \"This book has been created for students and all individuals who work with children and families (e.g., educators, parents, caregivers, direct support workers, etc.) in diverse contexts.  It is imperative to understand how and what factors may influence child outcomes across the lifespan. Therefore, key concepts related to parenting, child-rearing, care-giving, and parenting education are outlined in this textbook to provide historical, theoretical, and practical perspectives across vast settings and developmental domains.\",\n    \"publisher\": \"Iowa State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/parenting-and-family-diversity-issues\"\n}",
    "{\n    \"title\": \"Who Teaches Writing\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Tyler Branson, University of Florida\",\n        \"Ron Brooks, Montclair State University\",\n        \"Dana Cadman\",\n        \"Heidi Cephus\",\n        \"Sara Beth Childers, Oklahoma State University\",\n        \"Elizabeth Devore, Kent State University\",\n        \"Anna Sicari, Oklahoma State University\",\n        \"Charlotte Hogg, Texas Christian University\",\n        \"Ho'omana Nathan Horton, Oklahoma State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzc3NCwicHVyIjoiYmxvYl9pZCJ9fQ==--e8d1b6972971b47d346e18afa7450b52d64e45cd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/ENGL-1113-cover_OEN.jpg\",\n    \"description\": \"Who Teaches Writingis an open teaching and learning resource being used in English Composition classes at Oklahoma State University. It was authored by contributors from Oklahoma State University and also includes invited chapters from faculty and staff at institutions both inside and outside of Oklahoma. Contributors include faculty from various departments, contingent faculty and staff, and graduate instructors. One purpose of the resource is to provide short, relatively jargon-free chapters geared toward undergraduate students taking First-Year Composition. Support for this project was provided in part by OpenOKState and Oklahoma State University Libraries.\",\n    \"publisher\": \"Oklahoma State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/who-teaches-writing\"\n}",
    "{\n    \"title\": \"Desarrollo del Pensamiento Creativo: mediante Juegos Libres para Niños\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Esther Glory Terrazo-Luna, Universidad Nacional de Huancavelica\",\n        \"Daker Riveros-Anccasi, Universidad Nacional de Huancavelica\",\n        \"Abel Gonzales-Castro, Universidad Nacional de Huancavelica\",\n        \"Juan José Oré-Rojas, Universidad Nacional de Huancavelica\",\n        \"Angel Epifanio Rojas-Quispe, Universidad Nacional de Huancavelica\",\n        \"Ubaldo Cayllahua-Yarasca, Universidad Nacional de Huancavelica\",\n        \"Christian Luis Torres-Acevedo, Universidad Nacional de Huancavelica\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTMyNSwicHVyIjoiYmxvYl9pZCJ9fQ==--81c5e33b7091b95658a4f78cc40cc350d8bd74ac/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_29_29_coverImage_es_ES.png\",\n    \"description\": \"Este trabajo de investigación tuvo como objetivo evaluar la eficacia de los juegos libres en el desarrollo del pensamiento creativo en los estudiantes de 5 años de la Institución Educativa Nº 329 de Huancavelica. La metodología de los juegos libres ofrece una educación dinámica y activa en los estudiantes, la cual incentiva el desarrollo del pensamiento creativo en los estudiantes de 5 años, a través de un mayor sentido de seguridad y confianza en sí mismos. Esta metodología se realizó en un ambiente motivador y áreas libres, centrándose en la participación dinámica y motivadora, con el fin de fortalecer sus capacidades y habilidades, buscando que ellos desarrollen un aprendizaje autónomo. Con los resultados obtenidos se puede afirmar que los juegos libres favorecen directamente en el desarrollo del pensamiento creativo en los niños de 5 años, toda vez que t de Student con 53 grados de libertad, para muestras independientes, con una significancia del 5%, muestra un valor de 0.038 el cual es inferior al valor planteado, aceptando la hipótesis alternativa como válida.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/desarrollo-del-pensamiento-creativo-mediante-juegos-libres-para-ninos\"\n}",
    "{\n    \"title\": \"The Whole Child: Development in the Early Years\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Deirdre Budzyna, Northern Essex Community College\",\n        \"Doris Buckley, Northern Essex Community College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzMjcsInB1ciI6ImJsb2JfaWQifX0=--c69ee8e7e6399e5bafc188e495aaf0d27a2972c2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/081622_RotelProject_TheWholeChild-Buckley-Updated-002-350x453.png\",\n    \"description\": \"The Whole Child is a textbook that gives an overview of development, beginning in the mother’s womb through the age of eight. It starts with a look at perspectives of early childhood, including how children have been viewed historically as well as cross-culturally. There is a complete overview of the important theorists that have helped to deepen and bring clarity to how children develop. These theories include psychodynamic, behavioral, social cognitive theory, cognitive theory, humanistic, multiple intelligence, growth mindset, and Bloom’s taxonomy. Understanding the implications of each theory is important foundational knowledge for the study of development. Developmental domains at each stage is examined alongside important milestones. The biology of the brain is given important consideration. Some of the many factors that influence a young child’s development are also included in this text.\",\n    \"publisher\": \"ROTEL\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-whole-child-development-in-the-early-years\"\n}",
    "{\n    \"title\": \"Mathematics Methods for Early Childhood\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Janet Stramel, Fort Hays State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzQzMywicHVyIjoiYmxvYl9pZCJ9fQ==--92eaba69662051a55776b7086acaa9c44eddbdc4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/cover-683x1024.jpg\",\n    \"description\": \"Welcome to Early Childhood Mathematics! This course satisfies the Early Childhood Unified requirements in the state of Kansas for a teaching license Birth to Grade 3.Most people agree that early childhood includes the period from infancy until eight years of age, characterized by rapid and complex growth in physical, cognitive, and social domains. Math skills must be taught in early childhood. Children should be provided a foundation to succeed in elementary school and beyond. Teachers should focus lessons in early childhood around the basic skills that will help to advance future mathematics. From preschool to the end of elementary school, children are setting the foundation for future life skills.Learning mathematics is “a ‘natural’ and developmentally appropriate activity for young children” (Ginsberg, Lee, and Boyd, 2008). Through their everyday interactions with the world, many children develop informal concepts about space, quantity, size, patterns, and operations. Unfortunately, not all children have the same opportunities to build these informal and foundational concepts of mathematics in their day-to-day lives (Sherman-LeVos, 2010).Young children are naturally curious, and the best time to begin mathematics is at a time while the young child’s brain is rapidly developing. Mathematics in early childhood helps children develop critical thinking and reasoning skills early onandit’s the key to the foundation for success in their formal schooling years.\",\n    \"publisher\": \"Fort Hays State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/mathematics-methods-for-early-childhood\"\n}",
    "{\n    \"title\": \"How To Do Science - Revised Edition\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Louise Lexis, Melbourne, Australia\",\n        \"Brianna Julien, Melbourne, Australia\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzc3MCwicHVyIjoiYmxvYl9pZCJ9fQ==--35bbfd5b1086aa9c9cbbd8106989f72e445221cf/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Option-2-002-768x1024.jpeg\",\n    \"description\": \"'How To Do Science' has been written for students of the life sciences who are actively engaged in the scientific process. This guide introduces you to what it means to be a scientist. You will learn about the scientific method and how to carry out many tasks of a scientist, including: designing experiments, visualising data, accessing scientific literature, communicating science, and writing literature reviews.\",\n    \"publisher\": null,\n    \"language\": \"English\",\n    \"isbn13\": \"9780645326130\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/how-to-do-science\"\n}",
    "{\n    \"title\": \"Copy(write): Intellectual Property in the Writing Classroom\",\n    \"copyright_year\": \"2011\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Martine Courant Rife, Lansing Community College\",\n        \"Shaun Slattery, DePaul University and the University of South Florida Polytechnic\",\n        \"Dànielle Nicole DeVoss, Michigan State University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjM5LCJwdXIiOiJibG9iX2lkIn19--79a4ab03f989d779a5e5122772eebd9c8de1e78e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602352643.png\",\n    \"description\": \"The editors ofCopy(write): Intellectual Property in the Writing Classroombring together stories, theories, and research that can further inform the ways in which we situate and address intellectual property issues in our writing classrooms. The essays in the collection identify and describe a wide range of pedagogical strategies, consider theories, present research, explore approaches, and offer both cautionary tales and local and contextual successes that can further inform the ways in which we situate and address intellectual property issues in our teaching.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602352643\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/copy-write-intellectual-property-in-the-writing-classroom\"\n}",
    "{\n    \"title\": \"Why Do I Have to Take This Course? A Guide to General Education\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kisha G. Tracy, Fitchburg State University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI5NjEsInB1ciI6ImJsb2JfaWQifX0=--7a99e0e69d6b7075ecaa27bd35ac5d93f0504906/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover_RotelProject-FiSU_TakethisCourse-RE.jpg\",\n    \"description\": \"Why Do I Have to Take This Course? A Guide to General Education developed out of many years of thinking about general education courses and curriculums. We, as university personnel, do not always succeed in explaining why we have certain requirements. Even though these courses make up a significant percentage of our college careers, there is not often time set aside to talk about general education and explore its purpose and goals. When we do not know the reason why we are doing something, it can sometimes lead to apathy and even resentment. Once we have an idea of the purpose, then we can start to appreciate and learn. It is worthwhile to spend some time thinking about these purposes, both “official” and personal ones, in order to maximize student learning.This textbook helps students systematically study how general education requirements are developed, their history, post-graduation value, etc. It emphasizes exploration of the significance of individual learning outcomes, especially through the lens of John Lewis’ philosophy of “good, necessary trouble.” For instructors adopting this book, it is designed to assign in its entirety or in parts as instructors can choose to emphasize relevant learning outcomes. It is also designed for use by advisors, especially with advisees who express concerns over taking certain requirements.\",\n    \"publisher\": \"ROTEL\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/why-do-i-have-to-take-this-course-a-guide-to-general-education\"\n}",
    "{\n    \"title\": \"The Changing Story: digital stories that participate in transforming teaching & learning\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Linda Buturian, University of Minnesota\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE4LCJwdXIiOiJibG9iX2lkIn19--702e4b453dcf17b851b1531424be05f689b4a5dd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000TheChaSto.png\",\n    \"description\": \"The Changing Storygives you assignments, resources, and examples to use in your teaching and learning. It will also help you think of ways digital stories can be used in your teaching, and help students harness the power of visual storytelling.\",\n    \"publisher\": \"University of Minnesota Libraries Publishing\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-changing-story-digital-stories-that-participate-in-transforming-teaching-learning\"\n}",
    "{\n    \"title\": \"Design for Learning: Principles, Processes, and Praxis\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jason K. McDonald, Brigham Young University\",\n        \"Richard E. West, Brigham Young University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjAzOCwicHVyIjoiYmxvYl9pZCJ9fQ==--62b7aa6e1c1881176b0e0fe79b12f5c941567923/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/22_md_06-16-2020_121621.png\",\n    \"description\": \"Our purpose in this book is twofold. First, we introduce the basic skill set and knowledge base used by practicing instructional designers. We do this through chapters contributed by experts in the field who have either academic, research-based backgrounds, or practical, on-the-job experience (or both). Our goal is that students in introductory instructional design courses will be able to use this book as a guide for completing a basic instructional design project. We also hope the book is useful as a ready resource for more advanced students or others seeking to develop their instructional design knowledge and skills.\",\n    \"publisher\": \"EdTech Books\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/design-for-learning-principles-processes-and-praxis\"\n}",
    "{\n    \"title\": \"Reflective Practice in Early Years Education\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Sheryl Third, Fanshawe College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzY4OCwicHVyIjoiYmxvYl9pZCJ9fQ==--19b9daaa8f6f7351a9cdac2fc1cbc92198de8124/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/reflective_practice_cover_900x1200-768x1024.png\",\n    \"description\": \"This resource will provide a context that will allow the reader to consider their obligation to reflect from their own perspective and will explore how to create a practice that best suits their professional setting. This book will bring together in one place the history, the values, the skills and disposition required to be a reflective practitioner. It is a textbook with elements of a workbook, embedded are opportunities to watch, to think, to write, and to listen allowing the reader to become a purposeful and intentional reflective practitioner.\",\n    \"publisher\": \"Fanshawe College Pressboks\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/reflective-practice-in-early-years-education\"\n}",
    "{\n    \"title\": \"Teaching Methods & Practices\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": \"2023\",\n    \"authors\": [\n        \"Jason Proctor, Northeastern State University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2MTYsInB1ciI6ImJsb2JfaWQifX0=--dead7358720c4a8bbe92c638554ab26e54abcc86/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/glasses-5868861_1920-350x415.jpg\",\n    \"description\": \"This book is intended to serve as a resource for novice teachers as they master the art of effective classroom management, assessment, and lesson planning. At the undergraduate level, this book is designed to accompany the instruction in the EDUC 4353: Secondary Teaching Methods & Practices course before the full-internship experience. At the graduate level, this book is designed to support the instruction in the EDUC 5283: Teaching Methods course with a special focus on supporting Alternatively Certified Educators. Each chapter presents a component of the teaching and learning process critical for teacher development and describes how that component is relevant to the classroom.\",\n    \"publisher\": \"Open OCO\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-methods-practices\"\n}",
    "{\n    \"title\": \"Action Research\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"J. Spencer Clark, Kansas State University\",\n        \"Suzanne Porath, Kansas State University\",\n        \"Julie Thiele, Kansas State University\",\n        \"Morgan Jobe, Kansas State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMDIsInB1ciI6ImJsb2JfaWQifX0=--4538ce13298b73c99b75773276d8f2cbce1e25c5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/act.jpg\",\n    \"description\": \"Action research is a common journey for graduate students in education and other human science fields. This book attempts to meet the needs of graduate students, in-service teachers, and any other educators interested in action research and/or self-study. The chapters of this book draw on our collective experiences as educators in a variety of educational contexts, and our roles guiding educator/researchers in various settings. All of our experiences have enabled us to question and refine our own understanding of action research as a process and means for pedagogical improvement. The primary purpose of this book is to offer clear steps and practical guidance to those who intend to carry out action research for the first time. As educators begin their action research journey, we feel it is vital to pose four questions: 1) What is action research, and how is it distinct from other educational research?; 2) When is it appropriate for an educator to conduct an action research project in their context?; 3) How does an educator conduct an action research project?; 4) What does an educator do with the data once the action research project has been conducted? We have attempted to address all four questions in the chapters of this book.\",\n    \"publisher\": \"New Prairie Press\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781944548292\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/action-research\"\n}",
    "{\n    \"title\": \"Teaching in a Digital Age: Guidelines for designing teaching and learning - 2nd Edition\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": \"2019\",\n    \"authors\": [\n        \"A.W. (Tony) Bates, University of British Columbia\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTgwLCJwdXIiOiJibG9iX2lkIn19--680a24444936926ea82e0aae1cd23a0dc71c6a64/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/978099526921.png\",\n    \"description\": \"Teachers, instructors and faculty are facing unprecedented change, with often larger classes, more diverse students, demands from government and employers who want more accountability and the development of graduates who are workforce ready, and above all, we are all having to cope with ever changing technology. To handle change of this nature, teachers and instructors need a base of theory and knowledge that will provide a solid foundation for their teaching, no matter what changes or pressures they face.Although the book contains many practical examples, it is more than a cookbook on how to teach. It addresses the following questions:is the nature of knowledge changing, and how do different views on the nature of knowledge result in different approaches to teaching?what is the science and research that can best help me in my teaching?how do I decide whether my courses should be face-to-face, blended or fully online?what strategies work best when teaching in a technology-rich environment?what methods of teaching are most effective for blended and online classes?how do I make choices among all the available media, whether text, audio, video, computer, or social media, in order to benefit my students and my subject?how do I maintain high quality in my teaching in a rapidly changing learning environment while managing my workload?what are the real possibilities for teaching and learning using MOOCs, OERS, open textbooks?In summary, the book examines the underlying principles that guide effective teaching in an age when everyone, and in particular the students we are teaching, are using technology. A framework and a set of guidelines are suggested for making decisions about your teaching, while understanding that every subject is different, and every teacher and instructor has something unique and special to bring to their teaching.In the end, though, the book isn't really about teachers and instructors, although you are the target group. It's about you helping your students to develop the knowledge and skills they will need in a digital age: not so much digital skills, but the thinking and knowledge that will bring them success. For that to happen, though, your students need you to be on top of your game. This book is your coach.\",\n    \"publisher\": \"BCcampus\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-in-a-digital-age-guidelines-for-designing-teaching-and-learning-for-a-digital-age\"\n}",
    "{\n    \"title\": \"Foundations of American Education: A Critical Lens\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Melissa Wells\",\n        \"Courtney Clayton\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzA5NCwicHVyIjoiYmxvYl9pZCJ9fQ==--c1873fa2554e0f943d39586556c93c63c46b3e75/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/cover-683x1024%20(1).jpg\",\n    \"description\": \"In this survey text, readers will explore the foundations of American education through a critical lens. Topics include the teaching profession, influences on student learning, philosophical and historical foundations, structures of schools, ethical and legal issues, curriculum, classroom environment, and the path forward.\",\n    \"publisher\": \"VIVA\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/foundations-of-american-education-a-critical-lens\"\n}",
    "{\n    \"title\": \"Antiracist Writing Assessment Ecologies: Teaching and Assessing Writing for a Socially Just Future\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Asao B. Inoue, University of Washington Tacoma\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjMzLCJwdXIiOiJibG9iX2lkIn19--049b2cb74267637e4d34f844e8372f8c86c91332/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602357747.png\",\n    \"description\": \"InAntiracist Writing Assessment Ecologies,Asao B. Inoue theorizes classroom writing assessment as a complex system that is \\\"more than\\\" its interconnected elements. To explain how and why antiracist work in the writing classroom is vital to literacy learning, Inoue incorporates ideas about the white racial habitus that informs dominant discourses in the academy and other contexts. Inoue helps teachers understand the unintended racism that often occurs when teachers do not have explicit antiracist agendas in their assessments. Drawing on his own teaching and classroom inquiry, Inoue offers a heuristic for developing and critiquing writing assessment ecologies that explores seven elements of any writing assessment ecology: power, parts, purposes, people, processes, products, and places.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602357747\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/antiracist-writing-assessment-ecologies-teaching-and-assessing-writing-for-a-socially-just-future\"\n}",
    "{\n    \"title\": \"How to Learn Like A Pro\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Phyllis Nissila, Lane Community College\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzQzLCJwdXIiOiJibG9iX2lkIn19--e9d5ba48c6e8d39d3b259d71beb0ab11eda42dbe/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000HowToLear.png\",\n    \"description\": \"How to Learn Like a Pro!features the “big six” effective learning/study skills topics: learning styles and preferences, time and materials management, critical thinking and reading, note-taking, memory principles, and test-taking techniques. Each of the six units featuring a total of twenty-three lessons and accompanying exercises (with a dash of humor here and there) were developed with the diverse student body of the community college in mind as well as learners in other educational venues.\",\n    \"publisher\": \"Open Oregon Educational Resources\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/how-to-learn-like-a-pro\"\n}",
    "{\n    \"title\": \"Supporting Technology Integration for School Leaders\",\n    \"copyright_year\": null,\n    \"last_update\": null,\n    \"authors\": [\n        \"Howard Pitler, Emporia, Kansas\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQwOSwicHVyIjoiYmxvYl9pZCJ9fQ==--3712f2268affd667438fc08d1fac876a19dcf35a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/489_md_09-16-2022_194611.jpeg\",\n    \"description\": \"This Open Educational Resource (OER) textbook is written as the primary resource for a 3-hour graduate course delivered online by The Teachers College at Emporia State University. The course is designed to prepare school leaders (teachers, instructional coaches, administrators, etc.) for the integration and application of diverse educational technologies into classrooms and schools in ways that reflect a theoretical, research-based, and practical understanding of curriculum development and the effective uses of technology. The course explores practical ways to integrate technology into both teaching and learning and the critical importance of adequate training and professional development for successful integration. This intensive course is delivered completely online over a seven-week period using Canvas. Canvas is a web-based learning management system or LMS. It is used by learning institutions, educators, and students to access and manage online course learning materials and communicate skill development and learning achievement.\",\n    \"publisher\": \"EdTech Books\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/supporting-technology-integration-for-school-leaders\"\n}",
    "{\n    \"title\": \"Making Open Educational Resources with and for PreK12: A Collaboration Toolkit for Higher Education\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Anita R Walz, Virginia Tech\",\n        \"Julee P Farley, Virginia Tech\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEzNzcsInB1ciI6ImJsb2JfaWQifX0=--859684c466f2f12a82ed344c24af80e469fe98c5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Cover-PreK12.PNG\",\n    \"description\": \"Higher education and PreK12 are vastly different domains. As such, well-intended, collaborative efforts between higher education and PreK12 do not always result in creation of useful and reusable learning materials for PreK12 classrooms or effective, productive partnerships. Making Open Educational Resources with and for PreK12: A Collaboration Toolkit for Higher Education is a toolkit of instructional resources designed to support higher education personnel who wish to improve or build strong and generative collaborations between higher education and PreK12 educators. The toolkit aims to expand use and re-usability of PreK12-centric learning resources through informed practices regarding copyright, open-licensing, and accessibility and includes a variety of resources: videos, presentations, transcripts, activities, guides, assignments, and assessment tools.\",\n    \"publisher\": null,\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/making-open-educational-resources-with-and-for-prek12-a-collaboration-toolkit-for-higher-education\"\n}",
    "{\n    \"title\": \"Teaching Crowds: Learning and Social Media\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jon Dron, Athabasca University\",\n        \"Terry Anderson, Athabasca University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk0LCJwdXIiOiJibG9iX2lkIn19--10c5cbf1bbb6045c8c5a674c7f51af94237755f1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781927356814.png\",\n    \"description\": \"Within the rapidly expanding field of educational technology, learners and educators must confront a seemingly overwhelming selection of tools designed to deliver and facilitate both online and blended learning. Many of these tools assume that learning is configured and delivered in closed contexts, through learning management systems (LMS). However, while traditional \\\"classroom\\\" learning is by no means obsolete, networked learning is in the ascendant. A foundational method in online and blended education, as well as the most common means of informal and self-directed learning, networked learning is rapidly becoming the dominant mode of teaching as well as learning.InTeaching Crowds, Dron and Anderson introduce a new model for understanding and exploiting the pedagogical potential of Web-based technologies, one that rests on connections — on networks and collectives — rather than on separations. Recognizing that online learning both demands and affords new models of teaching and learning, the authors show how learners can engage with social media platforms to create an unbounded field of emergent connections. These connections empower learners, allowing them to draw from one another's expertise to formulate and fulfill their own educational goals. In an increasingly networked world, developing such skills will, they argue, better prepare students to become self-directed, lifelong learners.\",\n    \"publisher\": \"Athabasca University Press\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781927356814\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-crowds-learning-and-social-media\"\n}",
    "{\n    \"title\": \"Romeo and Juliet\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Rebecca Olson, Oregon State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjI2OCwicHVyIjoiYmxvYl9pZCJ9fQ==--3f59d4dbd614c441ab5b89050209ba9d2d509e2e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/FINAL-COVER-Romeo-and-Juliet-1.jpg\",\n    \"description\": \"This edition ofRomeo and Julietwas edited by students for students. We believe that reliably edited versions of the play should be available for free online. But we wanted ours to be easy to get in other ways as well. The editors—Oregon State University students who remember, far better than their professors, what it was like to read the play for the first time—carefully considered every pronoun, punctuation mark, and footnote. Our goal: to make a friendly, confidence-building edition that supported classroom activities at the high school and college level.\",\n    \"publisher\": \"Oregon State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/romeo-and-juliet\"\n}",
    "{\n    \"title\": \"Intersections of Open Educational Resources and Information Literacy\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Mary Ann Cullen, Alpharetta, Georgia\",\n        \"Elizabeth Dill, Hartford, Connecticut\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDE1MiwicHVyIjoiYmxvYl9pZCJ9fQ==--b70b7ab05c4496588787abf7052d3db1f5bc8a48/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9780838936740_PIL79_OA%20(dragged).jpg\",\n    \"description\": \"\\\"The present volume is timely not only because it models creative and effective strategies to advance both open education and information literacy, but especially because it poses critical questions and urges practitioners to go well beyond questions of access to and the use of information. It demands reflection on what is being accessed (and what is not), who is gaining access (and who is not), who is providing access (and who is not), and what the goal is of this access (and what lies beyond access).\\\"—from the Foreword by Rajiv S. Jhangiani Information literacy skills are key when finding, using, adapting, and producing open educational resources (OER). Educators who wish to include OER for their students need to be able to find these resources and use them according to their permissions. When open pedagogical methods are employed, students need to be able to use information literacy skills as they compile, reuse, and create open resources.Intersections of Open Educational Resources and Information Literacycaptures current open education and information literacy theory and practice and provides inspiration for the future. Chapters include practical applications, theoretical musings, literature reviews, and case studies and discuss social justice issues, collaboration, open pedagogy, training, and advocacy. The book is divided into six parts:FoundationsTeaching Info Lit with OERLibrarian Support of Open Pedagogy/OERSocial Justice/Untold StoriesStudent AdvocacySpreading the Love: Training Future Advocates and PractitionersChapters cover topics including library-led OER creation; digital cultural heritage and the intersections of primary source literacy and information literacy; situated learning and open pedagogy; critical librarianship and open education; and developing student OER leaders.Intersections of Open Educational Resources and Information Literacy—which went through an open peer review process—informs and inspires on OER, info lit, and their many iterative convergences. It is available as an open access edition athttps://bit.ly/ACRLOERInfoLit.\",\n    \"publisher\": \"Association of College and Research Libraries\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/intersections-of-open-educational-resources-and-information-literacy\"\n}",
    "{\n    \"title\": \"Cataloging with MARC, RDA, and Classification Systems\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Reed Hepler, College of Southern Idaho\",\n        \"David Horalek, College of Southern Idaho\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTMzMSwicHVyIjoiYmxvYl9pZCJ9fQ==--114735b86439dce4a182c424dd9d49bae15cfdd6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/David-Horalek-350x513.jpg\",\n    \"description\": \"This book goes over a wide range of cataloging schemata, tools, and norms. It presents a concise but thorough view of the basics of library cataloging practice.\",\n    \"publisher\": \"College of Southern Idaho Pressbooks Network (CSI)\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/cataloging-with-marc-rda-and-classification-systems\"\n}",
    "{\n    \"title\": \"Reframing Digital Humanities: Conversations with Digital Humanists\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Julian Chambliss, East Lansing, MI\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM2OSwicHVyIjoiYmxvYl9pZCJ9fQ==--0a86773aaca8264aff6d4ae9a8f5a7ca36b661d9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Reframing-Cover-B_Logo-2-642x1024.png\",\n    \"description\": \"Growing from Reframing History, a podcast about history theory and practice, Reframing Digital Humanities: Conversations with Digital Humanists,Julian Chambliss, Professor ofEnglishat Michigan State University, brings together a diverse group of digital humanities practitioners to reflect on theory and practice. From the question of public engagement and knowledge production to considerations of identity and cultural production, the conversations presented in this work shed light on the ways digital humanities offer scholars tools to ask humane questions. Are the benefits promised being achieved? Are the right tools and training available? Are we asking the right questions? In this volume, scholars deeply engaged in using digital tools reflect on their work and this dynamic academic field.\",\n    \"publisher\": \"Michigan State University\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781626101036\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/reframing-digital-humanities-conversations-with-digital-humanists\"\n}",
    "{\n    \"title\": \"Estrategias de enseñanza - aprendizaje en la educación superior: Una experiencia en la ESPOCH\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": \"2023\",\n    \"authors\": [\n        \"Norma del Rocío Toledo Castillo, Escuela Superior Politécnica de Chimborazo\",\n        \"Norma Yolanda Villacís Venegas, Escuela Superior Politécnica de Chimborazo, Sede Morona Santiago\",\n        \"Isabel Romané Peñafiel Moncayo, Escuela Superior Politécnica de Chimborazo\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTMyMiwicHVyIjoiYmxvYl9pZCJ9fQ==--52ac5c61f934e03e076fdcb9cb3fb69f729297eb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screenshot%202023-08-18%20at%2012.12.52%20PM.png\",\n    \"description\": \"Los cambios experimentados en los últimos años en el contexto científico-tecnológico y educativo, han revolucionado las formas de pensar y actuar. Ante esto la comunidad educativa en los diferentes niveles de enseñanza, incluyendo la Educación Superior, se han visto en la necesidad de repensar y adaptar las estrategias de enseñanza-aprendizaje para poder dar respuestas a la diversidad existente en cada grupo escolar y nivel de enseñanza.En el caso de la Educación Superior lo expuesto a presupuesto no sólo, el diseño de nuevos modelos educativos y curriculares, sino también ha implicado un hacer pedagógico y didáctico diferente, frente a un alumnado permeado por los avances tecnológicos, con aspiraciones y necesidades cada vez más creciente. Es por ello que el hecho de enseñar en los tiempos modernos en el contexto de la Educación Superior exige contar con un profesorado altamente calificado, preparado y competente, capaz de hacer frente a un proceso de enseñanza-aprendizaje donde los estudiantes deben ser gestores de su propio aprendizaje y los docentes facilitadores de las estrategias de enseñanza para el logro de un aprendizaje que fomente la formación integral y la preparación para la inserción laboral de forma adecuada.\",\n    \"publisher\": \"Ciencia Digital Editorial\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/estrategias-de-ensenanza-aprendizaje-en-la-educacion-superior-una-experiencia-en-la-espoch\"\n}",
    "{\n    \"title\": \"Teaching Math for Emergent Bilinguals: Building on Culture, Language, and Identity\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Ji-Yeong I, Iowa State University\",\n        \"Ricardo Martinez, Iowa State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjc5NywicHVyIjoiYmxvYl9pZCJ9fQ==--7d59bdd8b8b7fe4c98960b7058f971d065f8dffd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/I-TeachingMath-Cover3-v2-350x453.png\",\n    \"description\": \"This book is designed for pre-service/in-service teachers and others who will work or work with K–12 students who have linguistically and culturally diverse backgrounds, especially students of other languages (English language learners/Emergent bilingual/multilingual). The core concept of this course is helping teachers understand the needs of various Emergent Bilinguals (a.k.a. English language learners (ELLs)/English Learners (ELs), learn to use their language and culture as a resource in mathematics classrooms and implement research-based instructional strategies that are effective to teach mathematics for Emergent Bilinguals.\",\n    \"publisher\": \"Iowa State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-math-for-emergent-bilinguals-building-on-culture-language-and-identity\"\n}",
    "{\n    \"title\": \"Sharing Our Knowledge: Best Practices for Supporting English Language Learners in Schools\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Nadia Prokopchuk, University of Saskatchewan\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzQxLCJwdXIiOiJibG9iX2lkIn19--0591c2a40ec6032c5d195a9eaf6781177fc8cac5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000ShaKnoEng.jpg\",\n    \"description\": \"To complete the courseECUR 415.3: Current Issues in EAL, students are required to submit a final paper that reflects their growing knowledge about English as an Additional Language (EAL). EAL is the term used in Saskatchewan to describe students who speak languages other than English and require adequate levels of English to be successful with the school curriculum.Most students enrolled in the online course ECUR 415 are practicing teachers who are working toward aPost-Degree Certificate in EAL Education(PDCEAL), while continuing to live and work in various locations both within and outside of the province. The certificate program, offered through the College of Education, University of Saskatchewan, is recognized by provincial education authorities as being equivalent to one full year of post-degree study. As such, the certificate equips teachers with the knowledge and expertise to be considered teacher-specialists of EAL Education. The course ECUR 415 also attracts some pre-service teachers who are pursuing a Bachelor of Education degree and have an interest in EAL Education.\",\n    \"publisher\": \"OPENPRESS.USASK.CA\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/sharing-our-knowledge-best-practices-for-supporting-english-language-learners-in-schools\"\n}",
    "{\n    \"title\": \"Bad Ideas About Writing\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Cheryl E Ball\",\n        \"Drew M Loewe\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzUxLCJwdXIiOiJibG9iX2lkIn19--df5b0df79ff6418ffb094b9b3bec1701273ac9d4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/978-0-9988820-0-0.png\",\n    \"description\": \"We intend this work to be less a bestiary of bad ideas about writing than an effort to name bad ideas and suggest better ones. Some of those bad ideas are quite old, such as the archetype of the inspired genius author, the five-paragraph essay, or the abuse of adjunct writing teachers. Others are much newer, such as computerized essay scoring or gamification. Some ideas, such as the supposed demise of literacy brought on by texting, are newer bad ideas but are really instances of older bad ideas about literacy always being in a cycle of decline. Yet the same core questions such as what is good writing, what makes a good writer, how should writing be assessed, and the like persist across contexts, technologies, and eras. The project has its genesis in frustration, but what emerges is hope: hope for leaving aside bad ideas and thinking about writing in more productive, inclusive, and useful ways.\",\n    \"publisher\": \"West Virginia University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/bad-ideas-about-writing\"\n}",
    "{\n    \"title\": \"Qualitative Research – a practical guide for health and social care researchers and practitioners\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Darshini Ayton, Monash University\",\n        \"Tess Tsindos, Monash University\",\n        \"Danielle Berkovic, Monash University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMjYsInB1ciI6ImJsb2JfaWQifX0=--d54c866d532d1a315fe90a1b9b2f6f91161c83aa/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/qual-researchLOGO-350x525.jpg\",\n    \"description\": \"This guide is designed to support health and social care researchers and practitioners to integrate qualitative research into the evidence base of health and social care research. Qualitative research designs are diverse and each design has a different focus that will inform the approach undertaken and the results that are generated. The aim is to move beyond the “what” of qualitative research to the “how”, by (1) outlining key qualitative research designs for health and social care research – descriptive, phenomenology, action research, case study, ethnography, and grounded theory; (2) a decision tool of how to select the appropriate design based on a guiding prompting question, the research question and available resources, time and expertise; (3) an overview of mixed methods research and qualitative research in evaluation studies; (4) a practical guide to data collection and analysis; (5) providing examples of qualitative research to illustrate the scope and opportunities; and (6) tips on communicating qualitative research.\",\n    \"publisher\": \"Monash University\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780645755404\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/qualitative-research-a-practical-guide-for-health-and-social-care-researchers-and-practitioners\"\n}",
    "{\n    \"title\": \"Conventions 101: A Functional Approach to Teaching (And Assessing!) Grammar and Punctuation\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Chauna Ramsey, Columbia Gorge Community College\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk3LCJwdXIiOiJibG9iX2lkIn19--4c00a5b76a2e36172e653d81430053396c6c7b73/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Conventio.png\",\n    \"description\": \"This is a collection of cumulative units of study for conventional errors common in student writing. It's flexible, functional, and zeroes in problems typically seen in writing of all types, from the eternal “there/they're/their” struggle to correct colon use. Units are organized from most simple to most challenging.\",\n    \"publisher\": \"Open Oregon Educational Resources\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/conventions-101-a-functional-approach-to-teaching-and-assessing-grammar-and-punctuation\"\n}",
    "{\n    \"title\": \"Opening Eyes onto Inclusion and Diversity\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Susan Carter, Toowoomba, Australia\",\n        \"Lindy Abawi, Toowoomba, Australia\",\n        \"Jill Lawrence, Toowoomba, Australia\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzc0MCwicHVyIjoiYmxvYl9pZCJ9fQ==--7cbec32ad3472a840a0ebc604070fcb2e1636822/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/cover-350x525.jpeg\",\n    \"description\": \"Susan Carter; Professor Lindy-Anne Abawi; Professor Jill Lawrence; Associate Professor Charlotte Brownlow; Renee Desmarchelier; Melissa Fanshawe; Kathryn Gilbey; Michelle Turner; and Jillian Guy\",\n    \"publisher\": \"University of Southern Queensland\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780648769804\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/opening-eyes-onto-inclusion-and-diversity\"\n}",
    "{\n    \"title\": \"Habilidades Perceptivas: Mejorando el Aprendizaje Remoto en Estudiantes de 5 años\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Esther Glory Terrazo-Luna, Universidad Nacional de Huancavelica\",\n        \"Daker Riveros-Anccasi, Universidad Nacional de Huancavelica\",\n        \"Christian Luis Torres-Acevedo, Universidad Nacional de Huancavelica\",\n        \"Angel Epifanio Rojas-Quispe, Universidad Nacional de Huancavelica\",\n        \"Abraham Cencho-Pari, Universidad Nacional de Huancavelica\",\n        \"Jessica Coronel-Capani, Universidad Nacional de Huancavelica\",\n        \"Russbelt Yaulilahua-Huacho, Universidad Nacional de Huancavelica\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTMyOCwicHVyIjoiYmxvYl9pZCJ9fQ==--95b4ce2d345f390fe6125c917607c7a6e5348db8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_30_30_coverImage_es_ES.png\",\n    \"description\": \"La presente investigación tuvo como objetivo determinar el nivel de relación entre las habilidades perceptivas y el aprendizaje de la matemática de los niños y las niñas de 5 años de una Institución Educativa de Huancavelica, en la educación remota. El diseño empleado fue el correlacional y la muestra lo conformaron 46 estudiantes de 5 años de una institución de educación inicial de Huancavelica. Los instrumentos empleados fueron, la lista de cotejo para cada variable con 30 ítems. Los resultados evidencian que existe relación estadísticamente significativa entre las habilidades perceptivas y el aprendizaje de la matemática en los estudiantes de 5 años de una institución educativa de Huancavelica, en la educación remota. Estos resultados cuantitativos, con un r=0.75, representan una correlación positiva moderada, según el cuadro de índices de correlación de Hernández, Fernández y Baptista (2018)\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/habilidades-perceptivas-mejorando-el-aprendizaje-remoto-en-estudiantes-de-5-anos\"\n}",
    "{\n    \"title\": \"A Handbook of Higher Education Leadership\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Ed Ray, Oregon State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE0NDUsInB1ciI6ImJsb2JfaWQifX0=--89d1c36fce0e3b8ab9f61a929262caef00afc3c0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Cover-Handbook-of-Higher-Education-Leadership-350x453.png\",\n    \"description\": \"Thirty-five experienced and accomplished higher education leaders have come together to provide twenty-five essays on twelve topics about which all leaders, aspiring leaders and students of higher education should be informed. This is a labor of love, provided for free electronically, and there are no star turns here. Each essay is focused on providing the reader with advice based on wisdom acquired from lessons learned. Some topics covered include: beginning and completing a leadership position, responding to authority, establishing accountability, budget policy, long-term planning, affordability and student success, creating a safe community, fundraising, research funding, college athletics, and crisis management.\",\n    \"publisher\": \"Oregon State University\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781955101394\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/a-handbook-of-higher-education-leadership\"\n}",
    "{\n    \"title\": \"The Art and Science of Teaching Agriculture: Four Keys to Dynamic Learning\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"M. Susie Whittington, The Ohio State University\",\n        \"Rick Rudd, Virginia Tech\",\n        \"Jack Elliot, Texas A&M University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQzMywicHVyIjoiYmxvYl9pZCJ9fQ==--8c4890c0cc7bab70f1ab178a8321ac53ec8104cd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Cover-ArtScienceTeachingAg.PNG\",\n    \"description\": \"The Art and Science of Teaching Agriculture: Four Keys to Dynamic Learningis a methods of teaching book. Specifically, it is a collection of thoughts, best practices, strategies, and techniques for planning, delivering, and assessing teaching and learning. This resource is assembled from among the best teaching professors in agricultural communication, education, and leadership in America. They have narrated their favorite class sessions … sessions chosen with the goal of making us all better teachers.You will quickly grasp the four fundamental keys of solid, basic, time-tested formal and nonformal teaching: Laying the Foundation, Connecting with Students, Designing Instruction, and Applying Learning. These keys are shared with you through the unique voices of the authors to provide a multiperspective approach to teaching.The authors offer both secondary and postsecondary educators in both formal and nonformal educational environments the opportunity to build confidence in planning, delivering, and assessing the depths of the variables inherent in learning.You will acquire the foundation to teach so your learners can learn dynamically.Are you reviewing or adopting this book for a course? Please help us understand your use by filling out this form:https://bit.ly/teachagriculture_interest\",\n    \"publisher\": \"Virginia Tech Publishing\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-art-and-science-of-teaching-agriculture-four-keys-to-dynamic-learning\"\n}",
    "{\n    \"title\": \"Supporting Secondary Teachers’ Critical Disciplinary Literacies\",\n    \"copyright_year\": null,\n    \"last_update\": null,\n    \"authors\": [\n        \"Jeanne Dyches, Iowa State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjU0NSwicHVyIjoiYmxvYl9pZCJ9fQ==--dfcc76d72a0bd3f6c59f0db349eefdf0134f5596/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/criticaldisciplinaryliteracies-cover-768x994.png\",\n    \"description\": \"Co-created with students in the course EDUC 395: Teaching Disciplinary Literacy and supported by CDL experts, this textbook offers accessible, research-based, multidisciplinary CDL strategies ready for implementation in secondary classrooms.\",\n    \"publisher\": \"Iowa State University Digital Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/supporting-secondary-teachers-critical-disciplinary-literacies\"\n}",
    "{\n    \"title\": \"Making Ripples: A Guidebook to Challenge Status Quo in OER Creation\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kaitlin Schilling, Rebus Community\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTgzMCwicHVyIjoiYmxvYl9pZCJ9fQ==--8f84b8ed92490768d895b5942d6d5d30b7bbe22b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Front-Cover-350x453.png\",\n    \"description\": \"Making Ripples: A Guidebook to Challenge Status Quo in OER Creationis a short resource designed to expand your understanding of inequities in the educational systems through breaking down the work into smaller pieces with opportunities for you to reflect, identify strategies for action, and locate resources and community members to connect with. The purpose of this guide is to explore strategies for you as OER creators to incorporate equitable practices into your workflows.\",\n    \"publisher\": \"Rebus Community\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781989014318\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/making-ripples-a-guidebook-to-challenge-status-quo-in-oer-creation\"\n}",
    "{\n    \"title\": \"Open Music Theory - Version 2\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Mark Gotham\",\n        \"Kyle Gullings\",\n        \"Chelsey Hamm\",\n        \"Bryn Hughes\",\n        \"Brian Jarvis\",\n        \"Megan Lavengood\",\n        \"John Peterson\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDEzNywicHVyIjoiYmxvYl9pZCJ9fQ==--356fe49ac8f677133f57d1c73ba7285ee38de24c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/OMT-cover-lower-res-1-683x1024.png\",\n    \"description\": \"Open Music Theory is a natively-online open educational resource intended to serve as the primary text and workbook for undergraduate music theory curricula.OMT2provides not only the material for a complete traditional core undergraduate music theory sequence (fundamentals, diatonic harmony, chromatic harmony, form, 20th-century techniques), but also several other units for instructors who have diversified their curriculum, such as jazz, popular music, rhythm, counterpoint, and orchestration. This version also introduces a complete workbook of assignments.\",\n    \"publisher\": \"Virtual Library of Virginia\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/open-music-theory\"\n}",
    "{\n    \"title\": \"Chinese Rhetoric and Writing: An Introduction for Language Teachers\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Andy Kirkpatrick, Griffith University\",\n        \"Zhichang Xu, Monash University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjM3LCJwdXIiOiJibG9iX2lkIn19--42b30a0e8bb0172835aa03665a96aad08dde4da8/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602353022.png\",\n    \"description\": \"The authors ofChinese Rhetoric and Writingoffer a response to the argument that Chinese students' academic writing in English is influenced by \\\"culturally nuanced rhetorical baggage that is uniquely Chinese and hard to eradicate.\\\" Noting that this argument draws from \\\"an essentially monolingual and Anglo-centric view of writing,\\\" they point out that the rapid growth in the use of English worldwide calls for \\\"a radical reassessment of what English is in today's world.\\\" The result is a book that provides teachers of writing, and in particular those involved in the teaching of English academic writing to Chinese students, an introduction to key stages in the development of Chinese rhetoric, a wide-ranging field with a history of several thousand years. Understanding this important rhetorical tradition provides a strong foundation for assessing and responding to the writing of this growing group of students.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602353022\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/chinese-rhetoric-and-writing-an-introduction-for-language-teachers\"\n}",
    "{\n    \"title\": \"Introduction to Education (BETA)\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jennifer Beasley, University of Arkansas\",\n        \"Myra Haulmark, University of Arkansas\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjg3NSwicHVyIjoiYmxvYl9pZCJ9fQ==--610ae2163db8ea48f5d668170759f279a8d53c6e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Intro-cover-683x1024.png\",\n    \"description\": \"This book was written to provide students with an introduction to the field of education. The book is broken into chapters that focus on questions students may have about education in general. Although some chapters may go into more depth than others, this is created as an introductory text.\",\n    \"publisher\": \"University of Arkansas\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-education-beta\"\n}",
    "{\n    \"title\": \"Wellbeing in Educational Contexts - Second Edition\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Susan Carter\",\n        \"Cecily Andersen\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Njg1LCJwdXIiOiJibG9iX2lkIn19--9bcb95090bc770934f3b71f4277fe0c32b27cbf9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000WelEduCon.jpg\",\n    \"description\": \"This text endeavours to focus on wellbeing promotion in educational contexts as schools and other educational contexts play a pivotal role in teaching students about nonviolence, promoting understanding of diversity, endowing people with a shared purpose and meaning and the skills and behaviours to create a more inclusive, healthy, and positive future.\",\n    \"publisher\": \"University of Southern Queensland\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780645679649\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/wellbeing-in-educational-contexts\"\n}",
    "{\n    \"title\": \"Making Sense of Digital Humanities\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Julian Chambliss, East Lansing, MI\",\n        \"Ellen Moll, East Lansing, MI\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM2OCwicHVyIjoiYmxvYl9pZCJ9fQ==--6edd5bec3e20eaf6cd6b1e204916eebabe1633d9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Making-Sense-of-Digital-Humanities-683x1024.jpeg\",\n    \"description\": \"Taking up the challenge of navigating the complex world of digital humanities,Making Sense of Digital Humanitiesoffers readers an exploration of the many ways scholars have employed the diverse toolkit of digital humanities to create a better understanding of the synergies and disruptions created by technological change. Rooted in a concern for the daunting tasks associated with teaching and learning about the digital humanities, this volume hopes to provide easy entry into a complex topic while highlighting how an understanding of digital humanities can transform our thinking about technology in the modern world.\",\n    \"publisher\": \"Michigan State University\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781626101210\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/making-sense-of-digital-humanities\"\n}",
    "{\n    \"title\": \"Introduction to Library and Information Science\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Reed Hepler, College of Southern Idaho\",\n        \"David Horalek, College of Southern Idaho\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Njk2MCwicHVyIjoiYmxvYl9pZCJ9fQ==--86b3eb70d9d8ec81ddada6787334df04af1b052c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Introduction%20to%20Library%20and%20Information%20Science.png\",\n    \"description\": \"This book explores the history, present, and future of library science, both in theory and in practice. It examines the place of the librarian as arbiter of information access in a constantly-changing and modernizing global community.\",\n    \"publisher\": \"College of Southern Idaho Pressbooks Network (CSI)\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-library-and-information-science\"\n}",
    "{\n    \"title\": \"Salón de Clase: Intermediate Spanish for Education Professionals\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Fernando Castro Ortiz, University of Iowa\",\n        \"Giovanni Zimotti, University of Iowa\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzM1OCwicHVyIjoiYmxvYl9pZCJ9fQ==--4a8c8beff3412d5ca0481a704e9069df235a078c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Cover-Final-677x1024.png\",\n    \"description\": \"Salón de clase, Intermediate Spanish for Education Professionals is a comprehensive intermediate Spanish open access textbook with reading, listening, speaking, and writing practice for students who have an interest and/or intend to pursue a career in the field of Education (teachers, administrators, counselors, psychologists, social workers, support staff members, paraprofessionals, among others). This Open Education Resource (OER) aims to explore the role of Spanish language and Spanish speakers in the American education system, as well as to improve student communicative abilities in Spanish. Salón de clase integrates interactive activities (h5p), video interviews with Spanish speakers to present authentic materials, and topics related to education. Grammar is not presented as a standalone topic, but it is seemly integrated into all parts of this book.\",\n    \"publisher\": \"University of Iowa\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/salon-de-clase-intermediate-spanish-for-education-professionals\"\n}",
    "{\n    \"title\": \"Foundations of Educational Technology\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Penny Thompson, Oklahoma State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk0MywicHVyIjoiYmxvYl9pZCJ9fQ==--82572bd733a064d8cb9f322698048f5420f0055a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Thompson.PNG\",\n    \"description\": \"This text provides a a graduate level introduction to the field of educational technology.\",\n    \"publisher\": null,\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/foundations-of-educational-technology\"\n}",
    "{\n    \"title\": \"Critical Thinking in Academic Research - Second Edition\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": \"2023\",\n    \"authors\": [\n        \"Cindy Gruwell, University of West Florida\",\n        \"Robin Ewing, St. Cloud State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQxNCwicHVyIjoiYmxvYl9pZCJ9fQ==--9fa5a42af342cbe8a1c0b42047ef9189e92e358f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Critical-Thinking-in-Academic-Research2nd-350x529.png\",\n    \"description\": \"Critical Thinking in Academic Research - 2nd Editionprovides examples and easy-to-understand explanations to equip students with the skills to develop research questions, evaluate and choose the right sources, search for information, and understand arguments. This 2nd Edition includes new content based on student feedback as well as additional interactive elements throughout the text.\",\n    \"publisher\": \"Minnesota State Colleges and Universities\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/critical-thinking-in-academic-research\"\n}",
    "{\n    \"title\": \"Open Research\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Rebecca Pitt, Institute of Educational Technology at the Open University\",\n        \"Beatriz de los Arcos, Institute of Educational Technology at the Open University\",\n        \"Rob Farrow, Institute of Educational Technology at the Open University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzgwLCJwdXIiOiJibG9iX2lkIn19--52da451fe1bca5e09abfa1ecdf48f97ecd6fac9e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000OpenSearc.png\",\n    \"description\": \"If you have an interest in openness, open education, research skills or want to find out more about the impact of Open EducationalResources (OER), then this resource is for you. You could be:Using an OER with students and interested in assessing its impactFacilitating sessions on open practice with students or colleagues and looking for inspirationWorking on a research project and wanting to find out more about incorporating open research techniques into your own practiceCurious about the benefits and challenges of open researchLooking to use open tools in your researchWanting increased impact for your researchInterested in open research on OERThis resource will help you explore what open research is, how you can ethically and openly share your findings so others can reuse or develop your work, and the role of reflection and open dissemination. Whilst many challenges and issues apply to all aspects of research (for example: choosing an appropriate methodology), open research brings a range of different opportunities and challenges; it's these that we are specifically interested in exploring. What can openness add to the  research process?\",\n    \"publisher\": \"OER Hub\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/open-research\"\n}",
    "{\n    \"title\": \"Comprehensive Individualized Curriculum and Instructional Design: Curriculum and Instruction for Students with Developmental Disabilities/Autism Spectrum Disorders\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Samuel Sennott, Portland State University\",\n        \"Sheldon Loman, Portland State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkxLCJwdXIiOiJibG9iX2lkIn19--bb16fdc070242fb41e60fafcb4aea42e4b6dbb58/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781312886872.png\",\n    \"description\": \"This open textbook addresses the population of individuals with disabilities that experience complex lifelong needs across multiple areas in their lives. Drs. Sennott and Loman drafted this book (along with the help from some friends) with the hope of providing pertinent, practical, and current resources to future special educators who plan to serve individuals with complex disabilities.\",\n    \"publisher\": \"Portland State University Library\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781312886872\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/comprehensive-individualized-curriculum-and-instructional-design-curriculum-and-instruction-for-students-with-developmental-disabilities-autism-spectrum-disorders\"\n}",
    "{\n    \"title\": \"Designing Arguments for Academic, Public, and Professional Audiences - Fourteenth Edition\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Phillip Marzluf, Kansas State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTExOTYsInB1ciI6ImJsb2JfaWQifX0=--f87e1210b0543143d794f450f08ca09c0fb33c6e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/design.jpg\",\n    \"description\": \"This college-level textbook guides students through five different types of arguments: evaluations, responses, persuasive rhetorical arguments, proposals, and practical professional development arguments. Students are introduced to rhetorical concepts and strategies to enable them to more effectively appeal to different types of audiences. Students will gain practice in audience-based reasoning, basing their reasons and evidence on the assumptions, beliefs, and values of their readers.\",\n    \"publisher\": \"New Prairie Press\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781944548360\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/designing-arguments-for-academic-public-and-professional-audiences\"\n}",
    "{\n    \"title\": \"Children, Families, Schools, and Communities [Revised Edition]\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Joan Giovannini, Holyoke Community College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMzMjUsInB1ciI6ImJsb2JfaWQifX0=--17a6c144c6035b54b773919a073498a5f750e790/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover_RotelProject_HCC-ChildrenFamilies-RE-JoanG..jpg\",\n    \"description\": \"Children, Families, Schools, and Communities is an introductory text in the field of Child and Family Studies.  It provides a lens for understanding the evolving definition of “family” through socially constructed and ecological theory frameworks.   It promotes strategies for culturally sustaining and deeply collaborative relationships between families, schools, and communities through the use of home-grown advocacy strategies based on community-driven data.  Children, Families, Schools, and Communities is an adapted OER text from Rebecca Laff’s and Wendy Ruiz’sChild, Family, and Community.\",\n    \"publisher\": \"ROTEL\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/children-families-schools-and-communities\"\n}",
    "{\n    \"title\": \"The ELC: An Early Childhood Learning Community at Work\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Heather Bridge\",\n        \"Lorraine Melita\",\n        \"Patricia Roiger\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMwMCwicHVyIjoiYmxvYl9pZCJ9fQ==--dcadf9a2508e8077a4e47e9863e876549d7615cd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/ELC.png\",\n    \"description\": \"The ELC professional development model was designed to improve the quality of teacher candidates’ Practicum field placements and align teaching in field placements with Learning Standards used in the teacher education program.Teams of four educators from varied settings worked in a Practicum placement setting for one semester to improve their teaching and align it with Learning Standards. An action research approach improved teaching challenges teams faced. Research articles were read to improve teams’ teaching challenges by implementing one agreed strategy. Teams video-recorded, assessed, and reflected on the impact of the strategy on their teaching, on teacher candidates’ learning and on children’s learning.This text compiles six case studies from this model to illustrate how teaching challenges were improved. Appropriate for practiced educators as well as educators in training, this text provides a real world look into applying Learning Standards in early childhood classrooms.\",\n    \"publisher\": \"Open SUNY\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-elc-an-early-childhood-learning-community-at-work\"\n}",
    "{\n    \"title\": \"Design Discourse: Composing and Revising Programs in Professional and Technical Writing\",\n    \"copyright_year\": \"2010\",\n    \"last_update\": null,\n    \"authors\": [\n        \"David Franke, SUNY Cortland\",\n        \"Alex Reid, University at Buffalo\",\n        \"Anthony Di Renzo, Ithaca College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjQwLCJwdXIiOiJibG9iX2lkIn19--2b6999326c097942680472a9f021e3589eeb99b3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602351677.png\",\n    \"description\": \"Design Discourse: Composing and Revising Programs in Professional and Technical Writing, edited byDavid Franke, Alex Reid, andAnthony Di Renzo,addresses the complexities of developing professional and technical writing programs. The essays in the collection offer reflections on efforts to bridge two cultures — what the editors characterize as the \\\"art and science of writing\\\" — often by addressing explicitly the tensions between them. Design Discourse offers insights into the high-stakes decisions made by program designers as they seek to \\\"function at the intersection of the practical and the abstract, the human and the technical.\\\"\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602351677\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/design-discourse-composing-and-revising-programs-in-professional-and-technical-writing\"\n}",
    "{\n    \"title\": \"Comprendiendo la Lectura: Del Nivel Literal al Crítico en Estudiantes de EBA\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Amancia María Pacheco-Altamirano, Universidad Nacional de Huancavelica\",\n        \"Alvaro Ignacio Camposano-Córdova, Universidad Nacional de Huancavelica\",\n        \"Christian Luis Torres-Acevedo, Universidad Nacional de Huancavelica\",\n        \"Juan José Oré-Rojas, Universidad Nacional de Huancavelica\",\n        \"Júber Amílcar Gavidia-Anticona, Universidad Nacional de Huancavelica\",\n        \"Yeni Yauri-Huiza, Universidad Nacional de Huancavelica\",\n        \"Ángel Epifanio Rojas-Quispe, Universidad Nacional de Huancavelica\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Elementary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxMDUsInB1ciI6ImJsb2JfaWQifX0=--24a4c3700f37b3fbf356e98134ef5c1133323aec/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_40_40_coverImage_es_ES.jpg\",\n    \"description\": \"Este libro de investigación trata sobre que los momentos de la lectura mejoran la comprensión lectora en los niveles literal, inferencial y crítico de los estudiantes del segundo grado “E” del ciclo avanzado del CEBA “Politécnico Regional del Centro”- Huancayo, es de naturaleza cuantitativa, tipo aplicada, diseño pre experimental, con pre test y pos test en un solo grupo, muestra no probabilística. Se aplicó un pre test para diagnosticar su comprensión de textos, luego una propuesta experimental basada en la estrategia los momentos de la lectura de Isabel Solé y un post test para determinar los efectos. Se demostró estadísticamente que la aplicación de esta estrategia permite mejorar significativamente la comprensión lectora en el nivel literal, inferencial y crítico. Esto se fundamenta porque en el pre test la mayoría de estudiantes alcanzó calificaciones inferiores a 10 (escala vigesimal); pero, en el post test la mayoría superó este promedio en estos niveles. En el calculó se evidenció que existen diferencias significativas entre las puntuaciones del pre y post test de 6,6 puntos p < 0,05.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942714695\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/comprendiendo-la-lectura-del-nivel-literal-al-critico-en-estudiantes-de-eba\"\n}",
    "{\n    \"title\": \"Humanizing Science through STEAM Challenges\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"EunJin Bahng, Iowa State University\",\n        \"John Hauptman, Iowa State University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk4MiwicHVyIjoiYmxvYl9pZCJ9fQ==--1a2cc07551f9cc519ffc1c9ef5f966c4aa646fbe/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/HumanizingScience-cover-350x453.png\",\n    \"description\": \"In a science methods course during the Covid19 pandemic, 51 future elementary teachers authored children's books and then read them aloud as part of a giving-back, service-learning activity as Open Educational Resources (OER). The 51 children's stories and their accompanying audiobooks aim to integrate STEM and the Arts to humanize science and scientific inquiry with history and philosophy of science in mind.\",\n    \"publisher\": \"Iowa State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/humanizing-science-through-steam-challenges\"\n}",
    "{\n    \"title\": \"Desafíos De La Formación Ciudadana En La Era Digital: Estadodelarte\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": \"2020\",\n    \"authors\": [\n        \"David Contreras Guzmán, Escuela de Pedagogía\",\n        \"David Aceituno Silva, Instituto de Historia\",\n        \"Antonio Tapia Zúñiga, Instituto de Historia\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTk0LCJwdXIiOiJibG9iX2lkIn19--b1451eb34245587e72158c132bc7d40709d9a46a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000DesForCiu.png\",\n    \"description\": \"Esta publicación es posible gracias al proyecto “Fortaleciendo la Democracia a través del Ciudadanía Digital en Chile y México”, desarollado por La Biblioteca del Congreso Nacional de Chile y el Instituto Belisario Domínguez del Senado de México, y financiado por el Fondo Conjunto de Cooperación México–Chile (convocatoria 2015). Dicho fondo es administrado por la Agencia de Cooperación Internacional para el Desarrollo de Chile (AGCID) y la Agencia Mexicana de Cooperación Internacional para el Desarrollo (AMEXCID).\",\n    \"publisher\": \"Pontificia Universidad Católica de Valparaíso\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/desafios-de-la-formacion-ciudadana-en-la-era-digital-estadodelarte\"\n}",
    "{\n    \"title\": \"Teaching Early and Elementary STEM\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Alissa A, Lange, East Tennessee State University\",\n        \"Laura Robertson, East Tennessee State University\",\n        \"Jamie Price, East Tennessee State University\",\n        \"Amie Craven, East Tennessee State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Early Childhood\",\n        \"Elementary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzM5NSwicHVyIjoiYmxvYl9pZCJ9fQ==--e23fc1add7061ad036abacb0202722ba8ae74c7f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/thumbnail%20(5).jpg\",\n    \"description\": \"This Open Access Educational textbook, \\\"Teaching Early and Elementary STEM\\\", was written to support pre-service early childhood and elementary teachers in their journey to become facilitators of science, technology, engineering, and math, or “STEM,” and \\\"integrated STEM\\\" in their future classrooms. Students who read and use this text will deepen their understanding of “STEM” and “integrated STEM,” learn what early childhood and elementary students need to know and be able to do in relation to STEM, and understand ways to create activity plans and implement current research-based approaches to teaching and pedagogy. This text arose out of our Early/Elementary STEM Collaboration project, which started in 2017 with the intention of increasing the quality of teacher preparation in STEM across early childhood and elementary education. The team is composed of math and science education professors, classroom in-service teachers, and pre-service teachers in pre-school through fifth grade. We are driven by the values of collaboration, strengths-based approaches to teaching and learning, constructivist philosophy of teaching and learning, and applied STEM experiences to increase access and equity. Our model of preparing pre-service teachers has been published elsewhere in more detail (Robertson, Nivens, & Lange, 2019). We built this open access product to include the following: 1) completely new content that includes input from our team as well as examples of integrated STEM learning experiences; 2) adaptations of existing resources, and; 3) compilations of existing free resources (e.g., Next Generation Science Standards).\",\n    \"publisher\": \"East Tennessee State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-early-and-elementary-stem\"\n}",
    "{\n    \"title\": \"Learning in the Digital Age\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Tutaleni Asino, Oklahoma State University\",\n        \"Rebecca Bayeck\",\n        \"Wilmon Brown\",\n        \"Raymond W. Francis\",\n        \"Tammi Kolski\",\n        \"Kathy Essmiller\",\n        \"Cathy L. Green\",\n        \"Sarah L. Lewis\",\n        \"Corrine McCabe\",\n        \"Josephine Shikongo\",\n        \"Tammy Wise\",\n        \"Jose Fulgencio\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk3NSwicHVyIjoiYmxvYl9pZCJ9fQ==--620870972fe8179d835caeaaf3ef5a059d19a2c3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Asino.PNG\",\n    \"description\": \"This book is designed to serve as a textbook for classes exploring the nature of learning in the digital age. The genesis of this book is a desire to use OERs in all my teachings, coupled with the realization that the resources that I was looking for were not available and as such I needed to contribute in creating them. It is thus a small attempt to contribute to the vast repository of Open Educational Resources. When discussing learning in the digital age, most focus on the technology first. However, the emphasis made in this book is that it’s about the learner not just the technology. One of the things that is easy to lose track of when talking about learning in the digital age is the learner. Technology is important and it has significant impact but it is still about the person who is using the technology. Many people conflate learning in the digital age with technology in today’s age. This important misconception is common and results from our failure to examine our understanding of what “learning” really is. Of course, Most of this depends on a person’s epistemology. There are numerous definitions of what learning is and often they come to how a person sees the world. Some argue that learning is about a change in behavior due to experiences, others state simply that learning is being able to do something new that you were not able to do before. Regardless of what side you choose, to understand what learning in the digital age is, one has to understand what learning itself is. I am immensely thankful to the authors for sharing their ideas freely and for the reviewers who volunteered their time to give feedback.\",\n    \"publisher\": \"Oklahoma State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/learning-in-the-digital-age\"\n}",
    "{\n    \"title\": \"Write Here, Right Now: An Interactive Introduction to Academic Writing and Research\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Aaron Tucker\",\n        \"Paul Chafe\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjI3LCJwdXIiOiJibG9iX2lkIn19--fbe20633b5514d030ece92b8c215a3d8467a7d08/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000WriRigAca.jpg\",\n    \"description\": \"Write Here, Right Now: An interactive Introduction to Academic Writing and Research utilizes PressBooks to create and host a writing e-textbook for first year university students that would effectively integrate into the flipped classroom model. The textbook could also be used for non-flipped classroom designs, as the embedded videos, diagrams and linked modules would act as an all-in-one multimedia textbook geared towards multiple learning styles and disciplines. The components of the textbook, including the embedded videos, could be swapped in and out in order to accommodate a professor’s best idea of his/her own course design.\",\n    \"publisher\": \"Ryerson University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/write-here-right-now-an-interactive-introduction-to-academic-writing-and-research\"\n}",
    "{\n    \"title\": \"Writing Instruction Tips For Automated Essay Graders: How To Design an Essay for a Non-human Reader\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Alise Lamoreaux, Lane Community College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI4MSwicHVyIjoiYmxvYl9pZCJ9fQ==--07d538d91b7b0dc7dd5f5adfb78fac982cb73a3d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/robo-photo-2-350x435.jpg\",\n    \"description\": \"As schools, as well as the workplace, become more automated, and remote or distance learning/working becomes the “new normal,” understanding and leveraging artificial intelligence will become a critical skill.\",\n    \"publisher\": \"Open Oregon Educational Resources\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/writing-instruction-tips-for-automated-essay-graders-how-to-design-an-essay-for-a-non-human-reader\"\n}",
    "{\n    \"title\": \"Evaluación del Aprendizaje en Inglés\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jannett Fonseca, The Pontifical Catholic University of Valparaiso\",\n        \"Francisca Henríquez, Henríquez\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTkzLCJwdXIiOiJibG9iX2lkIn19--1548fb2042c54daf887bd1175f5e3ae29c24151e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000EvaDelApr.png\",\n    \"description\": \"This course material has been created for the course “Evaluation of comprehension and oral and written production in English” (LCL 462) from the English Language Teaching (ELT) program at the Institute of Literature and Language Sciences, Pontificia Universidad Católica de Valparaíso (PUCV). This course is located in the 8th semester of the curriculum of the bachelor degree of “Pedagogy in English” (English Language Initial Teacher Training) at PUCV. This course corresponds to the area of specific disciplinary training, complements the professional training course “Evaluation of Learning” of the School of Pedagogy and precedes the professional practice, academic-professional activity culminating in the curriculum of this career.\",\n    \"publisher\": \"Pontificia Universidad Católica de Valparaíso\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/evaluacion-del-aprendizaje-en-ingles\"\n}",
    "{\n    \"title\": \"The Information Literacy User's Guide: An Open, Online Textbook\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Deborah Bernnard, University of Albany\",\n        \"Greg Bobish, University of Albany\",\n        \"Daryl Bullis, Babson College\",\n        \"Jenna Hecker, University of Albany\",\n        \"Irina Holden, University of Albany\",\n        \"Allison Hosier, University of Albany\",\n        \"Trudi Jacobson, University of Albany\",\n        \"Tor Loney, Albany Public Library\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTU0LCJwdXIiOiJibG9iX2lkIn19--2c8b8adb7a71657d9ed9ff39e7d5f781743cbcc6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780989722629.png\",\n    \"description\": \"Good researchers have a host of tools at their disposal that make navigating today's complex information ecosystem much more manageable. Gaining the knowledge, abilities, and self-reflection necessary to be a good researcher helps not only in academic settings, but is invaluable in any career, and throughout one's life. The Information Literacy User's Guide will start you on this route to success.The Information Literacy User's Guide is based on two current models in information literacy: The 2011 version of The Seven Pillars Model, developed by the Society of College, National and University Libraries in the United Kingdom and the conception of information literacy as a metaliteracy, a model developed by one of this book's authors in conjunction with Thomas Mackey, Dean of the Center for Distance Learning at SUNY Empire State Col- lege.2 These core foundations ensure that the material will be relevant to today's students.The Information Literacy User's Guide introduces students to critical concepts of information literacy as defined for the information-infused and technology-rich environment in which they find themselves. This book helps students examine their roles as information creators and sharers and enables them to more effectively deploy related skills. This textbook includes relatable case studies and scenarios, many hands-on exercises, and interactive quizzes.\",\n    \"publisher\": \"Open SUNY\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780989722629\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-information-literacy-user-s-guide-an-open-online-textbook\"\n}",
    "{\n    \"title\": \"Efficacious Technology Management: A Guide for School Leaders\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Gary Ackerman\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQxMywicHVyIjoiYmxvYl9pZCJ9fQ==--b69435b65d868980a00d999d38b46abf7f0a145d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/efficacious.png\",\n    \"description\": \"Dr. Gary Ackerman, an educational technology specialist with decades of experience in K-12, community college, and faculty development has releasedEfficacious Technology Management: A Guide for School Leaders. This is his second book, and it is available under a Creative Commons license.\",\n    \"publisher\": \"Gary Ackerman\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/efficacious-technology-management-a-guide-for-school-leaders\"\n}",
    "{\n    \"title\": \"Ethical Use of Technology in Digital Learning Environments: Graduate Student Perspectives\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Barbara Brown\",\n        \"Verena Roberts\",\n        \"Michele Jacobsen\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk0OSwicHVyIjoiYmxvYl9pZCJ9fQ==--5de2b95a2d436790473ae76d97e5313ac0a5ded0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/book-coverres2-350x453.png\",\n    \"description\": \"This book is the result of a co-design project in a class in the Masters of Education program at the University of Calgary. The course, and the resulting book, focus primarily on the safe and ethical use of technology in digital learning environments. The course was organized according to four topics based on Farrow’s (2016) Framework for the Ethics of Open Education.\",\n    \"publisher\": \"University of Calgary\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/ethical-use-of-technology-in-digital-learning-environments-graduate-student-perspectives\"\n}",
    "{\n    \"title\": \"Hybrid-Flexible Course Design\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Brian Beatty, San Francisco State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE3OSwicHVyIjoiYmxvYl9pZCJ9fQ==--fa4c9309c89e6694608e50edb20ad165d57bc9c3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/hybridclass.jpg\",\n    \"description\": \"This volume provides readers with methods, case stories, and strategies related to Hybrid-Flexible (HyFlex) course design so that they may make decisions about using it themselves and even begin their own HyFlex course (re)design. More specifically, based on the needs identified for their course(s), readers will be able to a) determine if and how HyFlex course design could help them solve critical needs, b) take advantage of emerging opportunities to improve their education practice, enabling them to better serve more students, c) gain an awareness of the HyFlex design, d) find their own innovative HyFlex solution to their specific challenges, and e) begin the HyFlex implementation process using strategies similar to those used by instructors described in this book. The volume describes the fundamental principles of HyFlex design, explains a process for design and development, and discusses implementation factors that instructors have experienced in various higher education institutions. These factors include the drivers, the variations in implementation approaches and constraints, and the results (e.g., student scores, student satisfaction). A series of worksheets provides specific guidance that can be used by individuals or teams engaging in HyFlex design projects at their own institution. Case reports from institutions and faculty who have successfully implemented HyFlex-style courses provide a rich set of real-world stories to draw insights for a reader’s own design setting.\",\n    \"publisher\": \"EdTech Books\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/hybrid-flexible-course-design-beatty\"\n}",
    "{\n    \"title\": \"Methods of Teaching Early Literacy\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Nandita Gurjar, Rhode Island College\",\n        \"Sohyun Meacham, University of Northern Iowa\",\n        \"Constance Beecher, Iowa State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Elementary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Nzg4NiwicHVyIjoiYmxvYl9pZCJ9fQ==--ff5538aa276db4e0f30b31027274e434f12c1780/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/OER_Early-Literacy-Cover-350x453.png\",\n    \"description\": \"This textbook covers theories, teaching strategies, and instructional materials pertinent to teaching reading and writing in grades PK-3, with an emphasis on integrating reading, writing, speaking, and listening, as well as integration across content areas while addressing diversity and inclusion.\",\n    \"publisher\": \"Iowa State University Digital Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/methods-of-teaching-early-literacy\"\n}",
    "{\n    \"title\": \"Writing Programs Worldwide: Profiles of Academic Writing in Many Places\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Chris Thaiss, University of California, Davis\",\n        \"Gerd Bräuer, University of Education\",\n        \"Paula Carlino, University of Buenos Aires\",\n        \"Lisa Ganobcsik-Williams, Coventry University\",\n        \"Aparna Sinha, University of California, Davis\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjQxLCJwdXIiOiJibG9iX2lkIn19--991a2934ca925ac184e22096cb6b3ecce2af5b30/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781602353435.png\",\n    \"description\": \"Emerging from the International WAC/WID Mapping Project, this collection of essays is meant to inform decision-making by teachers, program managers, and college/university administrators considering how writing can most appropriately be defined, managed, funded, and taught in the places where they work. Writing Programs Worldwide offers an important global perspective to the growing research literature in the shaping of writing programs. The authors of its program profiles show how innovators at a diverse range of universities on six continents have dealt creatively over many years with day-to-day and long-range issues affecting how students across disciplines and languages grow as communicators and learners.In these profiles, we see teachers and researchers relying on colleagues and on transnational scholarship to build initiatives that are both well suited to their specific environments and can serve as regional and often global models. Their struggles and achievements offer insights to colleagues in similar locales and across borders who seek to establish, enhance, and assess their own work as designers of writing programs.An introduction and three section essays by the editors illuminate themes that inform this collection. Growing networks of initiators and scholars and survey results from the International WAC/WID Mapping Project exemplify the argument of this collection for transnational exchange and collaboration.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602353435\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/writing-programs-worldwide-profiles-of-academic-writing-in-many-places\"\n}",
    "{\n    \"title\": \"Instruction in Functional Assessment\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Marcie Desrochers, State University of New York\",\n        \"Moira Fallon, State University of New York\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTY0LCJwdXIiOiJibG9iX2lkIn19--11a0319b2f88dc8d624fa126ae5df2f66df30edd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9780989722674.png\",\n    \"description\": \"Instruction in Functional Assessment introduces learners to functional assessment (FA), which includes a variety of assessment approaches (indirect, observational, and experimental) for identifying the cause of an individual's challenging behavior for the purpose of designing effective treatments. FA is mandated by federal law and is a recognized empirically based approach to treatment of individuals with challenging behaviors (e.g., disruptive, self-injurious, and aggressive behaviors). Instruction in FA is essential for students who will one day enter professions as educators, psychologists, social workers, counselors, or mental health professionals.The purpose of this textbook is to provide instruction in FA skills for pre-professionals in the fields of education and psychology. This supplemental resource provides the context, background, and knowledge to facilitate students' acquisition of the methods, decision-making, and skills involved in conducting FA. Each chapter begins with focus questions designed to promote reflective thinking and ends with discussion questions. To promote application of FA in diverse situations and teach important lessons, case studies of individuals with challenging behaviors, interactive activities, and opportunities for practice are embedded in the chapters. Moreover, the text includes the ingredients to facilitate students' role play and rehearsal of appropriate FA skills while working in cooperative groups and using performance-based training.\",\n    \"publisher\": \"Open SUNY\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780989722674\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/instruction-in-functional-assessment\"\n}",
    "{\n    \"title\": \"Mathematics for Elementary Teachers\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Michelle Manes, Honolulu, HI\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Elementary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDkzLCJwdXIiOiJibG9iX2lkIn19--ebfb89d9ebaeb41b0da25bffeb5dd09186bbbe50/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000MatEleTea.png\",\n    \"description\": \"This book will help you to understand elementary mathematics more deeply, gain facility with creating and using mathematical notation, develop a habit of looking for reasons and creating mathematical explanations, and become more comfortable exploring unfamiliar mathematical situations.The primary goal of this book is to help you learn to think like a mathematician in some very specific ways. You will:• Make sense of problems and persevere in solving them. You will develop and demonstrate this skill by working on difficult problems, making incremental progress, and revising solutions to problems as you learn more.• Reason abstractly and quantitatively. You will demonstrate this skill by learning to represent situations using mathematical notation (abstraction) as well as creating and testing examples (making situations more concrete).• Construct viable arguments and critique the reasoning of others. You will be expected to create both written and verbal explanations for your solutions to problems. The most important questions in this class are “Why?” and “How do you know you're right?” Practice asking these questions of yourself, of your professor, and of your fellow students.Throughout the book, you will learn how to learn mathematics on you own by reading, working on problems, and making sense of new ideas on your own and in collaboration with other students in the class.\",\n    \"publisher\": \"University of Hawaii Manoa\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/mathematics-for-elementary-teachers\"\n}",
    "{\n    \"title\": \"Safety, Health, and Nutrition in Early Childhood Education\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jennifer Paris, College of the Canyons\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQzNiwicHVyIjoiYmxvYl9pZCJ9fQ==--63d8f4163201626c77d5d2eff529cd879d4bd8a3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Title.PNG\",\n    \"description\": \"Early childhood is a critical time in development. Many outcomes, both positive and negative, have their beginnings in these years. It is vital that children’s health and safety be protected. High-quality early care and education programs can play a valuable role in improving outcomesfor children.\",\n    \"publisher\": \"College of the Canyons\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/safety-health-and-nutrition-in-early-childhood-education\"\n}",
    "{\n    \"title\": \"Teaching in the University: Learning from Graduate Students and Early Career Faculty\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Donna Westfall-Rudd, Virginia Tech\",\n        \"Courtney Vengrin, International Council for Veterinary Assessment\",\n        \"Jeremy Elliott-Engel, University of Arizona\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjgyMCwicHVyIjoiYmxvYl9pZCJ9fQ==--4462d4bd2c9415c1c649e88681d98951626e7571/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Cover-TeachingInTheUniversity3.JPG\",\n    \"description\": \"The primary objective of this book is to provide a resource for graduate teaching assistants who are looking for practical strategies and guidance as they begin their careers as postsecondary STEM educators. The text is designed to address a comprehensive list of topics to support the professional development of new faculty, recognizing that those holding academic faculty positions within a college or university are expected to be active in teaching, discovery, and outreach.Traditional doctoral education programs have historically emphasized preparation for research and scholarly publications, and for outreach. However, to some extent, many candidates who complete doctoral programs have minimal preparation and training in formal teaching.Contributorsto this text have had a unique experience as part of a three-year, college-wide program designed to prepare interested doctoral students for a rewarding academic career. The program is designed to support the professional development of new faculty, recognizing that those holding academic faculty positions within a college or university are expected to be active in teaching, discovery, and outreach. The alumni and scholars of the program have worked collectively to gather resources and implement educational practices in the diverse set of courses they taught in during their three years in the program. Now as new faculty at a variety of postsecondary institutions across the United States, these early-career educators bring their insights and real-world teaching experiences, embedded in contemporary teaching and learning theory to their contributions to this text.What is this resource?This text is a collection of chapters and vignettes intended to provide practical insight into the challenges and opportunities of teaching at the postsecondary level. It is anticipated that the vignettes provide examples of contexts in which the principles of the topic chapters are applied.Goals for this bookSupport future STEM faculty in their efforts to engage in student-centered teaching practices that create inclusive postsecondary classroomsSupport improved the preparation of new faculty to engage in community education and outreach as part of their professional responsibilities.Support graduate students preparing to apply and interview for faculty positions with teaching appointments.If you are an instructor reviewing, adopting, or adapting this textbook, please help us understand your use by filling out this formhttp://bit.ly/teaching-interest.\",\n    \"publisher\": \"Virginia Tech Publishing\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-in-the-university-learning-from-graduate-students-and-early-career-faculty\"\n}",
    "{\n    \"title\": \"Critical Expressivism: Theory and Practice in the Composition Classroom\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Tara Roeder, St. John's University\",\n        \"Roseanne Gatto, St. John's University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjM4LCJwdXIiOiJibG9iX2lkIn19--53fe667647c2329ceba35d111d645071c0bada30/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602356511.png\",\n    \"description\": \"Critical Expressivismis an ambitious attempt to re-appropriate intellectual territory that has more often been charted by its detractors than by its proponents. Indeed, as Peter Elbow observes in his contribution to this volume, \\\"As far as I can tell, the term 'expressivist' was coined and used only by people who wanted a word for people they disapproved of and wanted to discredit.\\\" The editors and contributors to this collection invite readers to join them in a new conversation, one informed by \\\"a belief that the term expressivism continues to have a vitally important function in our field.\\\"\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602356511\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/critical-expressivism-theory-and-practice-in-the-composition-classroom\"\n}",
    "{\n    \"title\": \"Open ELA\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Alexander Greengaard, Pima Community College\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMyNDUsInB1ciI6ImJsb2JfaWQifX0=--b9e3244ddecc2c77ea34be0267daf94c4e3d86a6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Cover4-350x453.png\",\n    \"description\": \"Open ELA is a complete course in Reading and Language Arts for instructors and self-directed learners in Adult Basic Education settings. These materials are designed to aid students in completing the GED exam and to support college and career pathways. This course includes resources for the Reading and Language Arts, Social Studies, and Science portions of the GED exam. It also includes GED Study Guides and lessons contextualized to college and career exploration and readiness. Open ELA covers six units of study: Understanding Literature, Intro to Communications, Metacognitive Reading, Film & Television Studies, Reading for Science & Social Studies, and Journalism.\",\n    \"publisher\": \"Pima Community College\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/open-ela\"\n}",
    "{\n    \"title\": \"Early Childhood Literacy: Engaging and Empowering Emergent Readers and Writers, Birth – Age 5\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Christine Pegorraro Schull, Northern Virginia Community College\",\n        \"Leslie La Croix, George Mason University\",\n        \"Sara E. Miller, Longwood University\",\n        \"Kimberly Sanders Austin, Southwest Virginia Community College\",\n        \"Julie K. Kidd, George Mason University\",\n        \"Melanie Medina, Northern Virginia Community College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU4OCwicHVyIjoiYmxvYl9pZCJ9fQ==--c395fb549a4765cda08b26621c1a6b7953e01be5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Final-Cover-resized.jpeg\",\n    \"description\": \"This textbook, Early Childhood Literacy: Engaging and Empowering Emergent Readers and Writers Birth-Age 5,outlines the connection between different areas of language and literacy and describes strategies for supporting development and promoting instruction. Early literacy includes reading, writing, and language development. Writing includes any early writing attempts and pre-writing behaviors just as reading includes any early reading attempts and recognition of symbols and sounds. Language also includes listening and speaking (oral language) and the use of gestures and signs to communicate. The termoral languageis commonly used to describe early language development separately from reading and writing. This text assumes oral language is a component of language and embraces the broader term to underscore the communication practices outside of listening and speaking. For example, some children use sign language or a picture board. For these reasons, the textbook will focus on language development in its totality, including oral language. This textbook is focused on birth to age 5 because early literacy development is crucial for future learning and development.\",\n    \"publisher\": \"VIVA\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/early-childhood-literacy-engaging-and-empowering-emergent-readers-and-writers-birth-age-5\"\n}",
    "{\n    \"title\": \"Informed Arguments:  A Guide to Writing and Research - Revised Second Edition\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": \"2022\",\n    \"authors\": [\n        \"Terri Pantuso, Texas A&M University\",\n        \"Sarah LeMire, Texas A&M University\",\n        \"Kathy Anders, Texas A&M University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzM2NSwicHVyIjoiYmxvYl9pZCJ9fQ==--888d5d4fc3ad0e9ac7064d3d83465ebbdc2d7c2f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/ENGL104-Informed-Arguments-Pantusso_LeMire_Anders-3.png\",\n    \"description\": \"Welcome to composition and rhetoric! While most of you are taking this course because it is required, we hope that all of you will leave with more confidence in your reading, writing, researching, and speaking abilities as these are all elements of freshman composition. Many times, these elements are presented in excellent textbooks written by top scholars. While the collaborators of this particular textbook respect and value those textbooks available from publishers, we have been concerned about students who do not have the resources to purchase textbooks. Therefore, we decided to put together this Open Educational Resource (OER) explicitly for use in freshman composition courses at Texas A&M University. It is important to note that the focus for this text is on thesis-driven argumentation as that is the focus of the first year writing course at Texas A&M University at the time of development. However, other first year writing courses at different colleges and universities include a variety of types of writing such as personal essays, informative articles, and/or creative writing pieces. The collaborators for this project acknowledge each program is unique; therefore, the adaptability of an OER textbook for first year writing allows for academic freedom across campuses.\",\n    \"publisher\": \"Texas A&M University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/informed-arguments-a-guide-to-writing-and-research-pantuso\"\n}",
    "{\n    \"title\": \"Steps to Success: Crossing the Bridge Between Literacy Research and Practice\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kristen A. Munger, SUNY Oswego\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE2LCJwdXIiOiJibG9iX2lkIn19--b5656dda27701814a4afa8fdaca20674cfb8c122/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781942341222.png\",\n    \"description\": \"Steps to Success: Crossing the Bridge Between Literacy Research and Practiceintroduces instructional strategies linked to the most current research-supported practices in the field of literacy. The book includes chapters related to scientifically-based literacy research, early literacy development, literacy assessment, digital age influences on children's literature, literacy development in underserved student groups, secondary literacy instructional strategies, literacy and modern language, and critical discourse analysis. Chapters are written by authors with expertise in both college teaching and the delivery of research-supported literacy practices in schools. The book features detailed explanations of a wide variety of literacy strategies that can be implemented by both beginning and expert practitioners. Readers will gain knowledge about topics frequently covered in college literacy courses, along with guided practice for applying this knowledge in their future or current classrooms. The book's success-oriented framework helps guide educators toward improving their own practices and is designed to foster the literacy development of students of all ages.\",\n    \"publisher\": \"Open SUNY\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781942341222\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/steps-to-success-crossing-the-bridge-between-literacy-research-and-practice\"\n}",
    "{\n    \"title\": \"Choosing & Using Sources: A Guide to Academic Research\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Cheryl Lowry, Ohio State University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjczLCJwdXIiOiJibG9iX2lkIn19--eda7dbcc4138fde619458ad92b8e56cf04d9e09f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ChooseUse.png\",\n    \"description\": \"Choosing & Using Sourcespresents a process for academic research and writing, from formulating your research question to selecting good information and using it effectively in your research assignments. Additional chapters cover understanding types of sources, searching for information, and avoiding plagiarism. Each chapter includes self-quizzes and activities to reinforce core concepts and help you apply them. There are also appendices for quick reference on search tools, copyright basics, and fair use.What experts are saying aboutChoosing & Using Sources: A Guide to Academic Research:“…a really fantastic contribution that offers a much needed broadened perspective on the process of research, and is packed to the brim with all kinds of resources and advice on how to effectively use them. The chapter on plagiarism is really excellent, and the chapter on searching for sources is utterly brilliant.”– Chris Manion, PhDCoordinator of Writing Across the Curriculum at Ohio State University“… an excellent resource for students, with engaging content, graphics, and examples—very compelling. The coverage of copyright is outstanding.”– J. Craig GibsonCo-chair of ACRL's Task Force on Information Literacy Competency Standards for Higher Education\",\n    \"publisher\": \"Ohio State University Libraries\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/choosing-using-sources-a-guide-to-academic-research\"\n}",
    "{\n    \"title\": \"Enhancing Inclusion, Diversity, Equity and Accessibility (IDEA) in Open Educational Resources (OER) - Australian Edition\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Nikki Andersen, Toowoomba, Australia\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk4MiwicHVyIjoiYmxvYl9pZCJ9fQ==--0bc30ada4dc3c65098025423a0526640156f4867/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Enhancing-Inclusion-Diversity-Equity-and-Accessibility-IDEA-in-Open-Educational-Resources-resized-2-350x526.jpeg\",\n    \"description\": \"This practical guide provides a framework and tips to enhance inclusion, diversity, equity, inclusion and accessibility in Open Educational Resources.\",\n    \"publisher\": \"University of Southern Queensland\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780645326\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/enhancing-inclusion-diversity-equity-and-accessibility-idea-in-open-educational-resources-oer\"\n}",
    "{\n    \"title\": \"Content Area Language and Literacy\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Saadia Ali, Virginia Polytechnic Institute and State University\",\n        \"Margaret A. Berg, University of Northern Colorado\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE0NjMsInB1ciI6ImJsb2JfaWQifX0=--102a94251fa98f0f9de04c469be9684345dc1feb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/ContentArea.jpg\",\n    \"description\": \"Content Area Literacy courses have long been a requirement in teacher education programs for pre-service teachers for the secondary level and, sometimes, for the elementary level. The 2020 World-class Instructional Design and Assessment (WIDA) Framework takes a genre approach that aligns well with the traditional Content Area Literacy courses in teacher preparation programs. WIDA argues for an educational approach that fosters (a) equity of opportunity and access, (b) integration of content and language, (c) collaboration among stakeholders, and (d) a functional approach to language development. This textbook examines the elements that make up the Simple View of Reading with adjustments made for the increasing Multilingual student population. Then, the text focuses on the Key Uses of Language (KLUs) developed by WIDA with examples of how these are employed in different Content Areas. The final chapters focus on the unique needs and benefits of Multilingual students within U.S. classrooms.\",\n    \"publisher\": \"University of Northern Colorado\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/content-area-language-and-literacy\"\n}",
    "{\n    \"title\": \"Education for a Digital World: Advice, Guidelines and Effective Practice from Around Globe\",\n    \"copyright_year\": \"2008\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Sandy Hirtz\",\n        \"David G. Harper, Harvard Medical School\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjk1LCJwdXIiOiJibG9iX2lkIn19--cf6e3ecdb89c68645db98bbbbcf72e5d6b2be1e9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781894975292.png\",\n    \"description\": \"Education for a Digital Worldcontains a comprehensive collection of proven strategies and tools for effective online teaching, based on the principles of learning as a social process. It offers practical, contemporary guidance to support e-learning decision-making, instructional choices, as well as program and course planning, and development.Practical advice, real-life examples, case studies, and useful resources supply in-depth perspectives about structuring and fostering socially engaging learning in an online environment. A plethora of e-learning topics provide insights, ideas, and usable tools. Tips and evidence-based theory guide administrators, program and course developers, project teams, and teachers through the development of online learning opportunities.Education for a Digital Worldis an indispensable guide, resource, textbook and manual for policymakers and practitioners in developing and developed countries.\",\n    \"publisher\": \"BCcampus\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781894975292\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/education-for-a-digital-world-advice-guidelines-and-effective-practice-from-around-globe\"\n}",
    "{\n    \"title\": \"WAC Partnerships Between Secondary and Postsecondary Institutions\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jacob Blumner, University of Michigan-Flint\",\n        \"Pamela Childers, McCallie School\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjUxLCJwdXIiOiJibG9iX2lkIn19--19fd19704e74fc4837434a7964afdf3a5c7bd31e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781602358096.png\",\n    \"description\": \"Working with educators at all academic levels involved in WAC partnerships, the authors and editors of this collection demonstrate successful models of collaboration between schools and institutions so others can emulate and promote this type of collaboration. The chapters in this collection describe and reflect on collaborative partnerships among middle schools, high schools, colleges, and universities that are designed to prepare students for the kinds of work and civic engagement required to succeed in and contribute to society. The WAC partnerships celebrated in this collection include frameworks to build connectivity between institutions while addressing Common Core State Standards, academic and non-academic collaborations around science education, WAC partnerships in Argentina and Germany, and both long- and short-term collaborations.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602358096\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/wac-partnerships-between-secondary-and-postsecondary-institutions\"\n}",
    "{\n    \"title\": \"Teaching Pronunciation with Confidence: A Resource for ESL/EFL Teachers and Learners\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Agata Guskaroska\",\n        \"Zoë Zawadzki\",\n        \"John M. Levis\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI4OTEsInB1ciI6ImJsb2JfaWQifX0=--9c93691f8da3e3825d06712e999e235ae4294496/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Guskaroska-TeachingPronunciation-Cover-r1-350x453.png\",\n    \"description\": \"Teaching Pronunciation with Confidenceis an essential resource for both English teachers and learners, designed to effectively build strong pronunciation skills and knowledge of pronunciation. This guide covers key topics, including English sounds, word stress, intonation, rhythm, prominence, connected speech, and pronunciation diagnostics to guide improvement. The book includes a wide array of interactive H5P activities and sound recordings, which can be used for classroom teaching, or homework and individual practice. These exercises provide practical experience, reinforcing the concepts covered in each chapter.\",\n    \"publisher\": \"Iowa State University Digital Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-pronunciation-with-confidence-a-resource-for-esl-efl-teachers-and-learners\"\n}",
    "{\n    \"title\": \"WAC and Second-Language Writers: Research Towards Linguistically and Culturally Inclusive Programs and Practices\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Terry Myers Zawacki, George Mason University\",\n        \"Michelle Cox, Dartmouth College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjUwLCJwdXIiOiJibG9iX2lkIn19--25e1db1cd670dbe324705f09b901e5ec3e3b10b4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781602355057.png\",\n    \"description\": \"InWAC and Second-Language Writers, the editors and contributors pursue the ambitious goal of including within WAC theory, research, and practice the differing perspectives, educational experiences, and voices of second-language writers. The chapters within this collection not only report new research but also share a wealth of pedagogical, curricular, and programmatic practices relevant to second-language writers. Representing a range of institutional perspectives—including those of students and faculty at public universities, community colleges, liberal arts colleges, and English-language schools—and a diverse set of geographical and cultural contexts, the editors and contributors report on work taking place in the United States, Asia, Europe, and the Middle East.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602355057\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/wac-and-second-language-writers-research-towards-linguistically-and-culturally-inclusive-programs-and-practices\"\n}",
    "{\n    \"title\": \"Applications of Educational Technology\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Susan Stansberry, Oklahoma State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyOTAsInB1ciI6ImJsb2JfaWQifX0=--78b4331965604814232e953930ba04bb8216dbe2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/ApplicationsOfEducationalTechnology_SusanStansberry-350x453.png\",\n    \"description\": \"Welcome to the Applications of Educational Technology eBook. The resource comes alongside the Oklahoma State UniversityEmerging Technologies and Creativity Research Lab, where students in this class will play and help in transforming education through creative habits!The purpose of this online resource is to serve as an interactive open textbook for EDTC 3123 Applications of Educational Technology at Oklahoma State University. We invite you to ask questions, contribute resources, and participate in making this a living, collaborative resource for all educators!\",\n    \"publisher\": \"Oklahoma State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/applications-of-educational-technology\"\n}",
    "{\n    \"title\": \"Writing Spaces at Oklahoma State University\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Dane Howard, Oklahoma State University\",\n        \"Courtney Lund O'Neil, University of San Diego\",\n        \"Dana Driscoll, Indiana University of Pennsylvania\",\n        \"Joshua Daniel, Oklahoma State University\",\n        \"Josiah Meints, Oklahoma State University\",\n        \"Kathy Essmiller, Oklahoma State University\",\n        \"Mary K. Stewart, California State University, San Marcos\",\n        \"Matthew Vetter, Indiana University of Pennsylvania\",\n        \"Trace Daniels-Lerberg, University of Utah\",\n        \"Mark DiFruscio, Oklahoma State University\",\n        \"Natasha Tinsley, Southwestern Oklahoma State University\",\n        \"Roseanna Recchia, Oklahoma State University\",\n        \"Victoria Garcia-Boswell\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTMxMiwicHVyIjoiYmxvYl9pZCJ9fQ==--b13a1b3f7df63fb9ceaf84b96be7e9be306cb842/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Writing%20Spaces%20at%20Oklahoma%20State%20University.jpg\",\n    \"description\": \"This resource focuses on the various processes involved in researching answers to various inquiry questions and building effective arguments within and outside academic contexts. The curriculum takes students through the processes of listening/summarizing, asking questions, characterizing scholarly debates, and entering those debates in order to meaningfully contribute to ongoing conversations.\",\n    \"publisher\": \"Oklahoma State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/writing-spaces-at-oklahoma-state-university\"\n}",
    "{\n    \"title\": \"Fostering Communities of Transformation in STEM Higher Education: A Multi-institutional Collection of DEI Initiatives\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jonathan S. Briganti, Virginia Tech\",\n        \"Jill C. Sible, Virginia Tech\",\n        \"Anne M. Brown, Virginia Tech\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTExNzQsInB1ciI6ImJsb2JfaWQifX0=--96b13afba624a899a9daa30789b751ad05054322/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/fost.jpg\",\n    \"description\": \"Dive into the multifaceted landscape of inclusive excellence in STEM education with Fostering Communities of Transformation in STEM Higher Education.This scholarly work examines transformative initiatives from Virginia Tech, Radford University, Trinity Washington University, and Towson University, showcasing their role as catalysts in cultivating inclusive excellence across diverse STEM disciplines. Take inspiration from their projects and guidance from their lessons learned with this collection.\",\n    \"publisher\": \"Virginia Tech Publishing\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/fostering-communities-of-transformation-in-stem-higher-education-a-multi-institutional-collection-of-dei-initiatives\"\n}",
    "{\n    \"title\": \"Exploring Physical Phenomena\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Emily van Zee, Oregon State University\",\n        \"Elizabeth Gire, Oregon State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjAxNiwicHVyIjoiYmxvYl9pZCJ9fQ==--aed0975dc05f7fc3458856302cfba58f6145c5d3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Title-Page_ExploringPhysicalPhynomena-350x453.jpg\",\n    \"description\": \"This course is intended for prospective and practicing elementary and middle school teachers. By exploring physical phenomena in class, you will learn science in ways in which you are expected to teach science in schools or in informal settings such as afterschool programs, youth group meetings, and museum workshops. This course also is appropriate for general science students and others interested in exploring some of the physical phenomena underlying global climate change.The theme for the course is: What happens when light from the Sun shines on the Earth? The emphasis is on questioning, predicting, exploring, observing, discussing, reading, and writing about what one thinks and why. This first unit focuses on exploring the nature of light phenomena. Among the unit’s many goals are two primary ones: to learn about light phenomena and to learn about ways to foster science learning for yourself and others such as your family, friends, and students.\",\n    \"publisher\": \"Oregon State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/exploring-physical-phenomena\"\n}",
    "{\n    \"title\": \"Knowing Home: Braiding Indigenous Science with Western Science Book 1\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Gloria Snively , University of Victoria\",\n        \"Wanosts’a7 Lorna Williams, University of Victoria\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjczMiwicHVyIjoiYmxvYl9pZCJ9fQ==--1d07e835e4254cae304d7136bbad30d3cff8e31a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/KH_cover-350x453.jpg\",\n    \"description\": \"Knowing Home attempts to capture the creative vision of Indigenous scientific knowledge and technology that is derived from an ecology of a home place. The traditional wisdom component of Indigenous Science—the values and ways of decision-making—assists humans in their relationship with each other, the land and water, and all of creation. Indigenous perspectives have the potential to give insight and guidance to the kind of environmental ethics and deep understanding that we must gain as we attempt to solve the increasingly complex problems of the 21st century.Braiding Indigenous Science and Western Science is a metaphor used to establish a particular relationship. Linked by braiding, there is a certain reciprocity. Each strand remains a separate entity, but all strands come together to form the whole. When we braid Indigenous Science with Western Science we acknowledge that both ways of knowing are legitimate forms of knowledge.The book provides a window into the vast storehouse of innovations and technologies of the Indigenous peoples who live in Northwestern North America. It is our hope that the Indigenous Science examples, research and curriculum models will inspire deep reflection regarding the under-representation of Aboriginal students in the sciences. It is intended that the rich examples and cases, combined with the resources listed in the appendices, will enable teachers and students to explore Indigenous Science examples in the classroom, and in addition, support the development of curriculum projects in home places.\",\n    \"publisher\": \"University of Victoria\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/knowing-home-braiding-indigenous-science-with-western-science-book-1\"\n}",
    "{\n    \"title\": \"Information Literacy: Research and Collaboration across Disciplines\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Barbara J. D'Angelo, Arizona State University\",\n        \"Sandra Jamieson, Drew University\",\n        \"Barry Maid, Arizona State University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzI1LCJwdXIiOiJibG9iX2lkIn19--a2337e98a158b47649735d8ea4f30ea01c1f82a3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000InforLite.png\",\n    \"description\": \"This collection brings together scholarship and pedagogy from multiple perspectives and disciplines, offering nuanced and complex perspectives on Information Literacy in the second decade of the 21st century. Taking as a starting point the concerns that prompted the Association of Research Libraries (ACRL) to review the Information Literacy Standards for Higher Education and develop the Framework for Information Literacy for Higher Education (2015), the chapters in this collection consider six frameworks that place students in the role of both consumer and producer of information within today's collaborative information environments. Contributors respond directly or indirectly to the work of the ACRL, providing a bridge between past/current knowledge and the future and advancing the notion that faculty, librarians, administrators, and external stakeholders share responsibility and accountability for the teaching, learning, and research of Information Literacy.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781642150834\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/information-literacy-research-and-collaboration-across-disciplines\"\n}",
    "{\n    \"title\": \"Teaching Autoethnography: Personal Writing in the Classroom\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Melissa Tombro, The Fashion Institute of Technology\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjE0LCJwdXIiOiJibG9iX2lkIn19--e2752888d802ba4eb906ac410e682507cf36f42f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781942341284.png\",\n    \"description\": \"Teaching Autoethnography: Personal Writing in the Classroomis dedicated to the practice of immersive ethnographic and autoethnographic writing that encourages authors to participate in the communities about which they write. This book draws not only on critical qualitative inquiry methods such as interview and observation, but also on theories and sensibilities from creative writing and performance studies, which encourage self-reflection and narrative composition. Concepts from qualitative inquiry studies, which examine everyday life, are combined with approaches to the creation of character and scene to help writers develop engaging narratives that examine chosen subcultures and the author's position in relation to her research subjects. The book brings together a brief history of first-person qualitative research and writing from the past forty years, examining the evolution of nonfiction and qualitative approaches in relation to the personal essay. A selection of recent student writing in the genre as well as reflective student essays on the experience of conducting research in the classroom is presented in the context of exercises for coursework and beyond. Also explored in detail are guidelines for interviewing and identifying subjects and techniques for creating informed sketches and images that engage the reader. This book provides approaches anyone can use to explore their communities and write about them first-hand. The methods presented can be used for a single assignment in a larger course or to guide an entire semester through many levels and varieties of informed personal writing.\",\n    \"publisher\": \"Open SUNY\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781942341284\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/teaching-autoethnography-personal-writing-in-the-classroom\"\n}",
    "{\n    \"title\": \"Foundational Practices of Online Writing Instruction\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Beth L. Hewett, Conference on College Composition\",\n        \"Kevin Eric DePew, Old Dominion University\",\n        \"Elif Guler, Longwood University\",\n        \"Robbin Zeff Warner\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Distance Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjQ0LCJwdXIiOiJibG9iX2lkIn19--348bc376714f1fed8b73d7e10a6d010be9d9f84d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602356672.png\",\n    \"description\": \"Foundational Practices of Online Writing Instruction, edited by Beth L. Hewett and Kevin Eric DePew, with associate editors Elif Guler and Robbin Zeff Warner, addresses the questions and decisions that administrators and instructors most need to consider when developing online writing programs and courses. Written by experts in the field (members of the Conference on College Composition and Communication Committee for Effective Practices in OWI and other experts and stakeholders), the contributors to this collection explain the foundations of the recently published (2013) A Position Statement of Principles and Examples Effective Practices for OWI and provide illustrative practical applications. To that end, in every chapter, the authors address issues of inclusive and accessible writing instruction (based upon physical and mental disability, linguistic ability, and socioeconomic challenges) in technology enhanced settings.The five parts of this book attempt to cover the most important issues relevant to principle-centered OWI: (1) An OWI Primer, (2) OWI Pedagogy and Administrative Decisions, (3) Practicing Inclusivity in OWI, (4) Faculty and Student Preparation for OWI, and (5) New Directions in OWI. Working from the belief that most writing courses eventually will be mediated online to various degrees, the editors offer principles and practices that will allow this collection to inform future composition theory and praxis. To this end, the editors hope that the guidance provided in this collection will encourage readers to join a conversation about designing OWI practices, contributing to the scholarship about OWI, and reshaping OWI theory.\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602356672\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/foundational-practices-of-online-writing-instruction\"\n}",
    "{\n    \"title\": \"Urban Health: A Practical Application for Clinical Based Learning\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Cynthera McNeill, Detroit, MI\",\n        \"Umeika Stephens, Detroit, MI\",\n        \"Tara Walker, Detroit, MI\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDMxOCwicHVyIjoiYmxvYl9pZCJ9fQ==--e5908df7f87de6c13cea182a58667fce24beecb7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/thumbnail.jpeg\",\n    \"description\": \"Urban Health: A Practical Application for Clinical Based Learningis an openly licensed, peer-reviewed textbook for clinical-based nursing educators covering barriers in urban health and their impact on patient health outcomes. The authors explore perspectives of urban communities, urban patients, and urban healthcare providers to offer insight into how healthcare providers can address disparities in urban healthcare, provide meaningful care with the lived experiences of urban patients in mind, and improve patient-provider communication by moving towards a more solution-driven, team-based care approach. Features include learning activities, exemplars, and case studies.\",\n    \"publisher\": \"Wayne State University Library System\",\n    \"language\": \"English\",\n    \"isbn13\": \"9798985775419\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/urban-health-a-practical-application-for-clinical-based-learning\"\n}",
    "{\n    \"title\": \"The Centrality of Style\",\n    \"copyright_year\": \"2013\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Mike Duncan, University of Houston-Downtown\",\n        \"Star M. Vanguri, Nova Southeastern University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjM2LCJwdXIiOiJibG9iX2lkIn19--16070c017451ec9930496d565e8b5cf911da2142/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602354227.png\",\n    \"description\": \"InThe Centrality of Style, editors Mike Duncan and Star Medzerian Vanguri argue that style is a central concern of composition studies even as they demonstrate that some of the most compelling work in the area has emerged from the margins of the field. Calling attention to this paradox in his foreword to the collection, Paul Butler observes, \\\"Many of the chapters work within the liminal space in which style serves as both a centralizing and decentralizing force in rhetoric and composition. Clearly, the authors and editors have made an invaluable contribution in their collection by exposing the paradoxical nature of a canon that continues to play a vital role in our disciplinary history.\\\"\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602354227\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-centrality-of-style\"\n}",
    "{\n    \"title\": \"El Niño Entero: Desarrollo en los Primeros Años — Translation of The Whole Child\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Deirdre Budzyna, Northern Essex Community College\",\n        \"Doris Buckley, Northern Essex Community College\",\n        \"Sharline Del Rosario, Northern Essex Community College\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMzMjgsInB1ciI6ImJsb2JfaWQifX0=--aca698713ea01d92d2efbac689bd13d33727962d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover_RotelProject-NECC_ElNinoEntero-Buckley-768x994.jpg\",\n    \"description\": \"El Niño Entero es un libro de texto de Psicología Infantil o Crecimiento y Desarrollo Infantil que es a la vez completo y conciso. Los estudiantes no necesitan un volumen extenso para digerir, pero sí necesitan una comprensión sólida de cómo se desarrolla un niño pequeño. Sólo con esta comprensión pueden surgir prácticas apropiadas para el desarrollo en el aula y en otros lugares que sean espacios de amor y cuidado para los niños pequeños. Con el costo creciente de los libros de texto, este libro de texto es un recurso para los instructores que buscan encontrar materiales accesibles y de calidad para nuestros estudiantes.The Whole Child is a textbook for Child Psychology or Child Growth and Development that is both comprehensive and concise. Students do not need a lengthy volume to digest, but they do need a strong understanding of how a young child develops. Only with this understanding can developmentally appropriate practice emerge in the classroom and in other places that are loving and caring spaces for young children. With the rising cost of textbooks, this textbook is a resource for instructors looking to find quality, accessible materials for our students.\",\n    \"publisher\": \"ROTEL\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/el-nino-entero-desarrollo-en-los-primeros-anos-translation-of-the-whole-child\"\n}",
    "{\n    \"title\": \"Conducting Mixed-Methods Research: From Classical Social Sciences to the Age of Big Data and Analytics\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Viswanath Venkatesh, Virginia Tech\",\n        \"Susan (Sue) Brown, University of Arizona\",\n        \"Yulia Sullivan, Baylor University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2NjAsInB1ciI6ImJsb2JfaWQifX0=--ef9c9c63cfafe5e048fe9f3a561eb0bf6115f8c2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/conducting.jpg\",\n    \"description\": \"Scholars in the social sciences are increasingly expected to incorporate both quantitative and qualitative techniques and methods into their research. The growth of “mixed-methods” research is evident in social science disciplines ranging from psychology and management to marketing and information systems. This book is designed to provide principles, strategies, and guidance specifically for researchers in these disciplines so that they can use mixed-methods research more effectively.In thirteen chapters,Conducting Mixed-Methods Researchtakes readers through the research process, from defining research questions to writing articles using a mixed-methods approach. For those who are well trained in either qualitative or quantitative methods, the book shows them how to think about the purposes of mixed-methods research, design mixed-methods studies, and develop meta-inferences by integrating findings from both methods. Throughout, the discussion is grounded in examples taken from published research, carefully chosen to highlight best practices, thus opening a window into a broad body of mixed-methods research applications.\",\n    \"publisher\": \"Virginia Tech Libraries\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781957213682\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/conducting-mixed-methods-research-from-classical-social-sciences-to-the-age-of-big-data-and-analytics\"\n}",
    "{\n    \"title\": \"The Roles and Responsibilities of the Special Educator\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Paula B. Lombardi, University of New Hampshire\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\",\n        \"Elementary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE2OTEsInB1ciI6ImJsb2JfaWQifX0=--f25e8b8bab1b4a48876270d57da9a7fdb959335c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/EDC703-350x525.jpg\",\n    \"description\": \"This book is evolving into a book by and for teacher candidates pursuing licensing in Elementary, General Special Education, and Early Childhood Special Education in New Hampshire and surrounding New England states. These teacher candidates share their knowledge about teaching PreK-12 learners with disabilities and the many roles and responsibilities of the case manager/special educator.\",\n    \"publisher\": \"University of New Hampshire\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-roles-and-responsibilities-of-the-special-educator\"\n}",
    "{\n    \"title\": \"Working With Academic Literacies: Case Studies Towards Transformative Practice\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Theresa Lillis, The Open University\",\n        \"Kathy Harrington, London Metropolitan University\",\n        \"Mary Lea, Open University\",\n        \"Sally Mitchell, Queen Mary University of London\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjUyLCJwdXIiOiJibG9iX2lkIn19--3763c1790c4e86061fd1750c667b8848359a8643/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781602357617.png\",\n    \"description\": \"The editors and contributors to this collection explore what it means to adopt an \\\"academic literacies\\\" approach in policy and pedagogy. Transformative practice is illustrated through case studies and critical commentaries from teacher-researchers working in a range of higher education contexts—from undergraduate to postgraduate levels, across disciplines, and spanning geopolitical regions including Australia, Brazil, Canada, Cataluña, Finland, France, Ireland, Portugal, South Africa, the United Kingdom, and the United States. Key questions addressed include: How can a wider range of semiotic resources and technologies fruitfully serve academic meaning and knowledge making? What kinds of writing spaces do we need and how can these be facilitated? How can theory and practice from \\\"Academic Literacies\\\" be used to open up debate about writing pedagogy at institutional and policy levels?\",\n    \"publisher\": \"WAC Clearinghouse\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781602357617\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/working-with-academic-literacies-case-studies-towards-transformative-practice\"\n}",
    "{\n    \"title\": \"Oregon Writes Open Writing Text\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jenn Kepka\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Higher Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjQ1LCJwdXIiOiJibG9iX2lkIn19--81c03fb87f5330686595e3f1e55010fa7809f4ed/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000OreWriOWT.jpg\",\n    \"description\": \"This textbook guides students through rhetorical and assignment analysis, the writing process, researching, citing, rhetorical modes, and critical reading. Using accessible but rigorous readings by professionals throughout the college composition field, the Oregon Writes Writing Textbook aligns directly to the statewide writing outcomes for English Composition courses in Oregon.\",\n    \"publisher\": \"Open Oregon Educational Resources\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/oregon-writes-open-writing-text\"\n}",
    "{\n    \"title\": \"Trauma Informed Behaviour Support: A Practical Guide to Developing Resilient Learners\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kay Ayre, Edith Cowan University\",\n        \"Govind Krishnamoorthy, University of Southern Queensland\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Early Childhood\",\n        \"Elementary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTc4OSwicHVyIjoiYmxvYl9pZCJ9fQ==--0d2886e738c108df9c1445b7b588da6de40068f0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/TIBS_BOOKCOVER-002-350x559.png\",\n    \"description\": \"If we want to impact the world of children who have experienced trauma then we must change not only ourselves and our classroom, but we must change our schools, our organisations, and our systems of care for children.  We must all speak out for these children who have no voice to bring awareness of new educational and mental health approaches to children who will become tomorrow’s failed adults unless they receive our understanding and our help.For whatever reason you have been attracted to this book, you have come to the right place.  You may at times put it down and wonder if the challenge is too great, but trust me it is not.  If you stay engaged with this book and with a child who has experienced trauma then you will learn new understandings, new ideas and new ways to reach the mind, the heart and the soul of young people who need our support and our love.\",\n    \"publisher\": \"University of Southern Queensland\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780648769835\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/trauma-informed-behaviour-support-a-practical-guide-to-developing-resilient-learners\"\n}",
    "{\n    \"title\": \"Amalgamation\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Timothy Krause, Portland Community College\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI0MTgsInB1ciI6ImJsb2JfaWQifX0=--bf76ffc1114157536b12d8f87e267593e68bd2d6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Amalgamation%20Cover%20-%20Google%20Docs.jpg\",\n    \"description\": \"This intermediate writing course is designed for ESOL students as their first step toward academic writing in U.S. colleges. Each two-week unit integrates vocabulary, grammar, and composition in a \\\"just in time\\\" fashion so that students receive instruction on the key tools they need in order to accomplish new writing goals. The lessons cover a basic essay, narrative essay, process essay, and compare/contrast essay. There is also a final one-week unit devoted to editing and proofreading skills. This edition is an update and expansion of work by Delpha Thomas.\",\n    \"publisher\": \"Portland Community College\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/amalgamation\"\n}",
    "{\n    \"title\": \"Trauma Informed Education\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Govind Krishnamoorthy, Toowoomba, Australia\",\n        \"Kay Ayre, Joondalup, Australia\",\n        \"Dayna Schimke, Queensland, Australia\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU0MSwicHVyIjoiYmxvYl9pZCJ9fQ==--7bf44436927d8ffb87944343f13b4ea5d4b30e8e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/TIE_BookCover_1-687x1024.png\",\n    \"description\": \"As an educator, have you ever wondered about students, “Why can’t she just control her behaviour?” or “Why did he do that?” The demands of the classroom, and the scrutiny of teachers, often leave little time for teachers to consider the complex needs of children experiencing traumatic stress. Drawing on their lived experience and professional expertise, the conversations with trauma-informed education experts in this unique book offer educators an opportunity to develop a deeper understanding of the needs of students and strategies for responding with compassion and empathy. In a time of rapidly emerging scientific discovery, and social and political challenges, this book encourages educational leaders to question the fundamental assumptions of dominant pedagogical practices and sets the foundations for innovation in education.\",\n    \"publisher\": \"University of Southern Queensland\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/trauma-informed-education\"\n}",
    "{\n    \"title\": \"Technology in Schools\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Gary L Ackerman, Greenfield, Massachusetts\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzc0MiwicHVyIjoiYmxvYl9pZCJ9fQ==--4f69db6c2729cbdef07035be26476c7b138ed307/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/TIS_web-2.png\",\n    \"description\": \"My purpose in writing this book is to give readers a view into the work of managing information technology in schools. IT professionals will notice differences (some nuanced and some significant) between the needs and expectations of IT users in business and IT in school. With the more complete and more accurate concept the nature of the computing environment necessary for successful schooling, which I intend to provide through this book, IT professionals will be better prepared to meet those needs. Educators will also benefit from this book by clarifying the nature of their IT needs and how these may be different from those that are familiar to IT professionals who are hired to work in your school.\",\n    \"publisher\": \"hackscience.education\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/technology-in-schools\"\n}",
    "{\n    \"title\": \"Guía Para Realizar Textos Abiertos Con Estudiantes\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Elizabeth Mays\",\n        \"Robin DeRosa, Plymouth State University\",\n        \"Rajiv Jhangiani, Kwantlen Polytechnic University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTk1LCJwdXIiOiJibG9iX2lkIn19--f96ce2823de1268e1470797e527042b6d6c194af/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781989014035.png\",\n    \"description\": \"¿Qué es la pedagogía abierta? ¿Cómo la están poniendo en práctica los profesores en sus aulas para construir textos abiertos y otros recursos educativos abiertos? ¿Cuáles son las ventajas de la pedagogía abierta? Esta sección responde a estas preguntas y proporciona ideas para trabajar dentro de las estructuras de enseñanza existentes para introducir la pedagogía abierta en sus clases.\",\n    \"publisher\": \"Pontificia Universidad Católica de Valparaíso\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781989014035\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/guia-para-realizar-textos-abiertos-con-estudiantes\"\n}",
    "{\n    \"title\": \"Making and Being\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Susan Jahoda, University of Massachussetts-Amherst\",\n        \"Caroline Woolard, University of Hartford\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzI4MCwicHVyIjoiYmxvYl9pZCJ9fQ==--9ee959a01fe1ce8486f9face67b5119dafa4609b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/making-and-being-51.jpg\",\n    \"description\": \"Making and Being offers a framework for teaching art that emphasizes contemplation, collaboration, and political economy. Authors Susan Jahoda and Caroline Woolard, two visual arts educators and members of the collective BFAMFAPhD*, share ideas and teaching strategies that they have adapted to spaces of learning which range widely, from self-organized workshops for professional artists to Foundations BFA and MFA thesis classes. This hands-on guide includes activities, worksheets, and assignments and is a critical resource for artists and art educators today. Making and Being is a book, a series of videos, a deck of cards, and an interactive website with freely downloadable content (click on links below to download worksheets, activities, and chapters as PDFs and editable Google Docs).*BFAMFAPhD is a collective that formed in 2012 to make art, reports, and teaching tools to advocate for cultural equity in the United States. The work of the collective is to bring people together to analyze and reimagine relationships of power in the arts. BFAMFAPhD core members are: Susan Jahoda, Emilio Martínez Poppe, Agnes Szanyi, Emily Tareila, Vicky Virgin, and Caroline Woolard.We wrote this book for those of you who want a holistic art education that includes how to be both more fully present with yourself and with others. The term holistic means that the parts of any given system are intimately interconnected; that they are understandable only in relation to the whole system. How can you talk about making a new project without talking about labor conditions? How can you talk about labor conditions without talking about payment? It’s time to address your artistic labor, your budgets your storage units, your gifts, and your well-being.\",\n    \"publisher\": \"Pioneer Works Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/making-and-being\"\n}",
    "{\n    \"title\": \"Technology Tools for Leaders\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Andrea Bearman, Trine University\",\n        \"Jill Noyes, Trine University\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTQ3NSwicHVyIjoiYmxvYl9pZCJ9fQ==--b86f8f65a4f83f3f9dfb148a4dddcdf05022f327/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Trigonometric-Ratios-Math-Poster-350x467.png\",\n    \"description\": \"With the vast and varied technologies available to leaders, it is no doubt managing these technologies can be challenging. Yet, leaders must have a sense of which technologies will help the organization and its members to be successful. While an organizational leader does not need to be a technology expert, having an awareness of the impact technology has on an organization is important.\",\n    \"publisher\": \"Palni Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/technology-tools-for-leaders\"\n}",
    "{\n    \"title\": \"Foundations of Education\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Lisa AbuAssaly-George\",\n        \"Kanoe Bunney\",\n        \"Ceci De Valdenebro\",\n        \"Tanya Mead\",\n        \"Jennifer Margolis\"\n    ],\n    \"subjects\": [\n        \"Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA2NjMsInB1ciI6ImJsb2JfaWQifX0=--fa4b38afd958a6c53516e0b871c28775c378e4dd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/nvdj9y2-front-shortedge-384.jpg\",\n    \"description\": \"This dynamic and equity-focused Open Educational Resource serves as a multifaceted textbook for Foundations of Education courses in post secondary institutions.\",\n    \"publisher\": \"Open Oregon Educational Resources\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781312028470\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/foundations-of-education\"\n}",
    "{\n    \"title\": \"Using Open Educational Resources to Promote Social Justice\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Kevin Adams, Alfred, NY\",\n        \"Murray Anderson, Athabasca, Alberta\",\n        \"Elissah Becknell, Minneapolis, MN\",\n        \"CJ Ivory, Carrollton, Georgia\",\n        \"Angela Pashia, Carrollton, Georgia\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDE1MCwicHVyIjoiYmxvYl9pZCJ9fQ==--1ccbc7832340f1611a66432b846dfb1484f4092c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9780838936771_OA%20(dragged).jpg\",\n    \"description\": \"As so often is the case, the idea for this book came from a twisting path. Not long after we began collaborating and presenting together at conferences, we were invited to draft a chapter on critical race theory (CRT) in academic libraries. An invited chapter is, of course, very flattering, so we proceeded without much thought to who the publisher would be. Angela had been working on social justice issues for a while at that point, while CJ had a wealth of expertise on open educational resources (OER). We merged our two areas of expertise in drafting that chapter, discussing OER as an opportunity to not only save students money but incorporate CRT into the curriculum—both in content and in practice.We submitted the final draft and were dismayed when we received the publication agreement. The publisher was unwilling to allow us to retain the copyright, even after we shared the licensing agreement that the Association of College & Research Libraries (ACRL) Press uses as an example. In discussing how to proceed—should we submit this chapter somewhere else?—we realized that we were really excited about extending the discussion of OER beyond just ensuring that all students can afford to access their course materials. So we pitched the idea of an edited volume on this topic to a publisher that we know has publishing practices we support (chapter authors retain copyright and select the Creative Commons license they prefer for their work), and here we are!Our entrance to academic work on social justice was through a focus on CRT. We outline this background here but wish to emphasize that it explicitly addresses only one aspect of social justice. For us, the structural understanding of racism in the United States creates a foundation upon which to understand other structures of oppression as well as intersectionality.\",\n    \"publisher\": \"Association of College and Research Libraries\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/using-open-educational-resources-to-promote-social-justice\"\n}",
    "{\n    \"title\": \"Elementary Earth and Space Science Methods\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Ted Neal, University of Iowa\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkzMCwicHVyIjoiYmxvYl9pZCJ9fQ==--021d13f1d50164257107d7f59975c9dc29db5457/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/IMG_1014-350x233.jpg\",\n    \"description\": \"We created this book to help you as both a college student and a future teacher. Dr. Ted Neal asked us to help him create this resource from the perspective of students who have taken Science Methods II–what would we want in a textbook for this course? With this in mind, we have gathered and created resources to help you better understand science and feel confident in your abilities as a future teacher.This book is divided into five parts which align with the Science Methods II course:PhysicsSpace ScienceEarth ScienceClimate ScienceCourse Materials and PedagogyWithin each part, the material is broken down into smaller chapters. Here you will find written explanations, video links, glossary terms, key takeaways, and practice quizzes to help you understand the material. This book is designed to be a flexible resource; use it as much or as little as you need throughout the course.\",\n    \"publisher\": \"University of Iowa\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/elementary-earth-and-space-science-methods-2019\"\n}",
    "{\n    \"title\": \"Contextualised open educational practices: Towards student agency and self-directed learning\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jako Olivier, Mahikeng, South Africa.\",\n        \"Charlene du Toit-Brits, Potchefstroom, South Africa\",\n        \"Byron J. Bunt, Vanderbijlpark, South Africa\",\n        \"Amit Dhakulkar, Potchefstroom, South Africa.\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDU4NywicHVyIjoiYmxvYl9pZCJ9fQ==--25c3347c2f39cc89a5eb16e85995aaee8e942beb/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/thumbnail.jpeg\",\n    \"description\": \"This book covers original research on the implementation of open educational practices through the use of open educational resources at the university level. The emphasis on open education in this book is on contextualising resources, supporting student agency and fostering self-directed learning specifically within a South African milieu. The envisaged chapters cover conceptual and review research and empirical work focussing on open educational practices and the use of renewable assessments. The work starts off with an overview of an institutional-wide open education project that prompted the research followed by research on open education in terms of various modules in the health science, music education, law, philosophy, dietetics, anthropology, French language learning, journalism and political science. There is a clear gap in the literature on open education in terms of open educational practices, specifically in terms of contextualising resources, supporting student agency and fostering self-directed learning in a South African context. Despite the existence of some general works on open education in terms of policy, social justice and open textbooks, this book will be unique in exploring the intersections of openness, specifically with contextualisation, student agency and self-directedness.\",\n    \"publisher\": \"AOSIS Publishing\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781779952653\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/contextualised-open-educational-practices-towards-student-agency-and-self-directed-learning\"\n}",
    "{\n    \"title\": \"Foundations of Learning and Instructional Design Technology\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Richard E> West, Brigham Young University\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjEwNCwicHVyIjoiYmxvYl9pZCJ9fQ==--3e0ffa0d0ebfd57bf062a0945dfe200fced4ca3d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/3_md_09-11-2019_014748.jpg\",\n    \"description\": \"This book received the 2018 AECT Outstanding Book Award!\\\"What is this field?\\\" \\\"Where have we come from as a discipline, and where are we going?\\\" \\\"What do I want to study?\\\" These and other questions are typical for new students in the field of Learning and Instructional Design Technology. This textbook is designed to help answer these questions and provide the quickest route to understanding the history and current trends in the field. After surveying classic theories and writings, as well as more recent applications of theory and practice, students will be better prepared to chart their own course and careers within the discipline. This book is designed to support foundations courses common in departments, as well as seminars on current trends and issues.\",\n    \"publisher\": \"EdTech Books\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/foundations-of-learning-and-instructional-design-technology\"\n}",
    "{\n    \"title\": \"Introduction to Curriculum for Early Childhood Education\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": \"2019\",\n    \"authors\": [\n        \"Jennifer Paris, College of the Canyons\",\n        \"Kristin Beeve, College of the Canyons\",\n        \"Clint Springer, College of the Canyons\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Curriculum and Instruction\",\n        \"Early Childhood\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzY5LCJwdXIiOiJibG9iX2lkIn19--68caf47721bf3759afb9a693635307ded8ae0db4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntCurChi.png\",\n    \"description\": \"Welcome to learning about how to effectively plan curriculum for young children. This textbook will address:Developing curriculum through the planning cycleTheories that inform what we know about how children learn and the best ways for teachers to support learningThe three components of developmentally appropriate practiceImportance and value of play and intentional teachingDifferent models of curriculumProcess of lesson planning (documenting planned experiences for children)Physical, temporal, and social environments that set the stage for children’s learningAppropriate guidance techniques to support children’s behaviors as the self-regulation abilities mature.Planning for preschool-aged children in specific domains includingPhysical developmentLanguage and literacyMathScienceCreative (the visual and performing arts)Diversity (social science and history)Health and safetyHow curriculum planning for infants and toddlers is different from planning for older childrenSupporting school-aged children’s learning and development in out-of-school time through curriculum planningMaking children’s learning visible through documentation and assessment\",\n    \"publisher\": \"College of the Canyons\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-curriculum-for-early-childhood-education\"\n}",
    "{\n    \"title\": \"Trauma-Informed School Practices: Building Expertise To Transform Schools\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Anna A. Berardi\",\n        \"Brenda M. Morton\"\n    ],\n    \"subjects\": [\n        \"Education\",\n        \"Elementary Education\",\n        \"Secondary Education\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzQ4LCJwdXIiOiJibG9iX2lkIn19--9b93af791518977a3f0469190620999372bcc082/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/trauma%20front%20cover.jpg\",\n    \"description\": \"This textbook represents the combined insight and experience of Morton, a k12 educator, and Berardi, a psychotherapist, both of whom are also university educators with extensive work experience serving districts and their teachers seeking to incorporate trauma-informed principles into their school culture and classroom. The authors identify that the field of education is now ready to deepen its level of response to the paradigm shift created by advances in neuroscience and traumatology. Hence, the primary focus is on identifying and applying trauma-informed educator competencies needed to transform districts, schools, educators, classrooms, and the field of education itself, while also including community members such as parents and board members in these processes - a total system makeover. At the conclusion of this text, the student, educator, or mental health professional will have a deeper understanding of what trauma-informed practice requires of them. This includes practical strategies on how to transform our learning communities in response to the devastating effect of unmitigated stress and trauma on our student's ability to learn and thrive throughout the lifespan.\",\n    \"publisher\": \"George Fox University Library\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/trauma-informed-school-practices-building-expertise-to-transform-schools\"\n}"
]