[
    "{\n    \"title\": \"Professional Responsibility: An Open-Source Casebook\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Brian L. Frye, University of Kentucky - College of Law\",\n        \"Elizabeth Schiller, University of Richmond - William Taylor Muse Law Library\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE4MCwicHVyIjoiYmxvYl9pZCJ9fQ==--22d7dd511d54dd9d7446882b0a20d47cfba9ec4f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/profrespo.png\",\n    \"description\": \"We wanted this casebook to be as easy to use and understand as possible. Accordingly, we included not only cases, but also the text of the rules and restatements, as well as concise explanations of the relevant law. Each chapter of the book addresses a different issue, in the following format. First, it clearly and concisely explains the relevant law governing that issue. Then provides the relevant text of any statutes, Model Rules, sections of the Restatement of the Law Governing Lawyers, or other sources, with a link to an open-source versions of the full text, when available. It provides one or more heavily edited cases intended to illustrate the application of the law at issue, with a link to an open-source version of the full text of the case. Each case is preceded by a brief summary of its facts, reasoning, and holding, and followed by questions intended to indicate subjects for further investigation or discussion. And finally, it includes citations to law review articles and other materials relevant to the law at issue, with links to open-source versions of those materials, when available.This casebook covers a wide range of different subjects related to the professional responsibility of attorneys. While it is possible to cover all of this material in a three credit-hour course, you may wish to omit some subjects. You may also wish to supplement the materials in this casebook with additional materials. We encourage you to use this casebook in any way that you like.\",\n    \"publisher\": \"Brian L. Frye & Elizabeth Schiller\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/professional-responsibility-an-open-source-casebook-frye\"\n}",
    "{\n    \"title\": \"Legal Writing I & II: Legal Research and Writing & Introduction to Litigation Practice\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Ben Fernandez\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"Legal Writing I & II; Legal Research and Writing & Introduction to Litigation Practice contains a brief discussion of all of the topics covered in a law school courses on legal writing, including a typical first semester course on legal research, analysis and writing an objective memorandum, as well as a second semester course on persuasion and writing an appellate brief, motion to dismiss or motion for summary judgment. The discussion focuses on the basics of analogical reasoning and persuasion and leaves out the minutiae. Each topic is taken one step at a time, with each step building on the step before it. The sources of law are presented first, then legal research, and reading and analyzing cases and statutes. The book covers analogizing a case to a fact pattern and marshaling the relevant facts to the elements of a statutory rule next. And then first section of the book concludes with legal citation, CRAC and CREAC, and writing a legal research memorandum. The text also includes a lot of samples and examples of how the author would write a case brief, a legal memoranda and an appellate brief, as well as an appendix with charts, outlines and exercises students can use to practice these skills. Legal Writing I & II; Legal Research and Writing & Introduction to Litigation Practice covers all the skills students need to know to work at a law firm, and everything students have to learn to begin practicing in litigation department of a firm.\",\n    \"publisher\": \"Ben Fernandez\",\n    \"language\": \"English\",\n    \"isbn13\": \"9798746520340\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/legal-writing-i-ii-legal-research-and-writing-introduction-to-litigation-practice\"\n}",
    "{\n    \"title\": \"U.S. Federal Income Taxation of Individuals 2023\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": \"2020\",\n    \"authors\": [\n        \"Deborah A Geier, Cleveland State University Cleveland Marshall College of Law\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQyMCwicHVyIjoiYmxvYl9pZCJ9fQ==--3f29df14dd12721c838caa2a65c73f9469bf6586/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Geier2023_Textbook_Cover.jpeg\",\n    \"description\": \"This is the tenth edition of this textbook, updated through December 15, 2022 for use beginning January 2023.In addition to incorporating new law and all inflation adjustments, this edition builds on updates made for the ninth edition and incorporates new charts pertaining to economic and tax data, including December 2019 CBO charts showing that income inequality between 2015 and 2020 (with the Tax Cuts and Jobs Act enacted in 2017) worsened after taxes and transfers than before taxes and transfers are taken into account.This textbook is not intended to be an exhaustive treatise; rather, it is intended to be far more useful than that for beginning tax law students by equipping the novice not merely with unmoored detail but rather with a rich blueprint that illuminates the deeper structural framework on which that detail hangs (sometimes crookedly). Chapter 1 outlines the conceptual meaning of the term income for uniquely tax purposes and examines the Internal Revenue Code provisions that translate this construct into positive law. Chapter 2 explores various forms of consumption taxation because the modern Internal Revenue Code is best perceived as a hybrid income-consumption tax that also contains many provisions that are inconsistent with both forms of taxation. Chapter 3 then provides students with the story of how we got to where we are today, important context about the distribution of the tax burden, the budget, and economic trends, as well as material on ethical debates, economic theories, and politics as they affect taxation.Armed with this larger blueprint, students are in a much better position to evaluate the myriad pieces that follow throughout the remaining 18 chapters. For example, they are in a better position to appreciate how applying the income tax rules for debt to a debt-financed investment afforded more favorable consumption tax treatment creates tax shelter problems. Stated another way, they can better appreciate how the tax system can sometimes be used to generate (or combat) unfair and economically inefficient rent-seeking behavior.eBook versions (mobi and epub) will be available for free in early January 2023.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/u-s-federal-income-taxation-of-individuals-2017\"\n}",
    "{\n    \"title\": \"Los gritos silenciosos de las víctimas de violencia de género: Un enfoque desde la perspectiva pre procesal y procesal penal en el Ecuador\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Diego Marcelo Bonilla-Morejon, Consejo de la Judicatura\",\n        \"Jefferson Steven Bonilla-Morejón, Abogado en libre ejercicio\",\n        \"Jaime Enrique Guano-Fogacho, Fiscalía General del Estado-Bolivar\",\n        \"Patricio Vladimir Meléndez-Carrasco, Fiscalía General del Estado\",\n        \"Franklin Remigio Murillo-Ramos, Consejo de la Judicatura\",\n        \"Sarita María Peña-Chauvín, Unidad Educativa San Lorenzo\",\n        \"Delia Paulina Samaniego-Quiguiri, Fiscalía General del Estado-Bolivar\",\n        \"Diego Fernando Solis-Miranda, Consejo de la Judicatura\",\n        \"Luis Humberto Vásquez-Quinatoa, Fiscalía General del Estado\",\n        \"Ronny Alejandro Núñez-Ribadeneyra, Universidad Estatal de Bolívar\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxMjEsInB1ciI6ImJsb2JfaWQifX0=--cae169cebf44b16d24c0ed153c111041dc5c974d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_41_41_coverImage_es_ES.jpg\",\n    \"description\": \"Con la globalización en la que nos encontramos la violencia contra la mujer o miembros del núcleo familiar ha ido en aumento ya que se desarrolla en cada uno de los hogares y esta ocurre cuando existe actos violentos por parte del agresor hacia las víctimas de este particular la mayoría de los casos son puestos en conocimiento de las autoridades competente. Hay que entender que América Latina donde los países son menos desarrollados, la violencia ocurre contra la mujer y ésta no tiene un índice real, debido a que la mayoría no pone en conocimiento de qué son víctimas de violencia. En el Estado ecuatoriano existen diversos tipos de violencia que son conocidos por fiscalía de mayor forma se dan los casos de violencia física y violencia psicológica estos tipos de violencia son los que se relacionan entre sí, es decir, la agresión física y psicológica. En el Ecuador con la reforma del Código Orgánico Integral Penal en el año 2019 y su posterior vigencia y aplicación en mes en el mes de junio del 2020, se da la implementación de nuevos mecanismos legales para suspender la sustanciación del proceso en materia de violencia contra la mujer o miembros del núcleo familiar, como procedimientos especiales para solucionar los problemas de esta materia considerando que la norma constitucional establece que el Estado garantizará a la víctima la sanción del agresor mediante procedimientos especiales en relación a la violencia.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942651006\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/los-gritos-silenciosos-de-las-victimas-de-violencia-de-genero-un-enfoque-desde-la-perspectiva-pre-procesal-y-procesal-penal-en-el-ecuador\"\n}",
    "{\n    \"title\": \"Advanced Legal Research: Process and Practice\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Megan Austin, University of Oregon\",\n        \"Allia Service\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA1NjUsInB1ciI6ImJsb2JfaWQifX0=--35e333ac3b893f602b00e1726b43baf1d7ae5f2e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Advanced-legal-research-cover-350x453.png\",\n    \"description\": \"Written for students and instructors in an advanced legal research course, this book uses the steps of the legal research process to facilitate skills practice, collaboration, and reflection. It proposes a hypothetical as a basis for practicing the research process steps and encourages students and instructors to contribute other hypotheticals. The text also includes sample assignments, demonstration videos, and discussion and reflection questions, with opportunities for students and instructors to contribute additional questions. This text uses an approach that emphasizes student reflection on the development of research skills, with the benefit of repeated and consistent formative feedback.\",\n    \"publisher\": \"University of Oregon Libraries\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/advanced-legal-research-process-and-practice\"\n}",
    "{\n    \"title\": \"What Color is Your C.F.R.?\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Elizabeth Gotauco, Merrimack Public Library\",\n        \"Nicole Dyszlewski, Roger Williams University School of Law Library\",\n        \"Raquel M. Ortiz, Roger Williams University School of Law\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjY0LCJwdXIiOiJibG9iX2lkIn19--7b08f32cc3be209a4a0db935fae84bfb77304538/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000WhCoisYou.png\",\n    \"description\": \"What Color is Your C.F.R.?is a problem-based law workbook with a colorful twist. Conceived and written by law librarians, it uses easy to understand plain language and is a light-hearted but helpful supplement to instruction on basic legal research. The book takes a non-traditional approach to legal research and uses short legal research exercises and coloring.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/what-color-is-your-c-f-r\"\n}",
    "{\n    \"title\": \"United States Copyright Law\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"eLangdell Press Editorial Staff\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODYsInB1ciI6ImJsb2JfaWQifX0=--7ff9554a63b5fccc5b57cb29aa5cc4fa2415c94e/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Copyrigh1.png\",\n    \"description\": \"This Intellectual Property Supplement from eLangdell Press contains the text of federal laws and regulations in the area of copyright, trademarks and patents. The editors have endeavored to gather all relevant laws, rules and regulations. This collection is intended to be used primarily as a statutory supplement for law students and legal scholars in academic settings, although practitioners in this area of law will also find it useful.This volume, Volume 1: Copyright Statutory Law contains the text of Title 17 of the United States Code as it appears on the most current edition available on the U.S. Government website FDSYS. Updates to the U.S. Code not yet found in the FDSYS published editions can be found in the United States House of Representatives Office of Law Revision Counsel's Classification Tables. Some formatting modification has been performed to better accommodate electronic readers.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/united-states-copyright-law\"\n}",
    "{\n    \"title\": \"The Law of Trusts\",\n    \"copyright_year\": \"2013\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Browne C. Lewis, Cleveland State University Cleveland Marshall College of Law\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjgyLCJwdXIiOiJibG9iX2lkIn19--156dfce8f9da6abdc7ca4f7a3487943d9ddc1966/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000TheLawTru.png\",\n    \"description\": \"The use of testamentary trusts is becoming an important part of estate planning. As a result, students who want to make a living as probate attorneys will need to know how trusts fit into estate planning. In addition, bar examiners realize that it is important for students to have a basic knowledge of trust law. That realization will result in bar examination questions that test that knowledge. This book is designed for use as a supplementary text for a course on wills and trusts and the primary text in a seminar or course exploring the law of trusts.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-law-of-trusts\"\n}",
    "{\n    \"title\": \"El derecho sucesorio y las legítimas: ¿Un equilibrio entre la autonomía testamentaria y la protección de los herederos forzosos?\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Delia Paulina Samaniego-Quiguiri, Fiscalía General del Estado\",\n        \"Rosa Elizabeth Campoverde-Jiménez, Consejo de la Judicatura\",\n        \"David Santiago Astudillo-Bermeo, Universidad Regional Autónoma de los Andes “UNIANDES”\",\n        \"Pablo Fausto Urbano-Urbano, Investigador Independiente\",\n        \"Hilda del Rocío Erazo-Domínguez, Notaría Segunda del cantón San Miguel Bolívar\",\n        \"Xavier Edgar Puente-Heredia, Investigador Independiente\",\n        \"Jaime Enrique Guano-Fogacho, Fiscalía General del Estado- Bolívar\",\n        \"Ricardo Paúl Aroca-Rivadeneira, Investigador Independiente\",\n        \"Thelmo Fernando Yánez-Erazo, Notaría Segunda del cantón San Miguel Bolívar\",\n        \"Wellington Amado Andachi-Trujillo, Investigador Independiente\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE4MTUsInB1ciI6ImJsb2JfaWQifX0=--50aebee14ea31b790d5ab15eb7bcae4b801b0148/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_76_76_coverImage_es_ES.png\",\n    \"description\": \"El derecho sucesorio, una rama del derecho privado, se ocupa de regular el traspaso de los bienes y derechos pertenecientes a un individuo fallecido hacia sus herederos. Este proceso, conocido como sucesión mortis causa, tiene como objetivo principal armonizar la libertad de disposición testamentaria del difunto con la salvaguardia de los herederos forzosos, aquellos que legalmente tienen derecho a recibir una porción de la herencia. Dentro del ámbito del derecho sucesorio, se establecen disposiciones normativas que rigen la distribución de los activos, así como los criterios de validez y formalidad de los testamentos. Además, se definen las legítimas, las cuales representan las porciones de la herencia destinadas a ser reservadas obligatoriamente para los herederos forzosos. Esta rama legal desempeña un papel fundamental en garantizar una distribución justa y equitativa de los bienes y derechos de una persona fallecida, al mismo tiempo que protege los derechos de los herederos forzosos y respeta la voluntad testamentaria del fallecido.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942651310\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/el-derecho-sucesorio-y-las-legitimas-un-equilibrio-entre-la-autonomia-testamentaria-y-la-proteccion-de-los-herederos-forzosos\"\n}",
    "{\n    \"title\": \"The Ethics of Tax Lawyering - Third Edition\",\n    \"copyright_year\": \"2013\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Michael Hatfield, Texas Tech University\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTcyMiwicHVyIjoiYmxvYl9pZCJ9fQ==--f2ed434ba987c4ada193cae3c2f58e37a3dff08c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/thirded.jpg\",\n    \"description\": \"This chapter's objective is to raise interesting tax ethics issues in practical contexts. There are 43 notes and questions to prompt and guide discussions, and primary source materials to inform the discussions (e.g., cases, IRC provisions, and Circular 230 excerpts). These Teaching Notes flesh out the notes and questions, summarize the cases, and provide additional information and suggestions for readings. Of course, the ultimate test for casebook materials lies in student interaction based on the materials, so I assigned the materials to my students, and, taking their reaction into account, I have made suggestions below as to materials to eliminate or emphasize in customizing for your own class.Faculty materials also available:In addition to the free, open learning materials for students listed above, this eLangdell chapter includes a teacher's manual. Faculty and staff at CALI member schools can access this and other faculty-only materials by logging in to eLangdell with their cali.org username and password. Contact CALI if you have questions.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-ethics-of-tax-lawyering\"\n}",
    "{\n    \"title\": \"Introduction to Criminal Law\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTk1OSwicHVyIjoiYmxvYl9pZCJ9fQ==--fae36e738293a4ac35631fc161540b8e2b88bbf2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Criminal-Law-683x1024.jpg\",\n    \"description\": \"Criminal Lawuses a two-step process to augment learning, called the applied approach. First, after building a strong foundation from scratch,Criminal Lawintroduces you to crimes and defenses that have been broken down into separate components. It is so much easier to memorize and comprehend the subject matter when it is simplified this way. However, becoming proficient in the law takes more than just memorization. You must be trained to take the laws you have studied and apply them to various fact patterns. Most students are expected to do this automatically, but application must be seen, experienced, and practiced before it comes naturally. Thus the second step of the applied approach is reviewing examples of the application of law to facts after dissecting and analyzing each legal concept. Some of the examples come from cases, and some are purely fictional. All the examples are memorable, even quirky, so they will stick in your mind and be available when you need them the most (like during an exam). After a few chapters, you will notice that you no longer obsess over an explanation that doesn't completely make sense the first time you read it—you will just skip to the example. The examples clarify the principles for you, lightening the workload significantly.\",\n    \"publisher\": \"University of Minnesota Libraries Publishing\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781946135087\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/criminal-law\"\n}",
    "{\n    \"title\": \"Business Law and the Legal Environment\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Miami\",\n        \"Daniel M. Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan Business School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjIzLCJwdXIiOiJibG9iX2lkIn19--9baaafe6fd15c3fb9029dcbf810982052016fcdd/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000BusLawLeg.png\",\n    \"description\": \"Our goal is to provide students with a textbook that is up to date and comprehensive in its coverage of legal and regulatory issues—and organized to permit instructors to tailor the materials to their particular approach. This book engages students by relating law to everyday events with which they are already familiar (or with which they are familiarizing themselves in other business courses) and by its clear, concise, and readable style. (An earlier business law text by authors Lieberman and Siedel was hailed “the best written text in a very crowded field.”)This textbook provides context and essential concepts across the entire range of legal issues with which managers and business executives must grapple. The text provides the vocabulary and legal acumen necessary for businesspeople to talk in an educated way to their customers, employees, suppliers, government officials—and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/business-law-and-the-legal-environment\"\n}",
    "{\n    \"title\": \"Advanced Business Law and the Legal Environment\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\",\n        \"Alyssa Rose Martina, Metro Parent Publishing Group\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA0LCJwdXIiOiJibG9iX2lkIn19--03a0ed03e7578dcd9ca9f6249a65a7559229ce74/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000AdvanBusi.png\",\n    \"description\": \"Mayer, Warner, Siedel and Lieberman's Advanced Business Law and the Legal Environment is an up-to-date textbook with coverage of legal and regulatory issues that are more technical than the topics in the authors' Foundations of Business Law and the Legal Environment.Appropriate for students who have already taken an introductory Legal Environment or Business Law course, the text is organized to permit instructors to tailor the materials to their particular approach.The authors take special care to engage students by relating law to everyday events with which they are already familiar with their clear, concise and readable style.Advanced Business Law and the Legal Environmentprovides students with context and essential legal concepts relating to the Uniform Commercial Code and various aspects of property law. The text provides the vocabulary and legal savvy necessary for business people to talk in an educated way to their customers, employees, suppliers, and other stakeholders — and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/advanced-business-law-and-the-legal-environment\"\n}",
    "{\n    \"title\": \"Evidence: Best Evidence Rule\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Colin Miller, University of South Carolina\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTAsInB1ciI6ImJsb2JfaWQifX0=--74a78a430e6f6f1dfcfda645a5803bf96c420c6b/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000EviBesEvi.png\",\n    \"description\": \"The Best Evidence Rule, contained in Article X of the Federal Rules of Evidence (Rules 1001-1008) and state counterparts, is a Rule that requires a party seeking to prove the contents of a writing, recording, or photograph to produce the original (or a duplicate) or account for its nonproduction. Through a series of cases and hypotheticals drawn from actual cases, this chapter gives readers a roadmap for how to address any Best Evidence Rule issue in practice.Faculty materials also available:In addition to the free, open learning materials for students listed above, this eLangdell chapter includes a teacher's manual. Faculty and staff at CALI member schools can access these materials by logging in to eLangdell with a cali.org username and password.Contact CALI.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/evidence-best-evidence-rule\"\n}",
    "{\n    \"title\": \"Federal Rules of Appellate Procedure\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"eLangdell Press Editorial Staff\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODUsInB1ciI6ImJsb2JfaWQifX0=--24caa156efaaa3ffdc2058f8fd71c2c0343f0e00/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Appellate.png\",\n    \"description\": \"The Federal Rules of Appellate Procedure appear in the Appendix to Title 28 of the United State Code. This publication was made with data provided by the United States government on the Office of Law Revision Counsel Bulk US Code.This title is current through July 31, 2014. All updates to this material will appear at the above URL.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/federal-rules-of-appellate-procedure\"\n}",
    "{\n    \"title\": \"Peculado Doloso y el Principio de Proporcionalidad de la Pena\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Cesar Percy Estrada-Ayre, Universidad Nacional de Huancavelica\",\n        \"Syntia Porras-Sarmiento, Universidad Nacional de Huancavelica\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTM0OSwicHVyIjoiYmxvYl9pZCJ9fQ==--fbd684c7e3671b28f7f0f23e2e781b171fc905f3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_32_32_coverImage_es_ES.png\",\n    \"description\": \"El presente trabajo se inicia del problema cuando se investiga de qué manera al sancionar con una misma pena en el delito de Peculado Doloso afecta el principio de proporcionalidad, por lo que es necesario remitirnos al artículo 387 del Código Penal, cuyo tenor es como sigue: El funcionario o servidor público que se apropia o utiliza, en cualquier forma, para sí o para otro, caudales o efectos cuya percepción, administración o custodia le estén confiados por razón de su cargo, será reprimido con pena privativa de la libertad no menor de dos ni mayor de ocho años. Constituye circunstancia agravante si los caudales o efectos estuvieran destinados a fines asistenciales o a programas de apoyo social. En estos casos, la pena privativa de la libertad será no menor de cuatro ni mayor de diez años. Según lo establecido por el Acuerdo Plenario N.° 4-2005/CJ-116, Pleno jurisdiccional de las Salas Penales Permanentes y Transitoria de la Corte Suprema de Justicia, los elementos del tipo penal de peculado son (i) la existencia de una relación funcional, (ii) la percepción, administración o custodia, (iii) apropiación o utilización, (iv) el destinatario: para sí o para un tercero, (v) caudales y efectos. El resultado fue que al sancionar con una misma pena en el delito de Peculado Doloso en su modalidad de apropiación y utilización visten de igual contenido de ilicitud, pese a las diferencias si las apreciamos desde una perspectiva patrimonialista o de salvaguarda del derecho de propiedad del ente público, en la modalidad de utilizar existe un exceso en la penalización afectándose el principio de proporcionalidad, razón por la cual debe tener un tratamiento distinto.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/peculado-doloso-y-el-principio-de-proporcionalidad-de-la-pena\"\n}",
    "{\n    \"title\": \"The Indigo Book: A Manual of Legal Citation - 2nd Edition\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Christopher Jon Sprigman, New York University\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzk5OSwicHVyIjoiYmxvYl9pZCJ9fQ==--179079b7525cd7021dde660a03a80c4fe3852dec/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-09-15%20at%208.57.11%20AM.png\",\n    \"description\": \"Welcome to The Indigo Book 2.0—a free, Creative Commons-dedicated implementation of the uniform system of citation commonly used in United States legal documents.The Indigo Book (2d ed. 2021) isn’t the same as The Bluebook: A Uniform System of Citation (21st ed. 2020), but it does implement the same system of citation that The Bluebook does. The scope of The Indigo Book’s coverage is roughly equivalent to The Bluebook’s “Bluepages”—that is, The Indigo Book covers legal citation for U.S. legal materials, as well as books, periodicals, and Internet and other electronic resources. For the materials that it covers, anyone using The Indigo Book will produce briefs, memoranda, law review articles, and other legal documents with citations that are compatible with the Uniform System of Citation. Although law students, scholars, and legal professionals sometimes talk about legal citation as if it is truly uniform, the fact is that legal citation has never actually been a uniform national system. Accordingly, The Indigo Book also provides insight into some of the discretionary preferences and jurisdiction specific variations found in legal citation throughout the United States.\",\n    \"publisher\": \"Public Resource\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-indigo-book-a-manual-of-legal-citation-sprigman\"\n}",
    "{\n    \"title\": \"Law School Materials for Success\",\n    \"copyright_year\": \"2013\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Barbara Glesner Fines\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTE4LCJwdXIiOiJibG9iX2lkIn19--cdeea57e2562c1414386d17320b19594ad88899a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000LawMatSuc.png\",\n    \"description\": \"The first year of law school is, for many people, one of the most significant transitions of their adult life. Law school demands a lot as it helps you make the transition from your prior identity as student (or as some other occupational role) to your new identity as an attorney. To meet the demands of law school, it is often helpful to have the big picture before you begin – a sense of what it is you are trying to do as you prepare for classes, participate in those classes, review and prepare for exams, take exams, and then begin the cycle once again.Law School Materials for Success is designed to give you the essentials of that process. It is purposefully brief – most law students do not have the time for an extensive examination of the study of law school. Rather, they need a source for some basic, critical advice and some pointers on where to go for more if necessary. That is what this book and the accompanying podcasts are designed to provide.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/law-school-materials-for-success\"\n}",
    "{\n    \"title\": \"Introduction to Intellectual Property Law\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Jason Rantanen, University of Iowa\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTMxMTMsInB1ciI6ImJsb2JfaWQifX0=--32e7b4793d948d119ce8ecc401bb66d0e59434d9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Intro-to-IP-law_front-cover.png\",\n    \"description\": \"Unlike traditionally published casebooks, which typically include short case excerpts providing key rules or doctrine,Introduction to Intellectual Property Lawfeatures one or two judicial opinions per chapter, in their entirety, along with descriptive notes to fill in the details. The resulting collection can be read on any device, free of charge.Because reading full opinions is not easy, especially at the beginning of a legal career, another important component of this casebook are sets of questions to focus on while reading the cases. Lawyers generally approach texts this way, reading with purpose rather than to glean abstract knowledge. As you read the opinions, do it with a mind toward answering the questions posed.\",\n    \"publisher\": null,\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-intellectual-property-law\"\n}",
    "{\n    \"title\": \"Contract Doctrine, Theory & Practice Volume 3\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"J.H. Verkerke, University of Virginia\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQ0LCJwdXIiOiJibG9iX2lkIn19--ff10a759a27c19e8c5940bbadb78acc2d83ae5a0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ConDocVo3.png\",\n    \"description\": \"This is Volume 3 in a three volume series written for Contracts Law. Its former title is \\\"Collaborative Teaching Materials for Contracts.\\\"The first semester of law school is mostly about learning to speak a new legal language (but emphatically not “legalese”), to formulate and evaluate legal arguments, to become comfortable with the distinctive style of legal analysis. We could teach these skills using almost any legal topic. But we begin the first-year curriculum with subjects that pervade the entire field of law. Contract principles have a long history and they form a significant part of the way that lawyers think about many legal problems. As you will discover when you study insurance law, employment law, family law, and dozens of other practice areas, your knowledge of contract doctrine and theory will be invaluable.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/contract-doctrine-theory-practice-volume-3\"\n}",
    "{\n    \"title\": \"Government Regulation and the Legal Environment of Business\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE0LCJwdXIiOiJibG9iX2lkIn19--6f60418b572511d7722f062abd4298ad1eb721f7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453343272.png\",\n    \"description\": \"Mayer, Warner, Siedel and Lieberman's Government Regulation and the Legal Environment of Business is an up-to-date textbook that covers legal issues that students must understand in today's highly regulated business environment. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business, Government Regulation and the Legal Environment of Business provides students with context and essential legal concepts relating to contracts, consumer credit transactions, bankruptcy, intellectual property, securities regulation, regulation of real estate, antitrust, unfair trade practices, employment law and labor relations. The text provides the vocabulary and legal savvy they will need to talk in an educated way to customers, suppliers, employees, creditors, shareholders, government regulators and other stakeholders — and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453343272\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/government-regulation-and-the-legal-environment-of-business\"\n}",
    "{\n    \"title\": \"Introduction to Contracts, Sales and Product Liability\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"This textbook provides context and essential concepts across the entire range of legal issues with whichmanagers and business executives must grapple. The text provides the vocabulary and legal acumennecessary for businesspeople to talk in an educated way to their customers, employees, suppliers,government officials—and to their own lawyers.Traditional publishers often create confusion among customers in the text selection process by offering ahuge array of publications. Once a text is selected, customers might still have to customize the text to meettheir needs. For example, publishers usually offer books that include either case summaries or excerptedcases, but some instructors prefer to combine case summaries with a few excerpted cases so that studentscan experience reading original material. Likewise, the manner in which most conventional textsincorporate video is cumbersome because the videos are contained in a separate library, which makesaccess more complicating for instructors and students.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453343265\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-contracts-sales-and-product-liability\"\n}",
    "{\n    \"title\": \"Legal Aspects of Corporate Management and Finance\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"Legal Aspects of Corporate Management and Financeis an up-to-date textbook that covers key legal issues relating to corporate management and finance. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Legal Aspects of Corporate Management and Financeprovides students with context and essential legal concepts relating to contracts, agency law, partnerships, corporations, commercial paper, debtors and creditors. The text provides the vocabulary and legal savvy students will need to talk in an educated way to customers, suppliers, employees, creditors, shareholders, government regulators and other stakeholders — and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453343258\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/legal-aspects-of-corporate-management-and-finance\"\n}",
    "{\n    \"title\": \"Foundations of Business Law and Legal Environment\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyLCJwdXIiOiJibG9iX2lkIn19--ef29acb7fe6ec2b1bae57420abb8e9b2345db59d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781453343722.png\",\n    \"description\": \"Mayer, Warner, Siedel and Lieberman's Foundations of Business Law and the Legal Environment is an up-to-date textbook with comprehensive coverage of legal and regulatory issues for your introductory Legal Environment or Business Law course.The text is organized to permit instructors to tailor the materials to their particular approach.The authors take special care to engage students by relating law to everyday events with which they are already familiar with their clear, concise and readable style.Business Law and the Legal Environment provides students with context and essential concepts across a broad range of legal issues with which managers and business executives must grapple. The text provides the vocabulary and legal savvy necessary for business people to talk in an educated way to their customers, employees, suppliers, government officials — and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453343722\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/foundations-of-business-law-and-legal-environment\"\n}",
    "{\n    \"title\": \"Introduction to the Law of Property, Estate Planning and Insurance\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"Introduction to the Law of Property, Estate Planning and Insuranceis an up-to-date textbook that covers legal issues that students must understand relating to real estate (an especially important business asset), as well as estate planning and insurance. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Introduction to the Law of Property, Estate Planning and Insuranceprovides students with context and essential legal concepts relating to property rights and duties, estate planning, insurance, secured transactions, mortgages, and related topics. The text provides the vocabulary and legal savvy they will need when working with these concepts, which are critical to business planning and success.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453344163\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-the-law-of-property-estate-planning-and-insurance\"\n}",
    "{\n    \"title\": \"Law of Wills\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Browne C. Lewis, Cleveland-Marshall College of Law\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjYyLCJwdXIiOiJibG9iX2lkIn19--f96e3972ded224fdf9ed88c33e4ea084b094edc4/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000LawoWills.png\",\n    \"description\": \"The purpose of this casebook is to train law students to think and act like probate attorneys. This book is meant to be used in conjunction with the author's book on the law of trusts. This book's focus is problem-solving and legal application; the book includes numerous problems, so law students can learn to apply the law they learn from reading the cases. It also contains collaborative learning exercises to encourage students to engage in group problem-solving. The book is divided into three parts to reflect the main types of issues that students will encounter if they practice probate law. The book's organization mirrors the manner in which probate law is practiced in the real world.The book starts with an examination of the intestacy system because the majority of people die without executing a will. Therefore, most of the legal issues a probate lawyer faces center around the intestacy system. Unlike the typical wills casebook, this book provides a detailed discussion of the intestacy system. A chapter on ethics is included because probate attorneys encounter ethical issues that are different from attorneys practicing in other areas of law.The second part of the book includes an exploration of the testacy system. It is arranged so professors can lead students from the client interview to the will execution. The first three chapters of this section deal with issues that directly impact the existence of the inheritance system. It analyzes a person's ability to control the disposition of his or her property after death. This serves as the students' first introduction to the power of the “dead hand”. These chapters are included to start a public policy discussion about the rights of the dead, the right of heirs, and the necessity of an inheritance system. I tell my students that, when executing a will, they must think of the ways that it can be contested. In addition, I tell them that a will can be contested on two fronts-an attack on the testator and an attack on the will. Two chapters in this part highlight the ways that the testator's ability to execute a valid will may questioned.The final chapters in this unit show the issues that can be raised to dispute the validity of the will. They also explain the different types of wills that are available. The final part of the book deals with non-probate transfers. These chapters are included to show students the other devises that people can use to distribute their property. That knowledge is important because the majority of people use these procedures to transfer their property. At the end of the semester, my students have to draft a will based upon a fact pattern that I give them. I intentionally include non-probate property in order to see if they will attempt to distribute that using the will.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/law-of-wills\"\n}",
    "{\n    \"title\": \"Global Corruption: Its Regulation under International Conventions, US, UK, and Canadian Law and Practice - Fourth Edition\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Gerry Ferguson, University of Victoria\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA1NjIsInB1ciI6ImJsb2JfaWQifX0=--401f022e41550c1dd2162041d4ba266b0b70a31a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/GlobalCorruption_Cver_4thEd_2022_web.png\",\n    \"description\": \"This book has been specifically created to make it easier for professors to offer a law school course on global corruption. It is also designed as a resource tool for all persons working in the anti-corruption field. The book is issued under a creative commons license and can be used for free in whole or in part for non-commercial purposes. The first chapter sets out the general context of global corruption: its nature and extent, and some views on its historical, social, economic and political dimensions. Each subsequent chapter sets out international standards and requirements in respect to combatting corruption – mainly in the UN Convention Against Corruption (UNCAC) and the OECD Bribery of Foreign Officials Convention (OECD Convention). The laws of the United States and United Kingdom are then set out as examples of how those Convention standards and requirements are met in two influential jurisdictions. Finally, the law of Canada is set out. Thus, a professor from Africa, Australia, New Zealand or English speaking countries in Asia and Europe has a nearly complete coursebook – for example, that professor can delete the Canadian sections of this book and insert the law and practices of his or her home country in their place. While primarily directed to a law school course on global corruption, this book will be of interest and use to professors teaching courses on corruption from other academic disciplines and to lawyers and other anti-corruption practitioners.\",\n    \"publisher\": \"University of Victoria\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/global-corruption-law-theory-practice-third-edition-ferguson\"\n}",
    "{\n    \"title\": \"United States Securities Law\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"eLangdell Press Editorial Staff\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTcxLCJwdXIiOiJibG9iX2lkIn19--2aed2ec00c893b5a2d2cc8d1c972e9cee1488cae/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000UniStaSec.png\",\n    \"description\": \"The United States Securities Code and Regulations appear in Title 15 of the United States Code and Title 17 of the Code of Federal Regulations. This publication was made with data provided by the United States government on the Office of Law Revision Counsel as well as the eCFR.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/united-states-securities-law\"\n}",
    "{\n    \"title\": \"Fundamentals of Business Law\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Melissa Randall, Community College of Denver\",\n        \"Community College of Denver Students, Community College of Denver\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyMCwicHVyIjoiYmxvYl9pZCJ9fQ==--03eae12db43fc55c3e05cc1aa571b8fd07db39d0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/fundbuslaw.jpg\",\n    \"description\": \"Undergraduate business law textbook written by Melissa Randall and Community College of Denver Students in collaboration with lawyers and business professionals for use in required 200 level business law courses in the United States. This book is an introductory survey of the legal topics required in undergraduate business law classes.\",\n    \"publisher\": \"Melissa Randall\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/fundamentals-of-business-law-randall\"\n}",
    "{\n    \"title\": \"Religion in the Law: An Open Access Casebook - First Edition\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Joe Dunman, Morehead State University\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Constitutional Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjg2NywicHVyIjoiYmxvYl9pZCJ9fQ==--bc7823e915bbbf201fdc072e050cc3411d8d5360/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJKUEciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--427a9ad23b67f6db86d2706f85458e5f46b6e0ef/Rkewe.JPG\",\n    \"description\": \"This casebook features nearly sixty cases from American courts that involve, in some important way, religious belief and action. The book is divided into sections: First Principles, Establishment, Free Exercise, and Special Problems. Each section includes landmark or otherwise influential cases that have influenced American law and religious practice. Most cases come from the U.S. Supreme Court but the lower federal and state courts are also represented.In the contextual introductions to each section and subpart, I have tried to give the reader a basis for understanding how the cases came about and why I chose them for this book. I have tried to minimize editorial comment. I have cited some scholarship where I think it would be helpful, but please do not mistake this as an attempt to produce a comprehensive treatise on the subject of religion in the law. It is a casebook, and a short one, all things considered. At the end of each introductory part is a short “further reading” list. I chose those articles because I found each of them interesting and useful to under-standing the topics that precede them. Their selection is not necessarily an endorsement of each author’s arguments, though I do agree with some of them.I designed this casebook specifically for my own use in a 400-level undergraduate seminar called Law & Society. Class sessions using this book are intended to be student-led, roundtable talks with the professor acting as discussion prompter and neutral mediator. Generally, two cases are assigned for each class session. I selected, edited, and arranged the cases to complement each other thematically and chronologically to the best of my ability. Many of the cases include overlapping topics and could fit into multiple categories, so I took some liberties in their arrangement. Your mileage may vary.\",\n    \"publisher\": \"L. Joe Dunman\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/religion-in-the-law-an-open-access-casebook\"\n}",
    "{\n    \"title\": \"Extended Readings on Copyright - 2022\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Matthew Sag, Loyola University of Chicago School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM4NSwicHVyIjoiYmxvYl9pZCJ9fQ==--494f3c69b478e512bcefe58bde51ee9fe677d49c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Pw64AZuA.png\",\n    \"description\": \"Extended Readings on Copyright is subject to a non-commercial Create Commons license that allows you to add, subtract, and amend as you see fit, provided you extend those terms to any derivative work based on these materials and provided your provide appropriate attribution. I encourage you to share your edits and additions with me, but it is not obligatory.Extended Readings on Copyright can be used as a stand alone textbook on United States copyright law. The individual chapters are available on this website, and these can be used to supplement other materials. Individual chapters are likely to be more up to date than the consolidated build of the book.\",\n    \"publisher\": \"Matthew Sag\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/extended-readings-on-copyright\"\n}",
    "{\n    \"title\": \"Wetlands Law: A Course Source - 4th Edition\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": \"2018\",\n    \"authors\": [\n        \"Stephen M. Johnson, Mercer University School of Law\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDY5OCwicHVyIjoiYmxvYl9pZCJ9fQ==--83073c040559896afcd8ba6cf00079ac37ccca5f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Wetlands_Law_Coverpage(4thEdition).jpg\",\n    \"description\": \"This is therevised, fourth editionof The Wetlands Law Course Source. It can be used as the primary text for a two credit seminar or as a supplemental text to cover wetlands material in an environmental law, natural resources law, or water law course. In addition, the administrative law chapter can be used as a supplement in a range of administrative law-related courses, such as environmental law, health law, labor law, immigration law, and others, to introduce basic administrative law concepts.Unlike traditional casebooks or coursebooks, a “course source” includes resources to train students in all three apprenticeships identified by the Carnegie Foundation in its influential report on legal education,Educating Lawyers: Preparation for the Profession of Law. To address theknowledgeapprenticeship, the Wetlands Law Course Source includes all of the traditional elements of a casebook or coursebook (cases, commentary, notes and questions) and includes several hypotheticals and problem exercises that focus on reinforcing wetlands law. In addition, as one of the many forms of summative and formative assessment included in the book, every chapter includes one or more CALI exercise as a “quiz” to reinforce the material covered in the chapter.  To address theskillsapprenticeship, the Wetlands Law Course Source includes sixteen separate legal research exercises, several drafting exercises, a negotiation exercise, and an interviewing and counseling exercise. To address thevaluesapprenticeship, the Course Source includes several professionalism scenarios, with questions related to the scenarios.The Course Source also incorporates a wealth of audio/video materials and external links to bring the cases, disputes and materials in the book to life, including the audio for the oral arguments in most of the principal cases excerpted in the book, a Google map identifying the location of the properties involved in all of the principal cases excerpted in the book, decision documents, administrative orders, property maps, pictures, local media coverage and other background materials for the principal cases. While the principal cases have been edited, the book includes links to the full unedited versions of almost all of the cases in the book. Throughout each chapter, there are several “Resource” sections that identify reports, databases, audio or video materials, government documents, and other materials that are relevant to the topics covered in the chapter.  In addition, the book contains links to interviews that the author conducted regarding wetlands issues with attorneys who work with local communities and with the Department of Justice, the National Wildlife Federation, and the Environmental Council of the States. The links in the book have also been re-purposed as a web-based library of wetlands teaching resources, which is accessible at:https://www.envirolawteachers.com/wetlands-law-a-course-source.html\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/wetlands-law-a-course-source\"\n}",
    "{\n    \"title\": \"Trademark Law - 2022 Edition (Version 2.0)\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Michael Grynberg, Chicago, IL\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDUwMCwicHVyIjoiYmxvYl9pZCJ9fQ==--03e1837c986d5a13ad865628895ddba2e604e561/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-02-02%20at%2011.35.50%20AM.png\",\n    \"description\": \"Welcome to trademark law. This introductory chapter has three purposes. First, it outlines some basics of trademark law at a very high level of generality. Second, it outlines some traditional arguments for the protection of trademark rights. Finally, it introduces some issues that complicate the development and application of trademark law.\",\n    \"publisher\": \"Michael Grynberg\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/trademark-law\"\n}",
    "{\n    \"title\": \"Property Volume 1\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Christian Turner, University of Georgia Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjgwLCJwdXIiOiJibG9iX2lkIn19--1724a278150c4ad86611a913c70df3be7674dcc0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Property1.png\",\n    \"description\": \"This is Volume 1 of a two volume set written for Property Law. From the Preface: Property, as a vaguely defined collection of contract, tort, and criminal cases, does not take on the natural structure of a substantive area of the law through the systematic study of duty, breach, causation, defenses, and damages. Instead this textbook and most Property courses survey various topics in law with two goals in mind. First, we will study a number of traditional property topics, those where the issue of \\\"ownership\\\" and what that entails have long been thought to be a central issue. Second, but most importantly, our interdisciplinary study will introduce some of the major analytical techniques in law, from reasoning using precedent to law and economics to distributive justice. As we roam among topics, our goal is always, relentlessly to ask, \\\"Why?\\\" \\\"Why should the law protect this party's interest?\\\" These major techniques that we will pick up along the way will help us provide better and better answers to this question.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/property-volume-1\"\n}",
    "{\n    \"title\": \"Introduction to Criminology\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Shereen Hassan, Surrey, British Columbia\",\n        \"Dan Lett, Surrey, British Columbia\",\n        \"Leah Ballantyne, Pukatawagan, Manitoba\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDQ5NywicHVyIjoiYmxvYl9pZCJ9fQ==--415dfb50e8ecdc438d3d6f7f280ced34dcf00236/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/OE_Pressbooks-Cover_IntroToCriminology-768x994.jpeg\",\n    \"description\": \"Although this open education resource (OER) is written with the needs and abilities of first-year undergraduate criminology students in mind, it is designed to be flexible. As a whole, the OER is amply broad to serve as the main textbook for an introductory course, yet each chapter is deep enough to be useful as a supplement for subject-area courses; authors use plain and accessible language as much as possible, but introduce more advanced, technical concepts where appropriate; the text gives due attention to the historical “canon” of mainstream criminological thought, but it also challenges many of these ideas by exploring alternative, critical, and marginalized perspectives. After all, criminology is more than just the study of crime and criminal law; it is an examination of the ways human societies construct, contest, and defend ideas about right and wrong, the meaning of justice, the purpose and power of laws, and the practical methods of responding to broken rules and of mending relationships.Special thanks to Leah Ballantyne, LLB LLM, a Cree lawyer from the Mathias Colomb Cree Nation in Pukatawagan, Manitoba, who provided expert Indigenous consultation/editing for this textbook.\",\n    \"publisher\": \"Kwantlen Polytechnic University\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781989864647\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-criminology\"\n}",
    "{\n    \"title\": \"Gestión Empresarial: Concepción Legal bajo enfoque del proceso administrativo. Apuntes desde la perspectiva académica.\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"César Andrés Guerrero-Velástegui, Universidad Técnica de Ambato\",\n        \"Xavier Alexander Godoy-Calvachi, Universidad Técnica del Norte\",\n        \"Leonardo Daniel Castro-Cruz, Universidad Técnica del Norte\",\n        \"Jimena Maribel Torres-Pérez, Universidad Técnica del Norte\",\n        \"Fernando Neptalí Terán-Guerrero, Instituto Superior Tecnológico Vicente León\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxMzEsInB1ciI6ImJsb2JfaWQifX0=--a4fd4e75579470eb7c1daa27812240e13d833fd2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_43_43_coverImage_es_ES.jpg\",\n    \"description\": \"Los principios de gestión empresarial y la concepción jurídica de la empresa son dos aspectos cruciales para cualquier negocio exitoso. Mientras que los principios de la gestión empresarial se centran en el logro de los objetivos organizacionales mediante una planificación, organización y dirección eficaces, la concepción jurídica de la empresa se ocupa de los requisitos y regulaciones legales que las empresas deben cumplir. Comprender la intersección entre estas dos áreas es esencial para que cualquier propietario o gerente de negocio garantice el éxito de su empresa. En esta obra exploraremos los principios de la gestión empresarial, la concepción jurídica de la empresa y cómo se interrelacionan en su contenido. La gestión empresarial eficaz es esencial para lograr los objetivos organizacionales, maximizar las ganancias y mantener una ventaja competitiva. Los principios de la gestión empresarial incluyen la planificación, la organización y el liderazgo. La planificación implica definir objetivos, identificar recursos y crear estrategias para alcanzar las metas. Organizar implica crear estructuras organizativas, delegar responsabilidades y establecer canales de comunicación. Liderar implica motivar a los empleados, resolver conflictos y fomentar el trabajo en equipo. Estos tres principios son interdependientes y deben trabajar juntos para garantizar el éxito de cualquier negocio. Debiendo actuar de forma ética y apegado a derecho para su próspera gestión.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942651037\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/gestion-empresarial-concepcion-legal-bajo-enfoque-del-proceso-administrativo-apuntes-desde-la-perspectiva-academica\"\n}",
    "{\n    \"title\": \"Legal Aspects of Marketing and Sales\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"Legal Aspects of Marketing and Salesis an up-to-date textbook that covers legal issues that students who will work in marketing or with marketing managers must understand. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Legal Aspects of Marketing and Salesprovides students with context and essential legal concepts relating to contracts, sales, intellectual property, antitrust law and unfair trade practices. The text provides the vocabulary and legal savvy they will need to talk in an educated way to customers, suppliers, shareholders, government regulators and other stakeholders — and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453343289\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/legal-aspects-of-marketing-and-sales\"\n}",
    "{\n    \"title\": \"Federal Rules of Bankruptcy Procedure\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Scott A. Cromar, Knobbe Martens\",\n        \"Robert M. Lawless, University of Illinois\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTgsInB1ciI6ImJsb2JfaWQifX0=--f5e2072d569ec5a742774d68c64c3f60b5ef4cb7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000USBankrup.png\",\n    \"description\": \"The Federal Rules of Bankruptcy Procedureappear in the Appendix to Title 11 of the United State Code. This publication was made with data provided by the United States government on the Office of Law Revision Counsel Bulk US Code. This title is current through July 31, 2014.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/federal-rules-of-bankruptcy-procedure\"\n}",
    "{\n    \"title\": \"The Story of Contract Law: Formation\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": \"2019\",\n    \"authors\": [\n        \"Val Ricks, Professor of Law and Charles Weigel II Research Professor\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjcwLCJwdXIiOiJibG9iX2lkIn19--4f3982d4ca1896f1c3fff94c8dc73bf0e666653a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000StoConLaw.png\",\n    \"description\": \"This book, revised as the Third Edition July 2019, is designed to teach contract doctrine beginning with the most fundamental concepts and building on these until the structure of contract doctrine as coherent and cohesive regulation appears. The order of presentation is, in fact, the order in which contract doctrine developed historically, but it is also, in general, the order in which arguments are introduced in litigation.The book begins with the most basic, core concept of contract law—exchange. The book teaches exchange using simple cases drawn from the actual development of the exchange concept’s most obvious manifestation—the doctrine of consideration. These cases have basic but engaging facts. They do not take long to read, but they must be read carefully. They make an excellent introduction to law study.Logically, every doctrine of contract formation is centered on whether and when a fair exchange occurred. In litigation, the plaintiff alleges a promise and consideration—an exchange (a plausible one, and therefore fair enough at that point). Defenses to formation are a response to the allegation that a fair exchange occurred. Allegations of both promise and consideration show that the defendant assented. As between assent and exchange, exchange is the more fundamental concept, but because the law talks so often about assent, assent is covered at length afterward so that the function of the assent doctrines is apparent.Other doctrines, such as remedies (just an introduction in this first volume), waiver, seals, the Statute of Frauds, definiteness, and general public policy limitations are placed where students can best grasp their import in the context of the other doctrines.Along the way, most of the doctrines in the book are repeated in the cases, questions, or in class discussion. This repetition cements understanding, builds trust, and also allows students to see how the doctrines mesh together to regulate coherently.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-story-of-contract-law-formation\"\n}",
    "{\n    \"title\": \"Sexual Orientation and Gender Identity Employment Discrimination\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Matthew William Green\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTIwLCJwdXIiOiJibG9iX2lkIn19--7c9dee72ab7d263676c9e06f0bd53cec1722965f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000SexOriDis.png\",\n    \"description\": \"This Chapter will address the current protections that are available to lesbian, gay, bisexual and transgender (“LGBT”) individuals who allege they have been victims of employment discrimination. The Chapter's primary focus will be on federal statutory law, particularly Title VII of the Civil Rights Act of 1964. Although the focus here is on federal law, Appendix I to this Chapter lists the states that protect individuals from public and/or private discrimination under state laws.This topic is explored in four parts: (1) a brief overview of congressional efforts to enact a statute to protect individuals from employment discrimination on the basis of sexual orientation and gender identity; (2) discusses Title VII and sexual orientation; (3) discusses ways in which recent courts have handled sexual orientation discrimination under Title VII; and (4) similarly examines early judicial treatment of claims brought by individuals alleging discrimination on the basis of their gender identity and/or expression and explores how the law has developed in this area as well.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/sexual-orientation-and-gender-identity-employment-discrimination\"\n}",
    "{\n    \"title\": \"Indigenous Perspectives on Business Ethics and Business Law in British Columbia\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": \"2024\",\n    \"authors\": [\n        \"Annette Sorensen, Coast Mountain College\",\n        \"Scott van Dyk, Coast Mountain College\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyMjAsInB1ciI6ImJsb2JfaWQifX0=--82adf064eaf12227ce0a9260c7f21dfe4f4bd220/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/small_cover_textbook_380_9bd66b43a2.jpg\",\n    \"description\": \"This book explores business ethics and business law through the lens of Indigenous-settler relations in Canada (with a focus on British Columbia in particular). It aims to fill a gap in business curriculum and support instructors who want to bring Indigenous content into their classes. The book starts by exploring relevant history, focusing on treaties, legislation, and federal government policy. It then looks at business ethics and what it means for businesses to work ethically with Indigenous communities. And finally, the book discusses business law and the requirements and responsibilities for businesses doing work on Indigenous lands.\",\n    \"publisher\": \"BCcampus\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/indigenous-perspectives-on-business-ethics-and-business-law-in-british-columbia\"\n}",
    "{\n    \"title\": \"Torts: Cases and Contexts Volume 1\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Eric E. Johnson, University of North Dakota School of Law\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjcxLCJwdXIiOiJibG9iX2lkIn19--12d8c957342f1b93b62bce37997bcbb010350856/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000TorCasCon.png\",\n    \"description\": \"Plain-spoken and convivial, this casebook makes a deliberate effort to explain the law, rather than to provide a mere compilation of readings and questions. Simple concepts are presented simply. Complex concepts are broken down and accompanied by examples and problems.By being clear and straightforward, the casebook aims to quickly get students to the point where they can navigate regions of gray and build nuanced arguments. The book is written from the conviction that when students stop to puzzle over something, it should be because the law itself puzzles, not because the book obfuscates.Students describe the book as easy to read. A key aim is context, with explanations of how pieces of doctrine fit into the bigger picture. There is also a continual effort to plug doctrine into the real world of practice, getting students to think about litigation strategy and tactics.Another key feature is a high-degree of organization. Doctrine is explained upfront, independent of and before the cases. After the cases, there is no notes-and-questions mishmash. Historical notes, check-your-understanding questions, questions to ponder, and problems are all separately labeled as such.The readings are rich with variety. The classic cases are here, of course. But there are also atypical readings that allow students to see tort law from different perspectives, including an opening statement, a closing argument, administrative-enforcement letters, an excerpt from a novel, and an opinion on tribal law from a Navajo court. Many selections are also startlingly modern, with facts involving texting-and-driving, alcoholic energy drinks, Facebook libel, suddenly accelerating Toyotas, and the misery of a six-hour tarmac delay.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/torts-cases-and-contexts-volume-1\"\n}",
    "{\n    \"title\": \"Rules and Laws for Civil Actions - 2023\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Stella Burch Elias, Johnson County, Iowa\",\n        \"Derek T. Muller, Johnson County, Iowa\",\n        \"Jason Rantanen\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM4MywicHVyIjoiYmxvYl9pZCJ9fQ==--ba0af50823163f54243a0d68e7a55957fca59f17/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9984321055802771.jpeg\",\n    \"description\": \"Rules and Laws for Civil Actions is an open-access resource for law students containing the U.S. Constitution, Federal Rules of Civil Procedure, Federal Rules of Evidence, Federal Rules of Appellate Procedure, and selected federal and state statutes. The book was created by a team of faculty members at the University of Iowa College of Law to supplement the study of Civil Procedure, Evidence, Constitutional Law, and other law school courses. In addition to containing the official text, each legal source found in Rules and Laws for Civil Actions is accompanied by an introductory section written by an Iowa Law professor explaining its significance and background.\",\n    \"publisher\": \"University of Iowa\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/rules-and-laws-for-civil-actions\"\n}",
    "{\n    \"title\": \"Construction Contracting: Business and Legal Principles, Second Edition - Second Edition\",\n    \"copyright_year\": \"2002\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Stewart Bartholomew, California State University, Chico\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg2OSwicHVyIjoiYmxvYl9pZCJ9fQ==--2df7e348e56bcfc405ee4caf71a04699cf95afa2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Cover-ConstructionContracting(sm).jpg\",\n    \"description\": \"This introduction to construction contracting as it applies to typical, every-day situations explains “theoretical” ideas in terms of what really happens in practice. It emphasizes the more common case law holdings and industry customs that help avoid troublesome legal issues during the completion of a project.Instructors reviewing or adopting this book are encouraged to register athttps://bit.ly/interest_construction_contractingAny derivatives of this work must comply with the use and attribution requirements of the Creative Commons license, and include the following statement, “This material was previously published by Pearson Education, Inc.”Construction Contracting, 2nd edition is an \\\"out of print,\\\" rights-reverted book for which the author's estate has given permission for digitization and release under a CC BY NC SA 4.0 license. It was previously published in 2002 by Pearson ISBN 1-13-091055-4. The copyright page has been edited and graphics redrawn. A new cover, dedication, acknowledgements, how to adopt this book, and author biography have been added, and the table of contents has been revised. As the book has been reformatted, the original back of the book index is not included.\",\n    \"publisher\": null,\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/construction-contracting-business-and-legal-principles-second-edition\"\n}",
    "{\n    \"title\": \"Business Law, Ethics, and Sustainability\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Andrew J Hosmanek, University of Iowa\",\n        \"Brendan Smith, Birmingham, Alabama\",\n        \"Michael J Dayton, Des Moines, Iowa\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Constitutional Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDY4OCwicHVyIjoiYmxvYl9pZCJ9fQ==--04302f9e20e420fba8998b5e01f2032b1f66d870/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9984376757702771.jpeg\",\n    \"description\": \"Business Law, Ethics, and Sustainability is a textbook for undergraduate law courses. It covers business law topics such as contracts, business organizations, employment law, and torts, as well as a general survey of American law. Additional topics include Constitutional law, civil rights, environmental law, criminal law, and litigation.\",\n    \"publisher\": \"OpenHawks OER\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/business-law-ethics-and-sustainability\"\n}",
    "{\n    \"title\": \"Criminal Procedure: Undergraduate Edition Author:\",\n    \"copyright_year\": \"2022\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Christopher E. Smith, East Lansing, MI\",\n        \"Ben Trachtenberg, East Lansing, MI\",\n        \"Anne Alexander, Columbia, MO\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM2MywicHVyIjoiYmxvYl9pZCJ9fQ==--9b4f09942a7f9f5840dc125919791c9e18e9198d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGVnIiwicmVzaXplIjoiNDkweDEwMDAifSwicHVyIjoidmFyaWF0aW9uIn19--c92470909b26b190444928a1af61081ff8429c19/Criminal-Procedure_Cover-683x1024.jpeg\",\n    \"description\": \"An open textbook for undergraduate Criminal Procedure courses that are typically required of criminal justice majors.  The book uses U.S. Supreme Court opinions to illuminate the definition of rights concerning search and seizure, right to counsel, and other aspects of the criminal justice process.  This open textbook seeks to make undergraduates familiar with judicial reasoning as well as the definitions of rights relevant to individuals who are drawn into contact with criminal justice officials.  The chapters give significant attention to police procedures and individual rights under the Fourth Amendment related to searches, including those using warrants and the situations in which warrant searches are permissible.  The book also covers rights in the context of police interrogation, including Miranda warnings and exceptions to the Miranda rule.  In addition, there is coverage of the exclusionary rule, right to counsel, plea bargaining, and trial rights.  It concludes with a brief examination of rights related to sentencing.  This resource challenges undergraduates to understand the development and changes affecting rights as new decisions are issued by the U.S. Supreme Court.\",\n    \"publisher\": \"Michigan State University\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781626101203\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/criminal-procedure-undergraduate-edition-author\"\n}",
    "{\n    \"title\": \"Civil Procedure: Pleading\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Hillel Y. Levin, University of Georgia\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI1MTksInB1ciI6ImJsb2JfaWQifX0=--c6c1d53a427d2c0117f3b3c4389f69f9fc3857db/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/smallCivProPleadingCover.jpg\",\n    \"description\": \"This chapter covers the Civil Procedure topic of Pleading: The Plaintiff‘s Complaint. The chapter takes approximately four class periods to cover in detail. The student is exposed to cases, presented with questions that are designed to both guide class discussion and to help the student focus his reading of the materials, pleadings from cases, and the applicable Federal Rules of Civil Procedure.Faculty materials available:This eLangdell chapter includes a teacher's manual. Faculty and staff at CALI member schools can access these faculty-only materials by logging in to eLangdell with their normal cali.org username and password. Contact CALI if you have questions.This chapter covers the Civil Procedure topic of Pleading: The Plaintiff's Complaint. The chapter takes approximately four class periods to cover in detail.The student is exposed to cases, presented with questions that are designed to both guide class discussion and to help the student focus his reading of the materials, pleadings from cases, and the applicable Federal Rules of Civil Procedure.There are two accompanying files available only to faculty who are registered at cali.org (registration is free for faculty at CALI member schools): a Teaching Manual and a Supplemental Material document. The Supplemental Material should be distributed to students at the appropriate point in the unit. Please see the Teaching Manual for details.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/civil-procedure-pleading\"\n}",
    "{\n    \"title\": \"Federal Rules of Civil Procedure\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Legal Information Institute, Cornell Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxLCJwdXIiOiJibG9iX2lkIn19--cf842729a59d4c1c73ae404875382b4cbc6cfbe9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000Procedure.png\",\n    \"description\": \"These are the Federal Rules of Civil Procedure (FRCP) as amended to December 01, 2016. The FRCP govern civil proceedings in the United States district courts and are often the foundation for the standard 1L law school course, Civil Procedure.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/federal-rules-of-civil-procedure\"\n}",
    "{\n    \"title\": \"Marine Law and Policy for Scientists and Managers - 1st Edition\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Holly V. Campbell, Oregon State University\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE2NSwicHVyIjoiYmxvYl9pZCJ9fQ==--bf192ac8aedc2e39e9bed317eef1cdbad1977d75/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/Title-Page_Marine-Law-and-Policy-for-Scientists-and-Managers-350x453.jpg\",\n    \"description\": \"This open educational resource is designed for use by undergraduate and graduate ocean science, natural resource, fisheries and wildlife, and environmental policy students enrolled in a ten-week academic quarter. The purpose of this project is to provide students and non-law professionals with a freely accessible, clearly written guide to support engaging and effective learning. As such, the book serves as a gateway and an invitation to become a well informed, committed and involved ocean citizen as well as to explore the field beyond our course study.\",\n    \"publisher\": \"Oregon State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/marine-law-and-policy-for-scientists-and-managers-1st-edition-campbell\"\n}",
    "{\n    \"title\": \"Estructura Ecológica Principal de la Localidad de Engativá: Estudio desde una perspectiva de ordenamiento territorial y sus instrumentos jurídicos\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Alan David Vargas-Fonseca, Universidad de Ciencias Aplicadas y Ambientales UDCA\",\n        \"Odilia Margarita Borja-Cuadros, Universidad de Ciencias Aplicadas y Ambientales UDCA\",\n        \"Julián Felipe Cristiano-Mendivelso, Universidad de Ciencias Aplicadas y Ambientales UDCA\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTUzMCwicHVyIjoiYmxvYl9pZCJ9fQ==--32c4e68e5058bad97c6d8d292a52a1ada3f1e005/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/submission_38_38_coverImage_es_ES.png\",\n    \"description\": \"Engativá es una de las 21 divisiones político – administrativas del Distrito Capital de Bogotá (Colombia), y se distingue por su composición urbana, una alta densidad poblacional y sus suelos dedicados principalmente al uso residencial, comercial e industrial. No obstante, este territorio también es caracterizable por la presencia de ecosistemas ricos en biodiversidad que se encuentran amenazados por factores asociados a la urbanización y los efectos del cambio climático. En esta localidad se encuentran tres humedales urbanos de categoría RAMSAR: Juan Amarillo, Jaboque y Santa María del Lago, además, en materia de ordenamiento hídrico, por la jurisdicción administrativa de Engativá se encuentra una porción de terreno de las cuencas del río Bogotá y del río salitre. Por otra parte, entre las áreas verdes constitutivas del tejido urbano como los parques de carácter vecinal, sobresalen las áreas complementarias para la conservación como el jardín botánico y el Parque regional La Florida. En relación con estos ecosistemas urbanos, que hacen parte de la Estructura Ecológica Principal del Distrito Capital y su región ambiental, el presente libro contiene un análisis de cada uno de estos componentes, resaltando elementos de su trayectoria histórica, las regulaciones jurídicas especializadas y una descripción de los desafíos específicos. Uno de los propósitos de la sistematización de información aquí recogida es hacer evidentes los matices del ordenamiento urbano ambiental gestionado en la jurisdicción administrativa de Engativá: un lugar donde convergen la vitalidad urbana y la naturaleza en un equilibrio frágil, marcado por una trayectoria compleja de degradación ambiental y adoptación de los habitantes al territorio.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942714671\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/estructura-ecologica-principal-de-la-localidad-de-engativa-estudio-desde-una-perspectiva-de-ordenamiento-territorial-y-sus-instrumentos-juridicos\"\n}",
    "{\n    \"title\": \"The Legal and Ethical Environment of Business\",\n    \"copyright_year\": \"2011\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Terence Lau, University of Dayton\",\n        \"Lisa Johnson, University of Puget Sound\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDEsInB1ciI6ImJsb2JfaWQifX0=--55bdd011c174045f2f481f3e96c7a11be6524cd9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/9781936126583.png\",\n    \"description\": \"Terence Lau & Lisa Johnson'sThe Legal and Ethical Environment of Businessis a book for today's student, who expects learning to be comprised not only of substance, but also of interactive exercises and multimedia. This book streamlines the presentation of material to ensure that every page is relevant, engaging, and interesting to undergraduate business students, without losing the depth of coverage that they need to be successful in their academic journeys and in their professional careers. This is not Legal Environment of Business (LEB) ”light.“ Rather, this is LEB without risk of students' eyes glazing over in boredom or from lack of comprehension. This is LEB presented in an exciting way, where every page is interesting to students and relevant to real life.The authors recognize that the sheer volume of information to be covered in a LEB course makes it one of the more challenging courses for the business undergraduate. Not only do typical LEB texts read like the first year curriculum at law school, but also the LEB course is grounded in the humanities, which can make the subject even more demanding for students who are also taking statistics, economics, finance, and accounting.Each chapter contains not only substantive law, but also illustrative videos, interactive exercises for hands-on learning, and discussion questions for critical thought. Additionally, each chapter presents ”A Question of Ethics“ section, which contains real world ethical dilemmas relevant to the topic under study. These videos, exercises, discussion questions, and ethics sections all provide opportunities for students to apply concepts that they are learning in the context of relevant LEB topics that shape or restrain actual decision-makers' actions. It's real world practice in the safety of the classroom environment.Lau & Johnson's The Legal and Ethical Environment of Businessis a textbook that students will enjoy reading. This will encourage them to come to class prepared, and free you to teach the kind of course you want to teach. Request a desk copy and see for yourself.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781936126583\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-legal-and-ethical-environment-of-business\"\n}",
    "{\n    \"title\": \"Entorno Empresarial desde la Gestión del Derecho Laboral: Breves Apuntes desde una Perspectiva Académica\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"César Andrés uerrero-Velástegui, Universidad Técnica de Ambato\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAxMjgsInB1ciI6ImJsb2JfaWQifX0=--e90357e3cad970ee2e9e2ac188854644131e1c50/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_42_42_coverImage_es_ES.jpg\",\n    \"description\": \"El entorno empresarial permite analizar los factores exógenos y endógenos que influyen en la empresa y la actividad en la que se desenvuelve en el sector industrial, razón por la cual es necesario identificar los elementos del macro y micro entorno que inciden de forma positiva o negativa en la gestión empresarial. En ese sentido el ámbito legal es uno de los factores elementales que el Empresario debe considerar. El entorno empresarial y el derecho laboral son dos aspectos esenciales de la economía moderna que están estrechamente interconectados. El entorno empresarial se refiere a los factores externos que influyen en las operaciones de una organización, mientras que la legislación laboral regula la relación entre empleadores y empleados. Esta obra proporcionará una visión general del entorno empresarial y el derecho laboral, así como analizará los elementos necesarios para actuar de forma ética y legal en la gestión empresarial. El entorno empresarial está determinado por varios factores políticos, económicos, sociales, tecnológicos, ecológicos y legales que marcan el campo de acción de la gestión empresarial. Más aún en ámbitos de derecho laboral, los aspectos legales que intervienen en la relación entre el empleador y el empleado deben gestionarse conforme lo dictamina la normativa vigente, salvaguardando derechos y verificando el cumplimiento de obligaciones, pues el impacto del entorno empresarial en las organizaciones y sus operaciones puede ser significativo.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942651020\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/entorno-empresarial-desde-la-gestion-del-derecho-laboral-breves-apuntes-desde-una-perspectiva-academica\"\n}",
    "{\n    \"title\": \"Law 101: Fundamentals of the Law\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Michael H. Martella\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjEzLCJwdXIiOiJibG9iX2lkIn19--55722156af7a06ab570418be2a0f706f1a8b2718/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000LawFunLaw.png\",\n    \"description\": \"Law 101: Fundamentals of Law, New York and Federal Law is an attempt to provide basic legal concepts of the law to undergraduates in easily understood plain English. Each chapter covers a different area of the law. Areas of law were selected based on what legal matters undergraduates may typically encounter in their daily lives. The textbook is introductory by nature and not meant as a legal treatise.Facebook\",\n    \"publisher\": \"Open SUNY\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/law-101-fundamentals-of-the-law\"\n}",
    "{\n    \"title\": \"United States Patent Law\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"eLangdell Press Editorial Staff\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODcsInB1ciI6ImJsb2JfaWQifX0=--dbc24b8c8083fcee0eb0152c1b01a597e8a4454d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Copyrigh2.png\",\n    \"description\": \"This Intellectual Property Supplement from eLangdell Press contains the text of federal laws and regulations in the area of copyright, trademarks and patents. The editors have endeavored to gather all relevant laws, rules and regulations. This collection is intended to be used primarily as a statutory supplement for law students and legal scholars in academic settings, although practitioners in this area of law will also find it useful.This volume, Volume 2: Patent Statutory Law contains the text of Title 35 of the United States Code as it appears on the most current edition available on the U.S. Government website FDSYS. Updates to the U.S. Code not yet found in the FDSYS published editions can be found in the United States House of Representatives Office of Law Revision Counsel's Classification Tables. Some formatting modification has been performed to better accommodate electronic readers.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/united-states-patent-law\"\n}",
    "{\n    \"title\": \"Introduction to the American Criminal Justice System\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Alison S. Burke, Southern Oregon University\",\n        \"David E. Carter, Southern Oregon University\",\n        \"Brian Fedorek, Southern Oregon University\",\n        \"Tiffany L. Morey, Southern Oregon University\",\n        \"Lore Rutz-Burri, Southern Oregon University\",\n        \"Shanell Sanchez, Southern Oregon University\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NjM0LCJwdXIiOiJibG9iX2lkIn19--088616df468de097d555ab436d0aa22d48b78d75/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000AmeCriJus.jpg\",\n    \"description\": \"There is a dearth of OER textbooks in Criminology and Criminal Justice, which made creating this textbook all the more exciting. At times we faced challenges about what or how much to cover, but our primary goal was to make sure this book was as in-depth as the two textbooks we were currently using for our CCJ 230 introduction course. The only way we were willing to undertake this project as if it was as good, or better than the current books students read. We have had very positive feedback about the required textbooks in the course but consistently heard how expensive the books were to buy. We also needed to ensure we met the learning outcomes outlined by SOU for a general education course, as well as the state of Oregon, to make sure this textbook helps students meet those outcomes.\",\n    \"publisher\": \"Open Oregon Educational Resources\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-the-american-criminal-justice-system\"\n}",
    "{\n    \"title\": \"Business Law I Essentials\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Mirande Valbrune\",\n        \"Renee De Assis, Texas Woman's University\",\n        \"Suzanne Cardell, University of Massachusetts Dartmouth\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzQ2LCJwdXIiOiJibG9iX2lkIn19--24147339ab2df9981a16a66d2d21fb1c04601f51/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/978-1-947172-78-4.jpg\",\n    \"description\": \"Business Law I Essentials is a brief introductory textbook designed to meet the scope and sequence requirements of courses on Business Law or the Legal Environment of Business. The concepts are presented in a streamlined manner, and cover the key concepts necessary to establish a strong foundation in the subject. The textbook follows a traditional approach to the study of business law. Each chapter contains learning objectives, explanatory narrative and concepts, references for further reading, and end-of-chapter questions.Business Law I Essentials may need to be supplemented with additional content, cases, or related materials, and is offered as a foundational resource that focuses on the baseline concepts, issues, and approaches.\",\n    \"publisher\": \"OpenStax\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/business-law-i-essentials\"\n}",
    "{\n    \"title\": \"Sales and Leases: A Problem-based Approach\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Scott J. Burnham, Gonzaga University School of Law\",\n        \"Kristen Juras, The University of Montana School of Law\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjY3LCJwdXIiOiJibG9iX2lkIn19--5a066efb9e4b31319c9c9df95b365fbdb2d6b979/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000SaleLease.png\",\n    \"description\": \"Sales and Leasesis a coursebook for a 3-credit course in personal property sales and leases – the subject matter of UCC Articles 2 and 2A. Adjustments could be made for other credit allocations and chapters can be used on a stand-alone basis. The course is designed so that students both review the rules and principles they studied in their first-year course in Contracts and learn the rules that apply to the subset of contracts for the sale and lease of goods. Students taking this course should be well-prepared to solve legal problems in contracts and sales, and should be well-prepared for those parts of the bar exam as well.While the course in Contracts focuses on the rules of common-law contracts, the focus of this course is the rules found in legislation. Therefore, instead of emphasizing case analysis, the book contains a good deal of narrative that assists students in working through the complexity of the statutes. Students will need to supplement the book with a complete copy of the UCC that includes the Official Comments. Discussion of other statutes, such as UETA and Magnuson-Moss, is incorporated where appropriate.The approach is problem-based, which we believe is more appropriate for an upper-division course based primarily on statutes. The narrative is interspersed with problems for class discussion that require students to apply the principles and rules to particular fact situations. Many times there is an issue of interpretation or policy in the Code, however, and therefore each chapter also contains at least one case that explores an issue arising under the statute.Please note that the publisher requires you to login to access and download the textbooks.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/sales-and-leases-a-problem-based-approach\"\n}",
    "{\n    \"title\": \"Liberty, Equality and Due Process: Cases, Controversies, and Contexts in Constitutional Law\",\n    \"copyright_year\": \"2018\",\n    \"last_update\": \"2019\",\n    \"authors\": [\n        \"Ruthann Robson\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Constitutional Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTE3LCJwdXIiOiJibG9iX2lkIn19--9db52b8345d78a2c9778c34a8932e57f406111b7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000LibEquDue.png\",\n    \"description\": \"This Casebook is intended to be used in a course which concentrates on Constitutional Rights and centers the Fourteenth Amendment. It can be used in a first year Law School course with a title such as “Liberty, Equality, and Due Process,” as it is at CUNY School of Law, an upper division Constitutional Rights course, or an advanced undergraduate course focusing on constitutional rights, especially equality and due process.The Casebook begins with the threshold issue of “state action” which orients students to a basic but often under-taught principle of constitutional law. The Casebook then considers judicial review and constitutional interpretation. Chapters 3-6 center on equality, including slavery before the Reconstruction Amendments, equal protection for racial, gender, and other classifications, affirmative action, and fundamental rights in equal protection doctrine. Chapters 7-9 are shorter chapters that consider the Privileges or Immunities Clause, Incorporation of Bill of Rights provisions to the states, and the Second Amendment. Chapter 10 focuses on substantive due process, with Chapter 11 treating the “synergy” between due process and equal protection regarding fundamental rights. The brief last Chapter, Chapter 12, includes materials on state constitutional rights, which can be omitted or integrated into previous subjects.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/liberty-equality-and-due-process-cases-controversies-and-contexts-in-constitutional-law\"\n}",
    "{\n    \"title\": \"Torts: Cases, Principles, and Institutions\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"John Fabian Witt, Yale Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjY1LCJwdXIiOiJibG9iX2lkIn19--2269d3165fc1c0a20032f5d9efbe90af3e0a68e6/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000TorCasPri.png\",\n    \"description\": \"This is the Fifth Edition of Torts: Cases, Principles, and Institutions, a casebook for a one-semester torts course that carves out a distinctive niche in the field by focusing on the institutions and sociology of American tort law. The book retains many of the familiar features of the traditional casebook, including many of the classic cases. Like the best casebooks, it seeks to survey the theoretical principles underlying those cases. But it aims to supplement the cases and principles with editorial notes that focus students’ attention on the institutional features of our tort system, including features such as the pervasiveness of settlements, the significance of the market, the role of the plaintiff's bar, the importance of private insurance, the contingency fee, and the jury. These institutional arrangements are what make American tort law distinctive. They are how the substantive doctrines of tort law are translated into the practice of torts lawyers. And they are sociologically fascinating in their own right.TCPI integrates the institutional materials into the cases and notes rather than segregate them into separate sections of their own. It does so because its aim is not to teach the details of any one institution, such as the mechanics of the law of subrogation or workers’ compensation. Few one-semester torts classes can take up so much material. Instead, the book integrates the institutional material into the main text to draw general lessons about the massive, sprawling systems of private administration that American law has created under the umbrella of our torts system.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/torts-cases-principles-and-institutions\"\n}",
    "{\n    \"title\": \"Introduction to Intellectual Property\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"David Kline\",\n        \"David Kappos\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDUzNywicHVyIjoiYmxvYl9pZCJ9fQ==--517484b6e9b901a7b77fbcc4cc6f7e983f2fbcc5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202023-02-13%20at%2012.08.50%20PM.png\",\n    \"description\": \"Introduction to Intellectual Propertyprovides a clear, effective introduction to patents, copyright, trademarks, and trade secrets. The text may be used by students and instructors in formal courses, as well as those applying intellectual property considerations to entrepreneurship, marketing, law, computer science, engineering, design, or other fields. The luminaries involved with this project represent the forefront of knowledge and experience, and the material offers considerable examples and scenarios, as well as exercises and references.Introduction to Intellectual Propertywas originally developed by the Michelson 20MM Foundation, released under the titleThe Intangible Advantage.\",\n    \"publisher\": \"OpenStax\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781951693350\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-intellectual-property\"\n}",
    "{\n    \"title\": \"Transactional Drafting: Introduction to Contract Drafting and Transactional Practice\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Ben L. Fernandez, Gainesville, Florida\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"Transactional Drafting: Introduction to Contract Drafting and Transactional Practice contains a condensed presentation of all of the topics typically covered in an upper-level law school class on contract drafting. The book covers drafting from scratch including writing in plain English (not using legalese), avoiding ambiguity, and drafting covenants, rights and prohibitions consistently (using \\\"will\\\" or \\\"shall\\\" for covenants, \\\"may\\\" for rights, and \\\"will not\\\" or \\\"shall not\\\" for prohibitions). And it covers contract organization, from the title and the exordium to the core covenant, deal provisions and \\\"boilerplate,\\\" to the testimonium and the signature blocks. The book also includes material on getting up to speed before you start drafting and brainstorming for contingencies after you have finished. In addition to drafting from scratch the book introduces students to the wide range of skills involved in transactional practice. There are chapters on revising form documents, both when you are the original drafter and when you represent the other side. Also, the book includes chapters on negotiating contract language, handling a closing (i.e., verifying authority and getting the documents signed), dealing with ethical issues that arise in contract drafting and execution, drafting a contract amendment, and using computers to draft contracts. Transactional Drafting includes everything students need to know to “hit the ground running” as a transactional attorney.\",\n    \"publisher\": \"Ben Fernandez\",\n    \"language\": \"English\",\n    \"isbn13\": \"9798453368501\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/transactional-drafting-introduction-to-contract-drafting-and-transactional-practice\"\n}",
    "{\n    \"title\": \"Federal Rules of Criminal Procedure\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Legal Information Institute, Cornell Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Criminal Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTAwLCJwdXIiOiJibG9iX2lkIn19--2e576315ea6af673ed84ea4395121b8d4da96d02/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000CriminalP.png\",\n    \"description\": \"This series of Federal Rules books, consisting of the Federal Rules of Evidence, Criminal Procedure and Civil Procedure,  are powered by the Legal Information Institute at Cornell Law School, and created in partnership with The Center for Computer-Assisted Legal Instruction (CALI).These rules govern the conduct of all criminal proceedings brought in Federal courts.Our Federal Rules ebooks include:The complete rules as of December 1, 2012 (for the 2013 edition).All notes of the Advisory Committee following each rule.Internal links to rules referenced within the rules.External links to the LII website's version of the US Code.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/federal-rules-of-criminal-procedure\"\n}",
    "{\n    \"title\": \"Trademark Law: An Open-Source Casebook - 7.0\",\n    \"copyright_year\": \"2019\",\n    \"last_update\": \"2020\",\n    \"authors\": [\n        \"Barton Beebe, New York University\",\n        \"John M. Desmarais, New York University\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkyOSwicHVyIjoiYmxvYl9pZCJ9fQ==--a9ca617e1e5bc105520be53f7d8fc91016d67961/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/book_cover_thumbnail-624x807.jpg\",\n    \"description\": \"Trademark Law: An Open-Source Casebookis a free, “open” textbook designed for a four-credit trademark course, which is what I teach at NYU School of Law.  Model syllabi for four-credit and three-credit courses are available in the Faculty Resources section of this website.\",\n    \"publisher\": \"New York University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/trademark-law-an-open-source-casebook-version-6-0\"\n}",
    "{\n    \"title\": \"Intellectual Property: Law & the Information Society—Cases and Materials\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": \"2018\",\n    \"authors\": [\n        \"James Boyle, Duke Law School\",\n        \"Jennifer Jenkins, Duke Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTkwNCwicHVyIjoiYmxvYl9pZCJ9fQ==--56e2e8c8ef262f6019418a3922d76ea3d4ab0d46/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/ipcasebook2018_front-cover.jpg\",\n    \"description\": \"This book is an introduction to intellectual property law, the set of private legal rights that allows individuals and corporations to control intangible creations and marks—from logos to novels to drug formulae—and the exceptions and limitations that define those rights. It focuses on the three graphmain forms of US federal intellectual property—trademark, copyright and patent—but many of the ideas discussed here apply far beyond those legal areas and far beyond the law of the United States.The book is intended to be a textbook for the basic Intellectual Property class, but because it is an open coursebook, which can be freely edited and customized, it is also suitable for an undergraduate class, or for a business, library studies, communications or other graduate school class. Each chapter contains cases and secondary readings and a set of problems or role-playing exercises involving the material. The problems range from a video of the Napster oral argument to counseling clients about search engines and trademarks, applying the First Amendment to digital rights management and copyright or commenting on the Supreme Court's rulings on gene patents.\",\n    \"publisher\": \"James Boyle, Jennifer Jenkins\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/intellectual-property-law-the-information-society-cases-and-materials\"\n}",
    "{\n    \"title\": \"Introduction to Basic Legal Citation\",\n    \"copyright_year\": \"2013\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Peter W. Martin, Cornell Law School\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODIsInB1ciI6ImJsb2JfaWQifX0=--43dc105fd8eac304344f0d306100a96b05ae0591/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000BasicLega.png\",\n    \"description\": \"This is not a comprehensive citation reference work. Its limited aim is to serve as a tutorial onhow to cite the most widely referenced types of U.S. legal material, taking account of localnorms and the changes in citation practice forced by the shift from print to electronic sources.It begins with an introductory unit. That is followed immediately by one on \\\"how to cite\\\" thecategories of authority that comprise a majority of the citations in briefs and legalmemoranda. Using the full table of contents one can proceed through this material insequence. The third unit, organized around illustrative examples, is intended to be used eitherfor review and reinforcement of the prior \\\"how to\\\" sections or as an alternative approach tothem. One can start with it since the illustrative examples for each document type are linkedback to the relevant \\\"how to\\\" principles.The sections on abbreviations and omissions, on typeface (italics and underlining), and onhow citations fit into the larger project of legal writing that follow all support the precedingunits. They are accessible independently and also, where appriopriate, via links from theearlier sections. Finally, there are a series of cross reference tables tying this introduction tothe two major legal citation reference works and to state-specific citation rules and practices.The work is also designed to be used by those confronting a specific citation issue. For suchpurposes the table of contents provides one path to the relevant material. Another, to whichthe bar at the top of each major section provides ready access, is a topical index. This index isalphabetically arrayed and more detailed than the table of contents. Finally, the searchfunction in your e-book reader software should allow an even narrower inquiry, such as oneseeking the abbreviation for a specific word (e.g.,institute) or illustrative citations for aparticular state, Ohio, say.If the device on which you are reading this e-book allows it, the pdf format will enable you toprint or to copy and paste portions, large or small, into other documents. However, since thev work is filled with linked cross references and both the table of contents and index rely onthem, most will find a print copy far less useful than the electronic original.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-basic-legal-citation\"\n}",
    "{\n    \"title\": \"Law for Entrepreneurs\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"Law for Entrepreneursis an up-to-date textbook that covers the broad spectrum of legal issues that entrepreneurs must understand when starting and running a business. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Law for Entrepreneursprovides students with context and essential legal concepts relating to contracts, product liability, intellectual property, insurance, agency law, partnerships, corporations, and employment law. The text provides the vocabulary and legal savvy that entrepreneurs need to talk in an educated way to customers, suppliers, employees, creditors, shareholders, government regulators and other stakeholders — and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453344170\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/law-for-entrepreneurs\"\n}",
    "{\n    \"title\": \"Contract Doctrine, Theory & Practice Volume 1\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"J.H. Verkerke, University of Virginia\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODQsInB1ciI6ImJsb2JfaWQifX0=--a2aa4e392cd92c11b6c9aed920873b4874b389b2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ConDocVo3.png\",\n    \"description\": \"This is the first in a series of Contracts casebooks. It was originally titled \\\"Collaborative Teaching Materials for Contracts.\\\"The first semester of law school is mostly about learning to speak a new legal language (but emphatically not “legalese”), to formulate and evaluate legal arguments, to become comfortable with the distinctive style of legal analysis. We could teach these skills using almost any legal topic. But we begin the first-year curriculum with subjects that pervade the entire field of law. Contract principles have a long history and they form a significant part of the way that lawyers think about many legal problems. As you will discover when you study insurance law, employment law, family law, and dozens of other practice areas, your knowledge of contract doctrine and theory will be invaluable.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/contract-doctrine-theory-practice-volume-1\"\n}",
    "{\n    \"title\": \"Land Use\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Christian Turner, University of Georgia\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODksInB1ciI6ImJsb2JfaWQifX0=--2f2d2f6a0f30278c05704897d9af949dc5011e1c/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000LanUseChr.png\",\n    \"description\": \"This text explores the laws governing the use of land. Sometimes narrowly focused, often intensely local, land use regulation may give the impression of a highly specialized field with small stakes.The text is divided into three parts:First, we will survey the ordinary, local administrative scheme of land use regulation. The cases in this section are intended to establish what that system is and what it's standards are.In the second part of the course, we will turn our attention to cases illustrating litigation attacks on the ordinary administrative scheme. The purpose here is not, as it was in the first part, to understand better the standards the administrators should apply, but to understand the constraints imposed on the contents of local laws, the procedures of enactment and permitting, and the composition of local lawmaking bodies.In the third part, we focus on the distributive concerns raised by land use regulation. The regulatory takings doctrine has gone from, literally, nothing, to wrestling to disentangle distributive concerns from substantive ones, to trying to craft either rules or standards to identify regulations that go “too far” and should be considered “takings” within the meaning of the Fifth Amendment. We will consider what the doctrine's purposes are, how it should be governed, and how it should be invoked as a procedural matter.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/land-use\"\n}",
    "{\n    \"title\": \"Property Volume 2\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Christian Turner, University of Georgia Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjgxLCJwdXIiOiJibG9iX2lkIn19--707a15d259bb1fcf2e6e12ccfbfa08f48a9ee724/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Property2.png\",\n    \"description\": \"This is Volume 2 of a two volume set written for Property Law. From the Preface to Volume 1: Property, as a vaguely defined collection of contract, tort, and criminal cases, does not take on the natural structure of a substantive area of the law through the systematic study of duty, breach, causation, defenses, and damages. Instead this textbook and most Property courses survey various topics in law with two goals in mind. First, we will study a number of traditional property topics, those where the issue of \\\"ownership\\\" and what that entails have long been thought to be a central issue. Second, but most importantly, our interdisciplinary study will introduce some of the major analytical techniques in law, from reasoning using precedent to law and economics to distributive justice. As we roam among topics, our goal is always, relentlessly to ask, \\\"Why?\\\" \\\"Why should the law protect this party's interest?\\\" These major techniques that we will pick up along the way will help us provide better and better answers to this question.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/property-volume-2\"\n}",
    "{\n    \"title\": \"Introduction to business law in Papua New Guinea\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Andrew Gibson, Southern Cross University\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIwNzQsInB1ciI6ImJsb2JfaWQifX0=--b05f4bc188bc239f6b249b57ff89cbcca7823f3f/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Cover_image-350x497.png\",\n    \"description\": \"“Introduction to Business Law in Papua New Guinea” is an introductory text designed to support students enrolled in LEGL1007 Introduction to the Business Law of Papua New Guinea at Southern Cross University. The book is structured into five parts: Part 1 provides an introduction to studying business law, including writing legal essays and problem questions; Part 2 covers negligence; Part 3 discusses contract law; Part 4 addresses consumer law; and Part 5 focuses on agency within the Papua New Guinea legal system.\",\n    \"publisher\": \"Southern Cross University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-business-law-in-papua-new-guinea\"\n}",
    "{\n    \"title\": \"Civil Rights and Liberties\",\n    \"copyright_year\": \"2023\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Rorie Spill Solberg, Corvallis, Oregon\",\n        \"Kimberly Clairmont, Corvallis, Oregon\",\n        \"Petar Jeknic, Corvallis, Oregon\",\n        \"Sarah R. Mason, Corvallis, Oregon\",\n        \"Alexandria Metzdorf, Corvallis, Oregon\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDM1NSwicHVyIjoiYmxvYl9pZCJ9fQ==--845ccaf27624a5de7487d0f76b4092fb99469ef2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Title-Page-Civil-Rights-and-Liberties-1-768x994.png\",\n    \"description\": \"This volume focuses on the constitutional doctrine and law in the areas of civil rights and liberties. It contains excerpts of landmark cases covering the first amendment, second amendment, fourteenth amendment and the right to privacy. The excerpts include the constitutional issues in these cases that are related to civil rights and liberties with other questions of law and dicta omitted.\",\n    \"publisher\": \"Open Oregon Educational Resources\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781955101356\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/civil-rights-and-liberties\"\n}",
    "{\n    \"title\": \"Federal Rules of Evidence\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Legal Information Institute, Cornell Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTksInB1ciI6ImJsb2JfaWQifX0=--6733c6e32557c8d5e322061966fb17da94cf00c7/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000REvidence.png\",\n    \"description\": \"These are the Federal Rules of Evidence (FRE) as effective December 01, 2016. The FRE govern the introduction of evidence in civil and criminal trials in United States federal courts. These Rules are often the foundation for the standard upper level law school course in Evidence.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/federal-rules-of-evidence\"\n}",
    "{\n    \"title\": \"Evidence: Rape Shield Rule\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Colin Miller, John Marshall Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTIsInB1ciI6ImJsb2JfaWQifX0=--d5b6590e31144ed6e56329dd6980e64147039a74/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000EviRapShi.png\",\n    \"description\": \"The Rape Shield Rule, contained in Federal Rule of Evidence 412 and state counterparts is a Rule preventing the admission of evidence concerning the sexual predisposition and behavior of an alleged victim of sexual misconduct, subject to certain exceptions. Through a series of cases and hypotheticals drawn from actual cases, this chapter gives readers a roadmap for how to address any Rape Shield Rule issue in practice.Faculty materials also available:In addition to the free, open learning materials for students listed above, this eLangdell chapter includes a teacher's manual. Faculty and staff at CALI member schools can access these materials by logging in to eLangdell with a cali.org username and password. Contact CALI if you have questions.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/evidence-rape-shield-rule\"\n}",
    "{\n    \"title\": \"The Story of Contract Law: Implementing the Bargain\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Val Ricks\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTc2LCJwdXIiOiJibG9iX2lkIn19--ce639f98d325fa4938f3deeac920fa09c23de230/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000StrConBar.jpg\",\n    \"description\": \"This book is a companion volume to Volume I, \\\"The Story of Contract Law: Formation.\\\" Volume I introduces students to law study and teaches basic doctrines of contract formation along with formation defenses. This book, Volume II, The Story of Contract Law: Implementing the Bargain, covers the rest of basic contract doctrine, namely, laws that1) determine the content of the bargain (plain meaning, usage and custom, good faith, mistake in transmission, parol evidence, and express and constructive conditions);2) govern the effect of events that occur after formation (impracticability, frustration, failure of consideration, and risk of loss);3) set remedies—rescission, damages, specific performance—available to courts when liability exists; and4) establish the rights of third parties in contracts by assignment or delegation or as third-party beneficiaries.This book includes many classic teaching cases and introduces new ones. The book also includes many problems, most based on actual cases. The book takes especial care with the doctrine of concurrent conditions, a common-law rule adopted in the late 1700s that required doctrinal readjustment across all the law governing contract performance and remedies.This volume also continues several themes from Volume I. Volume II continues to tie rules to contract law’s central structural idea, that of fair exchange. Also, to the extent helpful to student understanding, Volume II explains doctrines in part through their chronological development. The book introduces the doctrines in the order best conducive to students’ understanding contract law as a regulatory whole; for this volume, it is the order in which the doctrines arise in litigation. Finally, where possible, this volume repeats ideas at helpful points and suggests ties between doctrines so that the structural coherence of contract doctrine becomes easier to understand.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-story-of-contract-law-implementing-the-bargain\"\n}",
    "{\n    \"title\": \"Torts: Cases and Contexts Volume 2\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Eric E. Johnson, University of North Dakota\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzUzLCJwdXIiOiJibG9iX2lkIn19--f3b19e6de0efc2c48d099e3ada0fb780e51cf15d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000TorCasCo2.png\",\n    \"description\": \"Plain-spoken and convivial, this casebook makes a deliberate effort to explain the law, rather than to provide a mere compilation of readings and questions. Simple concepts are presented simply. Complex concepts are broken down and accompanied by examples and problems.By being clear and straightforward, the casebook aims to quickly get students to the point where they can navigate regions of gray and build nuanced arguments. The book is written from the conviction that when students stop to puzzle over something, it should be because the law itself puzzles, not because the book obfuscates.Students describe the book as easy to read. A key aim is context, with explanations of how pieces of doctrine fit into the bigger picture. There is also a continual effort to plug doctrine into the real world of practice, getting students to think about litigation strategy and tactics.Another key feature is a high-degree of organization. Doctrine is explained upfront, independent of and before the cases. After the cases, there is no notes-and-questions mishmash. Historical notes, check-your-understanding questions, questions to ponder, and problems are all separately labeled as such.The readings are rich with variety. The classic cases are here, of course. But there are also atypical readings that allow students to see tort law from different perspectives, including an opening statement, a closing argument, administrative-enforcement letters, an excerpt from a novel, and an opinion on tribal law from a Navajo court. Many selections are also startlingly modern, with facts involving texting-and-driving, alcoholic energy drinks, Facebook libel, suddenly accelerating Toyotas, and the misery of a six-hour tarmac delay.Please note that the publisher requires you to login to access and download the textbooks.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/torts-cases-and-contexts-volume-2\"\n}",
    "{\n    \"title\": \"Ethics in Law Enforcement\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Steve McCartney\",\n        \"Rick Parent, Simon Fraser University\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MzYyLCJwdXIiOiJibG9iX2lkIn19--5330131603fc91157a733e7c08f925848a03f6ac/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000EthLawEnf.png\",\n    \"description\": \"In this book, you will examine the moral and ethical issues that exist within law enforcement. This book will also familiarize you with the basic history, principles, and theories of ethics. These concepts will then be applied to the major components of the criminal justice system: policing, the courts, and corrections. Discussion will focus on personal values, individual responsibility, decision making, discretion, and the structure of accountability. Specific topics covered will include core values, codes of conduct, ethical dilemmas, organizational consequences, liability, and the importance of critical thinking. By the end of this book, you will be able to distinguish and critically debate contemporary ethical issues in law enforcement.\",\n    \"publisher\": \"BCcampus\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/ethics-in-law-enforcement\"\n}",
    "{\n    \"title\": \"Introduction to Criminal Investigation: Processes, Practices and Thinking\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Rod Gehl, Justice Institute of British Columbia\",\n        \"Darryl Plecas, University of the Fraser Valley\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Criminal Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NDI2LCJwdXIiOiJibG9iX2lkIn19--646408e3b783f4e26a1c0511f804b16de95726b5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000IntroCrim.png\",\n    \"description\": \"Introduction to Criminal Investigation, Processes, Practices, and Thinkingis a teaching text designed to assist the student in developing their own structured mental map of processes, practices, and thinking to conduct criminal investigations.Delineating criminal investigation into operational descriptors of tactical-response and strategic response while using illustrations of task-skills and thinking-skills, the reader is guided into structured thinking practices. Using the graphic tools of a “Response Transition Matrix”, an “Investigative Funnel”, and the “STAIR Tool”, the reader is shown how to form their own mental map of investigative thinking that can later be articulated in support of forming their reasonable grounds to believe.Chapter 1 introduces criminal investigation as both a task process and a thinking process. This chapter outlines these concepts, rules, and processes with the goal of providing practical tools to ensure successful investigative processes and practices. Most importantly, this book informs the reader how to approach the investigative process using “investigative thinking.”Chapter 2 illustrates investigation by establishing an understanding of the operational forum in which it occurs. That forum is the criminal justice system and in particular, the court system. The investigative process exists within the statutory rules of law, including the Canadian Charter of Rights and Freedoms, and case law rulings adjudicated by the courts. Considering the existence of these conditions, obligations, and case law rules, there are many terms and concepts that an investigator needs to understand to function appropriately and effectively within the criminal justice system. The purpose of this chapter is to introduce some of the basic legal parameters and concepts of criminal justice within which the criminal investigation process takes place.Chapter 3 describes the functions and terms of “evidence”, as they relate to investigation. This speaks to a wide range of information sources that might eventually inform the court to prove or disprove points at issue before the trier of fact. Sources of evidence can include anything from the observations of witnesses to the examination and analysis of physical objects. It can even include the spatial relationships between people, places, and objects within the timeline of events. From the various forms of evidence, the court can draw inferences and reach conclusions to determine if a charge has been proven beyond a reasonable doubt.Considering the critical nature of evidence within the court system, there are a wide variety of definitions and protocols that have evolved to direct the way evidence is defined for consideration by the court. In this chapter, we look at some of the key definitions and protocols that an investigator should understand to carry out the investigative process.Chapter 4 breaks investigation down into logical steps, establishing a progression that can be followed and repeated to reach the desired results. The process of investigation can be effectively explained and learned in this manner. In this chapter the reader is introduced to various issues in the progression that relate to the process of investigation.Chapter 5 examines the operational processes of investigation. In this chapter we introduce the three big investigative errors along with graphic illustrations of “The Investigative Funnel” and the “S T A I R Tool” to illustrate how each of these concepts in the investigative progression.Chapter 6 provides the reader the opportunity to work through some investigative scenarios using the S T A I R Tool. These scenarios demonstrate the investigative awareness required to transition from the tactical investigative response to the strategic investigative response. Once in the strategic response mode the reader is challenged to practice applying theory development to conduct analysis of the evidence and information to create an investigative plan.This chapter presents two investigative scenarios each designed to illustrate different steps of the S T A I R tool allowing the student to recognize both the tactical and the strategic investigative responses and the implications of transitioning from the tactical to the strategic response.Chapter 7 illustrates the investigative practices of witness management. Witness statements will assist the investigator in forming reasonable grounds to lay a charge, and will assist the court in reaching a decision that the charge against an accused person has been proved beyond a reasonable doubt.It is important for an investigator to understand these practices as they allow an investigator to evaluate witnesses and collect witness evidence that will be acceptable to the courts.Chapter 8 describes crime scene management skills. These skills are an extremely significant task component of investigation because evidence that originates at the crime scene will provide a picture of events for the court to consider in its deliberations. That picture will be composed of witness testimony, crime scene photographs, physical exhibits, and the analysis of those exhibits, along with the analysis of the crime scene itself. From this chapter, the reader will learn the task processes and protocols for several important issues in crime scene management.Chapter 9 examines the interviewing, questioning, and interrogation techniques police use to aid them in investigations. The courts expect police to exercise high standards using practices that focus on the rights of the accused person, and minimize any physical or mental anguish that might cause a false confession. In meeting these expectations, the challenges of suspect questioning and interrogation can be complex, and many police agencies have trained interrogators and polygraph operators who undertake the interrogation of suspects for major criminal cases. But not every investigation qualifies as a major case, and frontline police investigators are challenged to undertake the tasks of interviewing, questioning, and interrogating possible suspects daily. The challenge for police is that the questioning of a suspect and the subsequent confession can be compromised by flawed interviewing, questioning, or interrogation practices. Understanding the correct processes and the legal parameters can make the difference between having a suspect's confession accepted as evidence by the court or not.Chapter 10 examines various forensic sciences and the application of forensic sciences as practical tools to assist police in conducting investigations. As we noted in Chapter 1, it is not necessary for an investigator to be an expert in any of the forensic sciences; however, it is important to have a sound understanding of forensic tools to call upon appropriate experts to deploy the correct tools when required.Chapter 11 summarizes the learning objectives of this text and suggests investigative learning topics for the reader going forward. Many topics relative to investigative practices have not been covered here as part of the core knowledge requirements for a new investigator. These topics include:Major Case ManagementInformant and confidential source managementUndercover investigationsSpecialized team investigations\",\n    \"publisher\": \"BCcampus\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/introduction-to-criminal-investigation-processes-practices-and-thinking\"\n}",
    "{\n    \"title\": \"Basic Income Tax - 8th Edition\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"William P. Kratzke, University of Memphis\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjYzLCJwdXIiOiJibG9iX2lkIn19--28c7a6852a4e0f0b92b9ca717480439591f743e5/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/9781365302886.png\",\n    \"description\": \"This book is the 8th edition of a basic income tax text. This edition incorporates the Tax Cuts and Jobs Act of 2017. It is intended to be a readable text, suitable for a three-hour course for a class comprised of law students with widely different backgrounds. The text integrates several of the CALI drills that Professor James Edward Maule (Villanova University) prepared.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781365302886\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/basic-income-tax\"\n}",
    "{\n    \"title\": \"Evidence: Jury Impeachment\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Colin Miller, University of South Carolina\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6OTEsInB1ciI6ImJsb2JfaWQifX0=--bb8bdab237fa7c09d23300b5e86290740ed018d9/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000EviJurImp.png\",\n    \"description\": \"The anti-jury impeachment rule, contained in Federal Rule of Evidence 606(b) and state counterparts, is a rule preventing the admission of jury testimony or statements in connection with an inquiry into the validity of the verdict, subject to certain exceptions. Through a series of cases and hypotheticals drawn from actual cases, this chapter gives readers a roadmap for how to address any jury impeachment issue in practice.Faculty materials also available:In addition to the free, open learning materials for students listed above, this eLangdell chapter includes a teacher's manual. Faculty and staff at CALI member schools can access these materials by logging in to eLangdell with a cali.org username and password.Contact CALIif you have questions.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/evidence-jury-impeachment\"\n}",
    "{\n    \"title\": \"Law of Commercial Transactions\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Don Mayer, University of Denver\",\n        \"Daniel Warner, Western Washington University\",\n        \"George J. Siedel, University of Michigan\",\n        \"Jethro K. Lieberman, New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Civil Law\",\n        \"Constitutional Law\",\n        \"Contract Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"/assets/common/placeholder-58e710bb6ec2738611b58ac5607240013133c8af9a01be9ca7136ff1b085eef1.webp\",\n    \"description\": \"Law of Commercial Transactionsis an up-to-date textbook that covers legal issues that students who engage in commercial transactions must understand. The text is organized to permit instructors to tailor the materials to their particular approach. The authors take special care to engage students by relating law to everyday events with their clear, concise and readable style.After introductory chapters covering the legal environment of business,Law of Commercial Transactionsprovides students with context and essential legal concepts relating to key commercial transactions topics: contracts, sales, commercial paper, debtors and creditors. The text provides the vocabulary and legal savvy students will need to talk in an educated way to customers, suppliers, creditors, government regulators and other stakeholders — and to their own lawyers.\",\n    \"publisher\": \"Saylor Foundation\",\n    \"language\": \"English\",\n    \"isbn13\": \"9781453343302\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/law-of-commercial-transactions\"\n}",
    "{\n    \"title\": \"American Contract Law for a Global Age\",\n    \"copyright_year\": \"2017\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Mark Edwin Burge\",\n        \"Franklin G. Snyder\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NTE5LCJwdXIiOiJibG9iX2lkIn19--04104b4e4bd37d02c5786cf464ef357a7fc3a973/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/0000AmeConLaw.png\",\n    \"description\": \"American Contract Law for a Global Ageby Franklin G. Snyder and Mark Edwin Burge of Texas A&M University School of Law is a casebook designed primarily for the first-year Contracts course as it is taught in American law schools, but is configured so as to be usable either as a primary text or a supplement in any upper-level U.S. or foreign class that seeks to introduce American contract law to students. As an eLangdell text, it offers maximum flexibility for students to read either in hard copy or electronic format on most electronic devices.Why “American” Contract Law? Nearly all American contract law texts focus on U.S. law. This volume simply makes that focus explicit. Modern American lawyers face an increasingly global world, and the book makes it clear that American law is not the only important commercial law regime in the world. But much of the value that the cosmopolitan and transnational American-trained lawyer brings to the table is an understanding of the contract law of the United States. To this end, the venerable English cases that exemplify common law doctrine are here presented not in their hoary 19th century settings. but in the 21st century forms that students can intuitively grasp.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/american-contract-law-for-a-global-age\"\n}",
    "{\n    \"title\": \"Entre la Criminología y la Política Criminal: Caminos para una Justicia Renovada\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Delia Paulina Samaniego-Quiguiri, Fiscalía General del Estado\",\n        \"Fabian Heriberto Toscano-Broncano, Consejo de la Judicatura\",\n        \"Diego Marcelo Bonilla-Morejón, Consejo de la Judicatura\",\n        \"Luis Arturo Alfonso-Olvera, Estudio Jurídico: Asesores Legales Corporativos – ASESCORP\",\n        \"Jefferson Steven Bonilla-Morejón, Escuela Superior Politécnica de Chimborazo\",\n        \"Henry Armando Manobanda-Chimbo, Universidad Amawta Wasi\",\n        \"Carlos Ivanoff Bucheli-Espinoza\",\n        \"Eduardo Joselito Paredes-Fierro, Universidad Estatal de Bolívar\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Criminal Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTEyNDcsInB1ciI6ImJsb2JfaWQifX0=--ae06bfaa1dc788300f4f434a6e89cac149db555a/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_67_67_coverImage_es_ES.jpg\",\n    \"description\": \"El texto aborda la relación entre criminología y política criminal, destacando su importancia en la comprensión del fenómeno criminal y la gestión estatal contra la delincuencia. Se exploran elementos clave, incluyendo los objetivos valorativos de la política criminal, la relación entre violencia estatal y social, la flexibilidad en la elección de objetivos, y la operación en diversos contextos. Se destaca la crucial participación del poder legislativo y la necesidad de adaptarse a la temporalidad. El texto aboga por nuevas políticas criminales respaldadas por instrumentos legales sólidos y una administración pública eficaz para moldear un sistema de justicia más preciso en la sociedad contemporánea.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942651228\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/entre-la-criminologia-y-la-politica-criminal-caminos-para-una-justicia-renovada\"\n}",
    "{\n    \"title\": \"Tort Law: Cases and Commentaries - 2nd Edition\",\n    \"copyright_year\": \"2021\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Samuel Beswick, Vancouver, BC, Canada\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mzg4NCwicHVyIjoiYmxvYl9pZCJ9fQ==--7e67076b200b23b560270c526abddb77cdd1bff0/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Screen%20Shot%202022-08-02%20at%208.31.09%20AM-min.png\",\n    \"description\": \"The law of obligations concerns the legal rights and duties owed between people. Three primary categories make up the common law of obligations: tort, contract, and unjust enrichment. This casebook provides an introduction to tort law: the law that recognises and responds to civil wrongdoing. The material is arranged in two parts. Part I comprises §§1-11 and addresses intentional and dignitary torts and the overarching theories and goals of tort law. Part II comprises §§12-25 and addresses no-fault compensation schemes, negligence, nuisance, strict liability, and tort law’s place within our broader legal systems.This casebook was compiled and edited by Assistant Professor Samuel Beswick of the University of British Columbia Peter A. Allard School of Law. Maddison Zapach (J.D. expected 2023) provided research assistance on the first edition (published July 2021). We gratefully acknowledge the influence on our approach to this subject of Professor Joost Blom QC of the Allard School of Law, Professor John C.P. Goldberg of Harvard Law School, and Associate Professor Rosemary Tobin of the University of Auckland Faculty of Law. The support of Open UBC and the UBC Teaching and Learning Enhancement Fund is also gratefully acknowledged.\",\n    \"publisher\": \"CanLII: Canadian Legal Information Institute\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/tort-law-cases-and-commentaries\"\n}",
    "{\n    \"title\": \"Becoming a Climate Conscious Lawyer: Climate and the Australian Legal System\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Anna Huggins, Queensland University of Technology\",\n        \"Ellen Hawkins, Queensland University of Technology\",\n        \"Steven Tudor, La Trobe University\",\n        \"Nicole Rogers, Bond University\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIyNjAsInB1ciI6ImJsb2JfaWQifX0=--461cafb77e5df1a61365c95525283213e459b35d/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/BecomingaClimateConsciousLawyer_Cover-350x495.jpg\",\n    \"description\": \"As the world grapples with the escalating challenges of climate change, the legal profession finds itself at a crossroads.Becoming a Climate Conscious Lawyer: Climate and the Australian Legal Systemprovides an original, innovative, and accessible analysis of the impact of climate change on legal doctrines and principles. It offers an overview of cutting-edge developments and how the transition to a low-carbon society is reshaping a wide range of laws, from corporate to criminal law, and beyond.This valuable new resource supports legal professionals, law students, and legal educators to understand current legal challenges – providing the know-how to strategically navigate, and positively influence, the development of law to respond to a climate changed world. The book delivers a transformative approach to legal education: equipping law students to become climate-conscious professionals with the confidence and competency to deliver legal solutions to a diverse range of clients, and promote climate justice across diverse communities.\",\n    \"publisher\": \"La Trobe University\",\n    \"language\": \"English\",\n    \"isbn13\": \"9780645838848\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/becoming-a-climate-conscious-lawyer-climate-and-the-australian-legal-system\"\n}",
    "{\n    \"title\": \"First Amendment: Cases, Controversies, and Contexts - Second Edition\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": \"2019\",\n    \"authors\": [\n        \"Ruthann Robson, City University of New York Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Administrative Law\",\n        \"Constitutional Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTY2MSwicHVyIjoiYmxvYl9pZCJ9fQ==--30fd2ea5eb7ead2900cab4e4ffa99021e5e4bad2/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/law1st.PNG\",\n    \"description\": \"This Casebook (Second Edition, December 2019) is intended to be used in an upper-division course covering the First Amendment to the United States Constitution. Its 14 chapters are substantially the same length, with the exception of Chapter One, the introduction, and Chapters Eleven and Twelve which in combination are the usual length. It is intended for 13 or 14 week semester that meets once or twice per week. Each Chapter contains a “Chapter Outline” at the beginning for ease of reference.The Casebook is organized with the Speech Clauses as Part One and the Religion Clauses as Part Two. Unlike many other courses, there is no accepted organizational scheme within these broad areas. As the Introduction notes, First Amendment doctrine, especially within freedom of speech, presents a varied and haphazard landscape.The Casebook follows a scheme that has proven effective in Professor Robson’s years of teaching the course to hundreds of students. The selection of cases tends toward the most recent and these tend to be less heavily edited. These recent cases often contain extended discussions of earlier cases that are not included in the Casebook.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/first-amendment-cases-controversies-and-contexts\"\n}",
    "{\n    \"title\": \"Revelando la Verdad: El Papel del Whistleblowing en la Preservación de la Integridad Estatal. Un Análisis de su Impacto en los ámbitos Penal, Administrativo y Financiero, explorando los desafíos y soluciones legales.\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Delia Paulina Samaniego-Quiguiri, Fiscalía General del Estado\",\n        \"Diego Marcelo Bonilla-Morejón, Consejo de la Judicatura\",\n        \"Xavier Oswaldo Pérez-Serrano, Contraloría General del Estado\",\n        \"Rosario Jajaira Salazar-Guerrero, Consejo de la Judicatura\",\n        \"Hilda del Rocío Erazo-Domínguez, Notaría Segunda del cantón San Miguel Bolívar\",\n        \"Thelmo Fernando Yánez-Erazo, Notaría Segunda del cantón San Miguel Bolívar\",\n        \"Leonardo Rafael Calles-Poveda, Consejo de la Judicatura\",\n        \"Ligia Vanessa Quiroz-Becerra, Consejo de la Judicatura\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTE4MTIsInB1ciI6ImJsb2JfaWQifX0=--766714d894ffcdf9d9a95648a67e96091cbf9a80/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/submission_75_75_coverImage_es_ES.jpg\",\n    \"description\": \"El Whistleblowing, conocido como “aquel que alerta” es esencial en la lucha contra la corrupción, ya que los whistleblowers identifican y reportan conductas ilícitas, contribuyendo así a la integridad estatal y al bien público. En varios Estados la corrupción alcanzada su más alto nivel conllevando pérdidas económicas significativas, en esta obra destacamos que el Whistleblowing se convierte en una herramienta vital, descubriendo un gran porcentaje de fraudes. Por lo tanto, es crucial implementar canales de denuncia efectivos y proteger a los informantes para combatir la corrupción y promover una administración pública ética y transparente. Este sistema no solo busca prevenir delitos, sino también corregir el mal gobierno en la administración pública. El Estado debería buscar estrategias prácticas para tutelar aquellos que denuncian prácticas indebidas, porque su valentía contribuye al bienestar del interés público. Transformándose los “whistlwblowers” en una pieza fundamental en la lucha contra la corrupción y en la promoción de una administración ética y transparente.\",\n    \"publisher\": \"Editorial Grupo AEA\",\n    \"language\": \"Spanish; Castilian\",\n    \"isbn13\": \"9789942651303\",\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/revelando-la-verdad-el-papel-del-whistleblowing-en-la-preservacion-de-la-integridad-estatal-un-analisis-de-su-impacto-en-los-ambitos-penal-administrativo-y-financiero-explorando-los-desafios-y-soluciones-legales\"\n}",
    "{\n    \"title\": \"Computer-Aided Exercises in Civil Procedure - 7th Edition\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Roger C. Park, University of California Hastings\",\n        \"Douglas D. McFarland, Hamline University\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Procedural Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTI1MjIsInB1ciI6ImJsb2JfaWQifX0=--fed8b76e12a428b296a54c2a5bf2bfa0e6783f49/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/cae.jpg\",\n    \"description\": \"The sixth edition, first published as an ebook, and this seventh edition carry forward the philosophy and structure of the earlier editions. This book is not a comprehensive treatise on the subject of civil procedure, yet it provides a mixture of expository text, cases, and self-testing questions in nearly all of the major areas of the subject.In order to maximize accessibility, flexibility, and compatibility of the book, the authors have chosen CALI'seLangdell Pressto publish and distribute the sixth edition (as chapters) and this revised seventh (as a complete book) electronically with aCreative Commonslicense. Publishing a law textbook electronically with far fewer restrictions than most commercial books and using a somewhat new, boutique outfit such as eLangdell Press is an unconventional choice, to say the least. But the authors share the eLangdell vision of more flexible teaching materials for professors and more cost-effective books for students. Professors may now edit and remix this work to match their teaching without worry of copyright infringement. Students may now adopt this book, read it using any number of software or devices, and even print it - all for free. The book's authors, like its publishers, believe that this new book model represents an important and long overdue step forward in the way law school books are published.All the exercises have been substantially revised for this edition. The individual exercises also are reorganized and expanded so that they follow a more standardized pattern: expository text on the topic area, work-book questions, and introduction to the related online CALI lessons.This book, and the accompanying interactive exercises known as CALI Lessons available online through the Center for Computer-Assisted Legal Instruction (CALI) at www.cali.org, are intended to provide a challenging educational experience. For each exercise, students should read the text in this book and answer the questions before accessing the rest of the exercise online.Professors choosing to assign only some of the exercises - or students looking for additional work only in certain areas of the subject - may especially want to consider these exercises and lessons:Exercise Two: Jurisdiction (Jurisdiction & Venue and Jurisdiction Over the Person);Exercise Three: Pleading a Complaint;Exercise Five: Motions to Dismiss and Waiver under Federal Rule 12;Exercise Six: Joinder and Supplemental Jurisdiction (An Exercise in Civil Procedure, Review of Joinder Concepts, Joinder of Claims and Parties, and An Interpleader Primer);Exercise Eight: Summary Judgment; andExercise Eleven: Preclusion.Additionally, Exercise One: Holding and Dicta in the Context of a Diversity Case is an excellent introduction to legal method.The first two editions of this book, by Roger Park, included Exercise One:Holding and Dicta in the Context of a Diversity Case, Exercise Two: Jurisdiction, Exercise Three: Pleading a Complaint, Exercise Four:Demurrers and Judgments on the Pleadings, Exercise Five:Motions to Dismiss and Waiver Under Rule 12, Exercise Nine:Judgment as a Matter of Law, and Exercise Ten:Evidence for Civil Procedure Students. For the last five editions of this book, Douglas McFarland has edited the above exercises and added Exercise Six: Joinder and Supplemental Jurisdiction, Exercise Seven: Discovery, Exercise Eight: Summary Judgment, and Exercise Eleven: Preclusion. Accordingly, the book has become more comprehensive, expanding from seven to eleven exercises. Of course, each new edition incorporates changes and updates in procedural law.All of the information necessary to prepare for an interactive exercise is contained in this book. Reference to additional materials may be useful, but is not necessary. Each exercise can be assigned separately. No exercise is a prerequisite for another. In fact, students will find the expository material and work-book questions in each exercise independently valuable even without completing the CALI lesson for that chapter. The CALI lessons are valuable either to provide additional understanding and self-testing of subjects discussed in class or as primary substitutes for areas not covered in depth in class.In general, the interactive, online exercises follow a non-linear branching format. They seek to present challenges and questions instead of rote learning or leading students through an error-free educational experience. Although the exercises eventually evaluate student answers, they sometimes eschew immediate feedback in favor of the development of a line of questions. The ideal is the creation of a classroom-like Socratic dialogue. For a description of general goals and educational theory of the exercises, see Roger C. Park & Russell Burris, Computer-Aided Legal Instruction in Law: Theories, Techniques, and Trepidations, 1978 Am. B. Found. Res. J. 1. This book and accompanying exercises cannot reproduce the spontaneity and flexibility of the live classroom, but they can be a useful supplement. They require an active learning process in which students respond to questions dozens of times during each hour of instruction, and receive prompt evaluation of their answers.Another benefit of computer-aided instruction—and the phrase “computer-aided” is used loosely here and in the title of this book; the exercises are compatible with many non-computer devices such as tablets and smartphones—is its “individualized” nature. Law professors and students should not take this literally, however. Surveys administered at several law schools indicate that an overwhelming majority of students believe that the exercises are more valuable when done in pairs or threes instead of alone. Students who do the exercises with a partner are more likely to consider their responses carefully and to enjoy the experience. They also have lively discussions about what their response should be and why the computer responded as it did.As with previous editions, we continue to welcome and solicit comments from professors and students about the book and the accompanying exercises.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/computer-aided-exercises-in-civil-procedure\"\n}",
    "{\n    \"title\": \"The Pay for Success Handbook\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Suzanne Adatto, Stanford Graduate School of Education\",\n        \"Paul Brest, Stanford Law School\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6NzY0LCJwdXIiOiJibG9iX2lkIn19--b4fdac316f49637d91fed11191ef2a46b165cd35/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000PaySucces.png\",\n    \"description\": \"Government agencies frequently contract with nonprofit or for-profit organizations to provide services to improve the well-being of their clients―for example, by reducing recidivism, homelessness, or drug use. Governments have traditionally paid service providers on the basis of the number of clients they treat.The past decade has seen a number of Pay for Success (PFS) or results-based finance (RBF) programs, in which service providers are paid for their outcomes or results. For example, whereas a government agency contracting with a service provider to reduce recidivism among young men released from prison would traditionally have paid the service provider for the hours spent counseling a client, a PFS contract pays the organization for success in reducing the clients’ rate of recidivism from some baseline.This handbook is written for government officials considering the adoption of Pay For Success (PFS) programs and for students in public policy and business schools interested in studying outcomes-oriented government contracts for services. Part One introduces concepts necessary to develop and operate a service delivery program and then surveys some of the issues specific to PFS. Part Two presents two detailed case studies and a number of shorter descriptions of PFS programs. Part Three focuses on the components of PFS programs; it also discusses barriers to their development and ways of overcoming them.An editable file (docx) is also available.\",\n    \"publisher\": \"Suzanne Adatto and Paul Brest\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/the-pay-for-success-handbook\"\n}",
    "{\n    \"title\": \"Bankruptcy Law and Practice\",\n    \"copyright_year\": \"2016\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Gregory Germain, Syracuse University College of Law\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MjYwLCJwdXIiOiJibG9iX2lkIn19--c18e05324b03a990f96fd55bc6c8757c836204bf/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000BankLawPr.png\",\n    \"description\": \"This is the third edition ofBankruptcy Law and Practice, a Casebook Designed to Train Lawyers for the Practice of Bankruptcy Law. It is designed for a one-semester course in debtor/creditor law and bankruptcy. The book deals with both creditor remedies and debtor protections, starting with state law collection remedies, exemptions, and the important special protections for secured creditors under both Article 9 of the Uniform Commercial Code and state real property recording acts. After a thorough review of state law debt collection practice, the book covers the basics of straight bankruptcy law with a focus on Chapter 7 of the Bankruptcy Code, both for individuals and businesses. Although the book has a practice focus, it covers the major Supreme Court cases, and important appellate cases with an emphasis on areas of uncertainty. The book also emphasizes the Bankruptcy Code itself, using problem sets to get students to work through the language of the Bankruptcy Code.At the end of the book are two abbreviated chapters on bankruptcy reorganizations for consumers under Chapter 13 and for businesses under Chapter 11. These chapters are intended to outline the reasons that debtors choose to file for reorganization rather than liquidation, and focuses on the rules for confirming a plan.The primary goal of the book is to prepare students for the practice of bankruptcy law. Students who understand these materials should be well prepared to anticipate and address the kinds of issues that arise in real bankruptcy cases, whether in a small dollar consumer practice or a big dollar corporate reorganization. Students will learn the language of commercial law and bankruptcy, along with the skills to find their way around the Bankruptcy Code.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/bankruptcy-law-and-practice\"\n}",
    "{\n    \"title\": \"Contract Doctrine, Theory & Practice Volume 2\",\n    \"copyright_year\": \"2012\",\n    \"last_update\": null,\n    \"authors\": [\n        \"J.H. Verkerke, University of Virginia\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Contract Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODMsInB1ciI6ImJsb2JfaWQifX0=--23660a7e14560d2b73fbbb50b150183751912a30/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000ConDocVo2.png\",\n    \"description\": \"This is Volume 2 in a three volume series written for Contracts Law. Its orginal title was \\\"Collaborative Teaching Materials for Contracts.\\\"The first semester of law school is mostly about learning to speak a new legal language (but emphatically not “legalese”), to formulate and evaluate legal arguments, to become comfortable with the distinctive style of legal analysis. We could teach these skills using almost any legal topic. But we begin the first-year curriculum with subjects that pervade the entire field of law. Contract principles have a long history and they form a significant part of the way that lawyers think about many legal problems. As you will discover when you study insurance law, employment law, family law, and dozens of other practice areas, your knowledge of contract doctrine and theory will be invaluable.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/contract-doctrine-theory-practice-volume-2\"\n}",
    "{\n    \"title\": \"United States Trademark Law\",\n    \"copyright_year\": \"2014\",\n    \"last_update\": null,\n    \"authors\": [\n        \"eLangdell Press Editorial Staff\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6ODgsInB1ciI6ImJsb2JfaWQifX0=--a955ab0b6a469e9904d0b9933531f942eefc5bb3/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/0000Copyrigh3.png\",\n    \"description\": \"This Intellectual Property Supplement from eLangdell Press contains the text of federal laws and regulations in the area of copyright, trademarks and patents. The editors have endeavored to gather all relevant laws, rules and regulations. This collection is intended to be used primarily as a statutory supplement for law students and legal scholars in academic settings, although practitioners in this area of law will also find it useful.This volume, Volume III: Trademark Statutory Law contains Chapter 22 of Title 15 of the United States Code as it appears on the most current edition available on the U.S. Government website FDSYS. Updates to the U.S. Code not yet found in the FDSYS published editions can be found in the United States House of Representatives Office of Law Revision Counsel's Classification Tables. Some formatting modification has been performed to better accommodate electronic readers.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/united-states-trademark-law\"\n}",
    "{\n    \"title\": \"Sources of American Law: An Introduction to Legal Research - 8th Edition\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Beau Steenken, University of Kentucky\",\n        \"Tina M. Brooks, University of Northern Iowa\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTIzNTQsInB1ciI6ImJsb2JfaWQifX0=--3dc205273769fbb97acf753dd4010f3ba2c70d93/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJqcGciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--92321c91481b14cf986468483667757f1e9e4957/soaw.jpg\",\n    \"description\": \"At its most basic definition the practice of law comprises conducting research to find relevant rules of law and then applying those rules to the specific set of circumstances faced by a client. However, in American law, the legal rules to be applied derive from myriad sources, complicating the process and making legal research different from other sorts of research. This text introduces first-year law students to the new kind of research required to study and to practice law. It seeks to demystify the art of legal research by following a “Source and Process” approach. First, the text introduces students to the major sources of American law and describes the forms the various authorities traditionally took in print. After establishing this base, the text proceeds to instruct students on the methods they will most likely use in practice, namely electronic research techniques and the consultation of secondary sources. Sources of Law incorporates screencasts currently hosted on YouTube that actively demonstrate the processes described in the static text. Finally, the text illustrates how the different pieces come together in the legal research process.Sources of Law focuses on realistic goals for 1Ls to learn in a relatively small amount of instruction time, and so focuses mainly on the basics. It does introduce some advanced material so that 1Ls can recognize pieces of information they may encounter in research, but it does not fully cover researching materials outside the scope of the traditional 1L course. As such, it is best-suited for introductory legal research courses for 1Ls.What's New in the Eighth Edition:The Eighth Edition primarily expands Chapter 9’s discussion of the research process to compare currently available legal generative AI tools to previously existing research tools such as secondary sources and electronic citators. That expansion also addresses some of the AI tools’ limitations and further discusses how thoughtful evaluation of available research tools can affect the research process.\",\n    \"publisher\": \"CALI's eLangdell® Press\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/sources-of-american-law-an-introduction-to-legal-research\"\n}",
    "{\n    \"title\": \"Open-Source Property: A Free Casebook\",\n    \"copyright_year\": \"2015\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Stephen Clowney, University of Arkansas\",\n        \"James Grimmelmann, Cornell University\",\n        \"Michael Grynberg, DePaul University\"\n    ],\n    \"subjects\": [\n        \"Law\",\n        \"Civil Law\",\n        \"Property Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTQ2MCwicHVyIjoiYmxvYl9pZCJ9fQ==--f6f42220209af964e342d1812b306ea634366867/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJQTkciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--89343f782352aa835ac38157b276868b90549fdb/Capture.PNG\",\n    \"description\": \"Open Source Property: A Free Casebookis a free resource for instructors and students of the first-year Property Law course at American law schools, and anyone else with an interest in the subject.\",\n    \"publisher\": \"Open Source Property\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/open-source-property-a-free-casebook\"\n}",
    "{\n    \"title\": \"Legal Fundamentals of Healthcare Law\",\n    \"copyright_year\": \"2024\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Tiffany Jackman, University of West Florida\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6MTA3OTYsInB1ciI6ImJsb2JfaWQifX0=--9567775e66ada0b82808373c14552735c5cedaa1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Untitled-design-6-350x467.png\",\n    \"description\": \"Healthcare, a field dedicated to the well-being of individuals and communities, operates within an intricate web of legal principles. Understanding these laws is not simply a professional necessity for doctors, nurses, administrators, and researchers; it’s also an ethical imperative for anyone who interacts with the healthcare system. This book is your compass, guiding you through the labyrinth of legal fundamentals that shape the landscape of healthcare.\",\n    \"publisher\": \"University of West Florida Pressbooks\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/legal-fundamentals-of-healthcare-law\"\n}",
    "{\n    \"title\": \"Open Judicial Politics - 2nd Edition\",\n    \"copyright_year\": \"2020\",\n    \"last_update\": null,\n    \"authors\": [\n        \"Rorie Spill Solberg, Oregon State University\",\n        \"Jennifer Segal Diascro, American University\",\n        \"Eric Waltenburg, Purdue University\"\n    ],\n    \"subjects\": [\n        \"Law\"\n    ],\n    \"image\": \"https://open.umn.edu/rails/active_storage/representations/redirect/eyJfcmFpbHMiOnsiZGF0YSI6Mjc5NCwicHVyIjoiYmxvYl9pZCJ9fQ==--f6cacbea239ed2e08a111ce3dcab3e54de9a00d1/eyJfcmFpbHMiOnsiZGF0YSI6eyJmb3JtYXQiOiJwbmciLCJyZXNpemUiOiI0OTB4MTAwMCJ9LCJwdXIiOiJ2YXJpYXRpb24ifX0=--1d221d0e87311391d13a7728d03226e2fff3667a/Open-Judicial-Politics-350x453.png\",\n    \"description\": \"The impetus for this volume was a multitude of conversations regarding pedagogy and teaching related to our judicial process courses. Based on these conversations, we identified four main threads or needs of our colleagues: First, many of us bring or want to bring more “political science” into our classes, though we also want to avoid the high costs of reinventing successful existing courses to do so. Second, our programs all require a political methodology course, and we want to reinforce those lessons in our substantive courses. We want to encourage our students’ understanding of how to read and understand research studies as well as how to craft their own research questions. Third, we want to keep our courses as current as possible. And fourth, we wanted to find a way to bring the cost of our courses down, as we see so many students struggle with the high costs of a college degree. This volume (as well as any future editions) addresses each of these concerns.Open Judicial Politicsis a compilation of new and original research in judicial politics written specifically for the undergraduate audience, thus providing accessible examples of political science research that also address some of the more current concerns and controversies in our field. Additionally, every article is accompanied by some type of classroom activity—from basic discussion questions to full-blown simulations—that makes it easier for instructors to adapt the material to their courses and enhance classes with interactives. The chapters of the volume generally follow the well-worn path of most textbooks of judicial politics, making the volume an easy companion for adoption, and the material should fit seamlessly into the preestablished structures of most courses. Finally, the volume is an open-source resource, and adoption of the text adds no cost for our students. Whether one uses one or ten articles, the cost remains nil. This volume includes twenty-two original contributions that we have grouped into nine parts. The studies cover the breadth and scope of the field of judicial politics, with attention to appellate and trial courts, national high courts and intermediate appellate courts, and US courts and their international counterparts, thus providing a large range of materials to complement any judicial process course or text. We are especially pleased that undergraduate students played key roles in the creation of several of these studies, performing data collection and analysis as well as complete authorship from stem to stern. For the second edition, we have added fifteen articles that continue to illustrate key concepts and aspects of judicial politics, following the same formula of empirical research tailored to an undergraduate audience, accompanied by a variety of classroom activities.\",\n    \"publisher\": \"Oregon State University\",\n    \"language\": \"English\",\n    \"isbn13\": null,\n    \"source\": \"https://open.umn.edu/opentextbooks/textbooks/open-judicial-politics\"\n}"
]