[
    {
        "title": "American Government 3e",
        "publish_date": "Jul 28, 2021",
        "last_update": "Jul 18, 2024",
        "authors": [
            "Glen Krutz, Oklahoma State University",
            "Sylvie Waskiewicz, PhD",
            "Prosper Bernard, Jr., City University of New York",
            "Jennifer Danley-Scott, Texas Woman’s University",
            "Ann Kordas, Johnson & Wales University",
            "Christopher Lawrence, Middle Georgia State College",
            "Tonya Neaves, George Mason University",
            "Adam Newmark, Appalachian State University",
            "Brooks D. Simpson, Arizona State University",
            "Joel Webb, Tulane University",
            "Abram Trosky, US Army War College",
            "Shawn Williams, Campbellsville University",
            "Rhonda Wrzenski, Indiana University Southeast"
        ],
        "subjects": [
            "Social Sciences",
            "American Government"
        ],
        "image": null,
        "description": "American Government 3e aligns with the topics and objectives of many government courses. Faculty involved in the project have endeavored to make government workings, issues, debates, and impacts meaningful and memorable to students while maintaining the conceptual coverage and rigor inherent in the subject. With this objective in mind, the content of this textbook has been developed and arranged to provide a logical progression from the fundamental principles of institutional design at the founding, to avenues of political participation, to thorough coverage of the political structures that constitute American government. The book builds upon what students have already learned and emphasizes connections between topics as well as between theory and applications. The goal of each section is to enable students not just to recognize concepts, but to work with them in ways that will be useful in later courses, future careers, and as engaged citizens. In order to help students understand the ways that government, society, and individuals interconnect, the revision includes more examples and details regarding the lived experiences of diverse groups and communities within the United States. The authors and reviewers sought to strike a balance between confronting the negative and harmful elements of American government, history, and current events, while demonstrating progress in overcoming them. In doing so, the approach seeks to provide instructors with ample opportunities to open discussions, extend and update concepts, and drive deeper engagement. Changes made in American Government 3e are described in the preface to help instructors transition to the third edition. The second edition of American Government by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-38-1",
        "source": "https://openstax.org/details/books/american-government-3e"
    },
    {
        "title": "Introduction to Anthropology",
        "publish_date": "Feb 23, 2022",
        "last_update": "Feb 22, 2024",
        "authors": [
            "Jennifer Hasty, University of Pennsylvania",
            "David G. Lewis, Oregon State University",
            "Marjorie M. Snipes, University of West Georgia"
        ],
        "subjects": [
            "Social Sciences",
            "Anthropology"
        ],
        "image": null,
        "description": "Designed to meet the scope and sequence of your course, OpenStax Introduction to Anthropology is a four-field text integrating diverse voices, engaging field activities, and meaningful themes like Indigenous experiences and social inequality to engage students and enrich learning. The text showcases the historical context of the discipline, with a strong focus on anthropology as a living and evolving field.  There is significant discussion of recent efforts to make the field more diverse—in its practitioners, in the questions it asks, and in the applications of anthropological research to address contemporary challenges.  In addressing social inequality, the text drives readers to consider the rise and impact of social inequalities based on forms of identity and difference (such as gender, ethnicity, race, and class) as well as oppression and discrimination. The contributors to and dangers of socioeconomic inequality are fully addressed, and the role of inequality in social dysfunction, disruption, and change is noted. If you have encountered a white screen while accessing your OpenStax textbook, our developers suggest closing all of your OpenStax.org tabs and then loading the book again.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-99-2",
        "source": "https://openstax.org/details/books/introduction-anthropology"
    },
    {
        "title": "Principles of Economics 3e",
        "publish_date": "Dec 14, 2022",
        "last_update": "Jul 18, 2024",
        "authors": [
            "Steven A. Greenlaw, University of Mary Washington",
            "David Shapiro, Pennsylvania State University",
            "Daniel MacDonald, California State University, San Bernardino",
            "Eric Dodge, Hanover College",
            "Cynthia Gamez, University of Texas at El Paso",
            "Andres Jauregui, Columbus State University",
            "Diane Keenan, Cerritos College",
            "Amyaz Moledina, The College of Wooster",
            "Craig Richardson, Winston-Salem State University",
            "Ralph Sonenshine, American University"
        ],
        "subjects": [
            "Social Sciences",
            "Economics"
        ],
        "image": null,
        "description": "Principles of Economics 3e covers the scope and sequence of most introductory economics courses. The third edition takes a balanced approach to the theory and application of economics concepts. The text uses conversational language and ample illustrations to explore economic theories, and provides a wide array of examples using both fictional and real-world scenarios. The third edition has been carefully and thoroughly updated to reflect current data and understanding, as well as to provide a deeper background in diverse contributors and their impacts on economic thought and analysis. For example, the third edition highlights the research and views of a broader group of economists. Brief references and deeply explored socio-political examples have been updated to showcase the critical – and sometimes unnoticed – ties between economic developments and topics relevant to students. A fuller list of changes made in Principles of Economics 3e are described in the preface and the transition guide to help instructors transition to the third edition. The second edition of Principles of Economics by OpenStax is available in web view here. OpenStax is retiring Principles of Microeconomics and Principles of Macroeconomics for AP 2e textbooks because they are outdated. We recommend that Advanced Placement instructors and students use the college-level textbooks.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-63-3",
        "source": "https://openstax.org/details/books/principles-economics-3e"
    },
    {
        "title": "Principles of Macroeconomics 3e",
        "publish_date": "Dec 14, 2022",
        "last_update": "Jul 18, 2024",
        "authors": [
            "David Shapiro, Pennsylvania State University",
            "Daniel MacDonald, California State University, San Bernardino",
            "Steven A. Greenlaw, University of Mary Washington",
            "Eric Dodge, Hanover College",
            "Cynthia Gamez, University of Texas at El Paso",
            "Andres Jauregui, Columbus State University",
            "Diane Keenan, Cerritos College",
            "Amyaz Moledina, The College of Wooster",
            "Craig Richardson, Winston-Salem State University",
            "Ralph Sonenshine, American University"
        ],
        "subjects": [
            "Social Sciences",
            "Economics"
        ],
        "image": null,
        "description": "Principles of Macroeconomics 3e covers the scope and sequence of most one semester introductory macroeconomics courses. The third edition takes a balanced approach to the theory and application of macroeconomics concepts. The text uses conversational language and ample illustrations to explore economic theories, and provides a wide array of examples using both fictional and real-world scenarios. The third edition has been carefully and thoroughly updated to reflect current data and understanding, as well as to provide a deeper background in diverse contributors and their impacts on economic thought and analysis. For example, the third edition highlights the research and views of a broader group of economists. Brief references and deeply explored socio-political examples have also been updated to showcase the critical – and sometimes unnoticed – ties between economic developments and topics relevant to students. A fuller list of changes made in Principles of Macroeconomics 3e are described in the preface and the transition guide to help instructors transition to the third edition. The second edition of Principles of Macroeconomics by OpenStax is available in web view here. OpenStax is retiring Principles of Microeconomics and Principles of Macroeconomics for AP 2e textbooks because they are outdated. We recommend that Advanced Placement instructors and students use the college-level textbooks.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-64-0",
        "source": "https://openstax.org/details/books/principles-macroeconomics-3e"
    },
    {
        "title": "Principles of Microeconomics 3e",
        "publish_date": "Dec 14, 2022",
        "last_update": "Jul 18, 2024",
        "authors": [
            "David Shapiro, Pennsylvania State University",
            "Daniel MacDonald, California State University, San Bernardino",
            "Steven A. Greenlaw, University of Mary Washington",
            "Eric Dodge, Hanover College",
            "Cynthia Gamez, University of Texas at El Paso",
            "Andres Jauregui, Columbus State University",
            "Diane Keenan, Cerritos College",
            "Amyaz Moledina, The College of Wooster",
            "Craig Richardson, Winston-Salem State University",
            "Ralph Sonenshine, American University"
        ],
        "subjects": [
            "Social Sciences",
            "Economics"
        ],
        "image": null,
        "description": "Principles of Microeconomics 3e covers the scope and sequence of most one semester introductory microeconomics courses. The third edition takes a balanced approach to the theory and application of microeconomics concepts. The text uses conversational language and ample illustrations to explore economic theories, and provides a wide array of examples using both fictional and real-world applications. The third edition has been carefully and thoroughly updated to reflect recent developments, as well as to provide a deeper background in diverse contributors and their impacts on economic thought and analysis. For example, the third edition highlights the research and views of a broader group of economists. A fuller list of changes made in Principles of Microeconomics 3e are described in the preface and the transition guide to help instructors transition to the third edition. The second edition of Principles of Microeconomics by OpenStax is available in web view here. OpenStax is retiring Principles of Microeconomics and Principles of Macroeconomics for AP 2e textbooks because they are outdated. We recommend that Advanced Placement instructors and students use the college-level textbooks.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-65-7",
        "source": "https://openstax.org/details/books/principles-microeconomics-3e"
    },
    {
        "title": "Lifespan Development",
        "publish_date": "Oct 16, 2024",
        "last_update": "Oct 02, 2024",
        "authors": [
            "Diana Riser, Catawba College",
            "Rose Spielman, Connecticut State Community College",
            "David Biek, Middle Georgia State University",
            "Alisa Beyer, Chandler Gilbert Community College",
            "Bakhtawar Bhadha, Pasadena City College",
            "Ellen Cotter, Georgia Southwestern State University",
            "Kathleen Hughes, University of Calgary",
            "Deepti Karkhanis, Bellevue College",
            "Kris Kimbler, Florida Gulf Coast University",
            "Julie Lazzara, Chandler-Gilbert Community College",
            "Rebecca McDonald, Washington & Jefferson College",
            "Ronald Mossler, Los Angeles Valley College",
            "Paula Mullineaux, Hamline University",
            "Amy Osmon, Daytona State College",
            "Jason Spiegelman, Community College of Baltimore County",
            "Erik Uliasz, Wyomissing Area School District / Johns Hopkins Center for Talented Youth",
            "John Woodman, Embry-Riddle Aeronautical University"
        ],
        "subjects": [
            "Social Sciences",
            "Lifespan Development"
        ],
        "image": null,
        "description": "Lifespan Development aligns to the topics and objectives of most introductory developmental psychology courses taught across departments. Grounded in foundational theories and scientific research, the text teaches students about core aspects of human development—physical, cognitive, social, emotional—across the lifespan. A primary goal of the book is to incorporate content, scholarship, and activities that explore a variety of perspectives that encourage all students to feel seen and included. Lifespan Development strives to openly address complex topics with scholarly responsibility and an effort to increase equity and inclusion in the research presented, as well as to foster student engagement in the classroom through relevant examples and applications. Focused on driving meaningful and memorable learning experiences, the narrative places concepts in contexts that give students the means to understand human development and how that knowledge can be applied to and improve their own lives and the lives of others.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-53-2",
        "source": "https://openstax.org/details/books/lifespan-development"
    },
    {
        "title": "Introduction to Political Science",
        "publish_date": "May 18, 2022",
        "last_update": "Apr 26, 2024",
        "authors": [
            "Mark Carl Rom, Georgetown University",
            "Masaki Hidaka, American University",
            "Rachel Bzostek Walker, Collin College",
            "Emilia B. Carvalho, Lone Star College",
            "Rebecca Eissler, San Francisco State University",
            "Terri Susan Fine, University of Central Florida",
            "Cassandra Khatri, Lone Star College",
            "Timothy Lim, California State University, Los Angeles",
            "Brenda Norton, Angelo State University",
            "Robert Postic, University of Findlay",
            "Joseph Prud’homme, Washington College",
            "Shyam Krishnan Sriram, Gonzaga University",
            "Victoria Williams, Alvernia University"
        ],
        "subjects": [
            "Social Sciences",
            "Political Science"
        ],
        "image": null,
        "description": "Designed to meet the scope and sequence of your course, OpenStax Introduction to Political Science provides a strong foundation in global political systems, exploring how and why political realities unfold. Rich with examples of individual and national social action, this text emphasizes students’ role in the political sphere and equips them to be active and informed participants in civil society. Learn more about what this free, openly-licensed textbook has to offer you and your students. If you have encountered a white screen while accessing your OpenStax textbook, our developers suggest closing all of your OpenStax.org tabs and then loading the book again.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-56-5",
        "source": "https://openstax.org/details/books/introduction-political-science"
    },
    {
        "title": "Introduction to Behavioral Neuroscience",
        "publish_date": "Nov 13, 2024",
        "last_update": "Oct 30, 2024",
        "authors": [
            "Elizabeth D. Kirby, The Ohio State University",
            "Melissa J. Glenn, Colby College",
            "Noah J. Sandstrom, Williams College",
            "Christina L. Williams, Duke University",
            "S. D. Bilbo, Duke University",
            "Irina Calin-Jageman, Dominican University",
            "Robert J. Calin-Jageman, Dominican University",
            "Matt Carter, Williams College",
            "Victoria L. Castro, University of Texas El Paso",
            "Christine J. Charvet, Auburn University",
            "Natalia Duque-Wilckens, North Carolina State University",
            "Amy L. Griffin, University of Delaware",
            "Yanabah Jaques, University of California Berkeley",
            "Daniela Kaufer, University of California Berkeley",
            "MeeJung Ko, University of California Berkeley",
            "Megan M. Mahoney, University of Illinois Urbana-Champaign",
            "C. Daniel Meliza, University of Virginia",
            "Eric M. Mintz, Kent State University",
            "Sandra E. Muroy, University of California Berkeley",
            "Richard Olivo, Smith College",
            "Yuan B. Peng, University of Texas Arlington",
            "Briana E. Pinales, University of Texas El Paso",
            "Briana E. Pinales, University of Texas El Paso",
            "Anita M. Quintana, University of Texas El Paso",
            "Shivon A. Robinson, Williams College",
            "Michael Sandstrom, Central Michigan University",
            "Cecil J. Saunders, Kean University",
            "Gary L. Wenk, The Ohio State University",
            "Cedric L. Williams, University of Virginia",
            "Kevin D. Wilson, Gettysburg College",
            "Joseph D. Zak, University of Illinois Chicago"
        ],
        "subjects": [
            "Social Sciences",
            "Psychology"
        ],
        "image": null,
        "description": "Introduction to Behavioral Neuroscience aligns to the topics and objectives of introductory behavioral neuroscience courses taught in psychology, biology, neuroscience, and similar departments. This offering is intended for undergraduates with no presumed college-level science coursework, and presents the foundational principles of brain-behavior-environment interactions. In Introduction to Behavioral Neuroscience, students will begin to understand how the physiology of the nervous system and the environment dictate our movements, thoughts and feelings. Students will be challenged to think about real neuroscience experiments, appreciate how neuroscience knowledge evolves over time, and consider open questions in the field. They will also be invited to learn about the people behind the science, such as through interview videos and researcher profiles. The development of this material was supported by the U.S. National Science Foundation under IOS-2035041 to Elizabeth Kirby. The opinions, descriptions, recommendations, and findings are those of the contributors, and do not necessarily reflect the views of NSF. An Affordable Learning Exchange grant to Elizabeth Kirby from the Ohio State University also supported development of this material.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-57-0",
        "source": "https://openstax.org/details/books/introduction-behavioral-neuroscience"
    },
    {
        "title": "Psychology 2e",
        "publish_date": "Apr 22, 2020",
        "last_update": "Sep 19, 2024",
        "authors": [
            "Rose M. Spielman, Formerly of Quinnipiac University",
            "William J. Jenkins, Mercer University",
            "Marilyn D. Lovett, Spelman College",
            "Mara Aruguete, Lincoln University",
            "Laura Bryant, Eastern Gateway Community College",
            "Barbara Chappell, Walden University",
            "Kathryn Dumper, Bainbridge State College",
            "Arlene Lacombe, Saint Joseph’s University",
            "Julie Lazzara, Paradise Valley Community College",
            "Tammy McClain, West Liberty University",
            "Barbara B. Oswald, Miami University",
            "Marion Perlmutter, University of Michigan",
            "Mark D. Thomas, Albany State University"
        ],
        "subjects": [
            "Social Sciences",
            "Psychology"
        ],
        "image": null,
        "description": "Psychology 2e is designed to meet scope and sequence requirements for the single-semester introduction to psychology course. The book offers a comprehensive treatment of core concepts, grounded in both classic studies and current and emerging research. The text also includes coverage of the DSM-5 in examinations of psychological disorders. Psychology incorporates discussions that reflect the diversity within the discipline, as well as the diversity of cultures and communities across the globe. The second edition contains detailed updates to address comments and suggestions from users. Significant improvements and additions were made in the areas of research currency, diversity and representation, and the relevance and recency of the examples. Many concepts were expanded or clarified, particularly through the judicious addition of detail and further explanation where necessary. Finally, the authors addressed the replication issues in the psychology discipline, both in the research chapter and where appropriate throughout the book. Changes made in Psychology 2e are described in the preface to help instructors transition to the second edition. The first edition of Psychology by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-23-7",
        "source": "https://openstax.org/details/books/psychology-2e"
    },
    {
        "title": "Introduction to Sociology 3e",
        "publish_date": "Jun 03, 2021",
        "last_update": "Aug 05, 2024",
        "authors": [
            "Tonja R. Conerly, San Jacinto College",
            "Kathleen Holmes, Northern Essex Community College",
            "Asha Lal Tamang, Minneapolis Community and Technical College & North Hennepin Community College",
            "Jennifer Hensley, Vincennes University",
            "Jennifer L. Trost, University of St. Thomas",
            "Pamela Alcasey, Central Texas College",
            "Kate McGonigal, Fort Hays State University",
            "Heather Griffiths, Fayetteville State University",
            "Nathan Keirns, Zane State College",
            "Eric Strayer, Hartnell College",
            "Tommy Sadler, Union University",
            "Susan Cody-Rydzewski, Georgia Perimeter College",
            "Gail Scaramuzzo, Lackawanna College",
            "Sally Vyain, Ivy Tech Community College",
            "Jeff Bry, Minnesota State Community and Technical College at Moorhead",
            "Faye Jones, Mississippi Gulf Coast Community College"
        ],
        "subjects": [
            "Social Sciences",
            "Sociology"
        ],
        "image": null,
        "description": "Introduction to Sociology 3e aligns to the topics and objectives of many introductory sociology courses. It is arranged in a manner that provides foundational sociological theories and contexts, then progresses through various aspects of human and societal interactions. The new edition is focused on driving meaningful and memorable learning experiences related to critical thinking about society and culture. The text includes comprehensive coverage of core concepts, discussions and data relevant to a diverse audience, and features that draw learners into the discipline in powerful and personal ways. Overall, Introduction to Sociology 3e aims to center the course and discipline as crucial elements for understanding relationships, society, and civic engagement; the authors seek to lay the foundation for students to apply what they learn throughout their lives and careers. The authors, reviewers, and the entire team worked to build understanding of the causes and impacts of discrimination and prejudice. Introduction to Sociology 3e contains dozens of examples of discrimination and its outcomes regarding social science, society, institutions, and individuals. The text seeks to strike a balance between confronting the damaging aspects of our culture and history and celebrating those who have driven change and overcome challenges. The core discussion of these topics are present in Chapter 11 on Race and Ethnicity, and Chapter 12 on Gender, Sex, and Sexuality, but their causes and effects are extensively discussed in the context of other topics, including education, law enforcement, government, healthcare, the economy, and so on. Together and when connected by an instructor, these elements have potential for deep and lasting effects. Changes made in Introduction to Sociology 3e are described in the preface to help instructors transition to the third edition. The second edition of Introduction to Sociology by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-36-7",
        "source": "https://openstax.org/details/books/introduction-sociology-3e"
    }
]