[
    {
        "title": "College Success",
        "publish_date": "Mar 27, 2020",
        "last_update": "Sep 20, 2023",
        "authors": [
            "Amy Baldwin, University of Central Arkansas",
            "Lisa August, Canisius College",
            "James Bennett, Herzing University",
            "Sabrina Mathues, Brookdale Community College",
            "Susan Monroe, Northern Virginia Community College",
            "MJ O’Leary, WellnessMultiplied",
            "Ann Pearson, San Jacinto College",
            "Joshua Troesh, El Camino College",
            "Margit Watts, University of Hawaii at Manoa"
        ],
        "subjects": [
            "College Success",
            "College Success"
        ],
        "image": null,
        "description": "OpenStax College Success is a comprehensive and contemporary resource that serves First Year Experience, Student Success, and College Transition courses. Developed with the support of hundreds of faculty and coordinators, the book addresses the evolving challenges and opportunities of today’s diverse students. Engagement, self-analysis, personal responsibility, and student support are reflected throughout the material. College Success also includes an array of student surveys and opinion polls, and OpenStax will regularly provide the results to adopting faculty. Based on OpenStax’s open (CC-BY) license and its wide array of formats, faculty may remix and reuse these elements according to their approach. OpenStax textbooks are always free online, and as a PDF. Robust instructor ancillaries will include lecture slides, an instructor resource manual, a test bank, and other resources.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-17-6",
        "source": "https://openstax.org/details/books/college-success"
    },
    {
        "title": "College Success Concise",
        "publish_date": "Apr 19, 2023",
        "last_update": "Sep 20, 2023",
        "authors": [
            "Amy Baldwin, University of Central Arkansas",
            "Lisa August, Canisius College",
            "James Bennett, Herzing University",
            "Larry Buland, Metropolitan Community College",
            "Jill Kaar, University of Colorado",
            "Sabrina Mathues, Brookdale Community College",
            "Susan Monroe, Northern Virginia Community College",
            "MJ O’Leary, WellnessMultiplied",
            "Ann Pearson, San Jacinto College",
            "Joshua Troesh, El Camino College",
            "Margit Watts, University of Hawaii at Manoa"
        ],
        "subjects": [
            "College Success",
            "College Success"
        ],
        "image": null,
        "description": "OpenStax College Success Concise serves First Year Experience, Student Success, and College Transition courses, and can also be used as a supplementary resource in courses across the curriculum. With the input of hundreds of instructors and academic success experts, the authors carefully prioritized the most critical topics to align to briefer courses. The offering covers material such as college culture, time management, mindset, study skills, test preparation, financial literacy, health, and planning for the future. While much of the material is very similar to the original College Success book, this version was holistically edited and updated. Users will see additions such as a new section on group work and greatly expanded coverage of stress management and wellbeing. While College Success Concise is a self-contained work with a logical flow and narrative, our open (CC-BY) license and multiple formats allow instructors and students to utilize content from the original College Success text, as well. Ancillaries such as the Instructor’s Manual, Test Bank, and Lecture Slides will specifically support College Success Concise.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-66-4",
        "source": "https://openstax.org/details/books/college-success-concise"
    },
    {
        "title": "Preparing for College Success",
        "publish_date": "Jul 12, 2023",
        "last_update": "Sep 20, 2023",
        "authors": [
            "Amy Baldwin, University of Central Arkansas",
            "Lisa August, Canisius College",
            "James Bennett, Herzing University",
            "Larry Buland, Metropolitan Community College",
            "Jill Kaar, University of Colorado",
            "Sabrina Mathues, Brookdale Community College",
            "Susan Monroe, Northern Virginia Community College",
            "MJ O’Leary, WellnessMultiplied",
            "Ann Pearson, San Jacinto College",
            "Joshua Troesh, El Camino College",
            "Margit Misangyi Watts, University of Hawai'i at Manoa",
            "Julia Byrd, Essay Coach"
        ],
        "subjects": [
            "College Success",
            "College Success"
        ],
        "image": null,
        "description": "OpenStax’s Preparing for College Success is a comprehensive resource that provides secondary students critical information to prepare for their “to and through” college journey. The book addresses the evolving challenges and opportunities of today’s diverse students. College match, preparing for transition, time management and study skills, building relationships, financial literacy, and career planning are all reflected throughout the material. Preparing for College Success also includes an array of student-centered features including scenarios and advice from current college students that can support robust classroom conversation or individual learning. Based on OpenStax’s open (CC-BY) license and its wide array of formats, educators may remix and reuse these elements according to their approach. OpenStax textbooks are always free online and as a PDF. Robust instructor ancillaries will include lecture slides, an instructor resource manual, a test bank, and other resources.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-11-2",
        "source": "https://openstax.org/details/books/preparing-for-college-success"
    }
]