[
    {
        "title": "Algebra and Trigonometry 2e",
        "publish_date": "Dec 21, 2021",
        "last_update": "Jun 28, 2024",
        "authors": [
            "Jay Abramson, Arizona State University",
            "Valeree Falduto, Palm Beach State College",
            "Rachael Gross, Towson University",
            "David Lippman, Pierce College",
            "Melonie Rasmussen, Pierce College",
            "Rick Norwood, East Tennessee State University",
            "Nicholas Belloit, Florida State College at Jacksonville",
            "Harold Whipple, Formerly of Columbia College",
            "Jean-Marie Magnier, Springfield Technical Community College",
            "Christina Fernandez"
        ],
        "subjects": [
            "Math",
            "Algebra and Trigonometry"
        ],
        "image": null,
        "description": "Algebra and Trigonometry 2e provides a comprehensive exploration of mathematical principles and meets scope and sequence requirements for a typical introductory algebra and trigonometry course. The modular approach and the richness of content ensure that the book addresses the needs of a variety of courses. Algebra and Trigonometry 2e offers a wealth of examples with detailed, conceptual explanations, building a strong foundation in the material before asking students to apply what they’ve learned. The Algebra and Trigonometry 2e revision focused on improving relevance and representation as well as mathematical clarity and accuracy. Introductory narratives, examples, and problems were reviewed and revised using a diversity, equity, and inclusion framework. Many contexts, scenarios, and images have been changed to become even more relevant to students’ lives and interests. To maintain our commitment to accuracy and precision, examples, exercises, and solutions were reviewed by multiple faculty experts. All improvement suggestions and errata updates from the first edition were considered and unified across the different formats of the text. The first edition of Algebra and Trigonometry by OpenStax is available in web view here. If you have encountered a white screen while accessing your OpenStax textbook, our developers suggest closing all of your OpenStax.org tabs and then loading the book again.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-40-4",
        "source": "https://openstax.org/details/books/algebra-and-trigonometry-2e"
    },
    {
        "title": "Calculus Volume 1",
        "publish_date": "Mar 30, 2016",
        "last_update": "Jul 25, 2024",
        "authors": [
            "Gilbert Strang, Massachusetts Institute of Technology",
            "Edwin “Jed” Herman, University of Wisconsin-Stevens Point",
            "Joseph Lakey, New Mexico State University",
            "Elaine A. Terry, Saint Joseph’s University",
            "Alfred K. Mulzet, Florida State College at Jacksonville",
            "Sheri J. Boyd, Rollins College",
            "Joyati Debnath, Winona State University",
            "Michelle Merriweather, Bronxville High School",
            "David Smith, University of the Virgin Islands",
            "Nicoleta Virginia Bila, Fayetteville State University",
            "Valeree Falduto, Palm Beach State College",
            "Kirsten R. Messer, Colorado State University-Pueblo",
            "William Radulovich, Formerly at Florida State College at Jacksonville",
            "Erica M. Rutter, Arizona State University",
            "David Torain, Hampton University",
            "Catherine Abbott, Keuka College",
            "Julie Levandosky, Framingham State University",
            "David McCune, William Jewell College"
        ],
        "subjects": [
            "Math",
            "Calculus"
        ],
        "image": null,
        "description": "Calculus is designed for the typical two- or three-semester general calculus course, incorporating innovative features to enhance student learning. The book guides students through the core concepts of calculus and helps them understand how those concepts apply to their lives and the world around them. Due to the comprehensive nature of the material, we are offering the book in three volumes for flexibility and efficiency. Volume 1 covers functions, limits, derivatives, and integration. Please note that this title is published under a CC BY-NC-SA 4.0 license, which means that you are free to use and adapt, but not for commercial purposes. Changes you make need to be shared using this license.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-947172-13-5",
        "source": "https://openstax.org/details/books/calculus-volume-1"
    },
    {
        "title": "Calculus Volume 2",
        "publish_date": "Mar 30, 2016",
        "last_update": "Jul 25, 2024",
        "authors": [
            "Gilbert Strang, Massachusetts Institute of Technology",
            "Edwin “Jed” Herman, University of Wisconsin-Stevens Point",
            "William Radulovich, Formerly at Florida State College at Jacksonville",
            "Erica M. Rutter, Arizona State University",
            "David Smith, University of the Virgin Islands",
            "Kirsten R. Messer, Colorado State University-Pueblo",
            "Alfred K. Mulzet, Florida State College at Jacksonville",
            "Nicoleta Virginia Bila, Fayetteville State University",
            "Sheri J. Boyd, Rollins College",
            "Joyati Debnath, Winona State University",
            "Valeree Falduto, Palm Beach State College",
            "Elaine A. Terry, Saint Joseph’s University",
            "David Torain, Hampton University",
            "Michelle Merriweather, Bronxville High School",
            "Catherine Abbott, Keuka College",
            "Joseph Lakey, New Mexico State University",
            "Julie Levandosky, Framingham State University",
            "David McCune, William Jewell College"
        ],
        "subjects": [
            "Math",
            "Calculus"
        ],
        "image": null,
        "description": "Calculus is designed for the typical two- or three-semester general calculus course, incorporating innovative features to enhance student learning. The book guides students through the core concepts of calculus and helps them understand how those concepts apply to their lives and the world around them. Due to the comprehensive nature of the material, we are offering the book in three volumes for flexibility and efficiency. Volume 2 covers integration, differential equations, sequences and series, and parametric equations and polar coordinates. Please note that this title is published under a CC BY-NC-SA 4.0 license, which means that you are free to use and adapt, but not for commercial purposes. Changes you make need to be shared using this license.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-947172-14-2",
        "source": "https://openstax.org/details/books/calculus-volume-2"
    },
    {
        "title": "Calculus Volume 3",
        "publish_date": "Mar 30, 2016",
        "last_update": "Jul 25, 2024",
        "authors": [
            "Gilbert Strang, Massachusetts Institute of Technology",
            "Edwin “Jed” Herman, University of Wisconsin-Stevens Point",
            "Nicoleta Virginia Bila, Fayetteville State University",
            "Sheri J. Boyd, Rollins College",
            "David Smith, University of the Virgin Islands",
            "Elaine A. Terry, Saint Joseph’s University",
            "David Torain, Hampton University",
            "Kirsten R. Messer, Colorado State University-Pueblo",
            "Alfred K. Mulzet, Florida State College at Jacksonville",
            "William Radulovich, Formerly at Florida State College at Jacksonville",
            "Erica M. Rutter, Arizona State University",
            "David McCune, William Jewell College",
            "Michelle Merriweather, Bronxville High School",
            "Joseph Lakey, New Mexico State University",
            "Julie Levandosky, Framingham State University",
            "Valeree Falduto, Palm Beach State College",
            "Catherine Abbott, Keuka College",
            "Joyati Debnath, Winona State University"
        ],
        "subjects": [
            "Math",
            "Calculus"
        ],
        "image": null,
        "description": "Calculus is designed for the typical two- or three-semester general calculus course, incorporating innovative features to enhance student learning. The book guides students through the core concepts of calculus and helps them understand how those concepts apply to their lives and the world around them. Due to the comprehensive nature of the material, we are offering the book in three volumes for flexibility and efficiency. Volume 3 covers parametric equations and polar coordinates, vectors, functions of several variables, multiple integration, and second-order differential equations. Please note that this title is published under a CC BY-NC-SA 4.0 license, which means that you are free to use and adapt, but not for commercial purposes. Changes you make need to be shared using this license.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-947172-16-6",
        "source": "https://openstax.org/details/books/calculus-volume-3"
    },
    {
        "title": "College Algebra 2e",
        "publish_date": "Dec 21, 2021",
        "last_update": "Jun 28, 2024",
        "authors": [
            "Jay Abramson, Arizona State University",
            "Valeree Falduto, Palm Beach State College",
            "Rachael Gross, Towson University",
            "David Lippman, Pierce College",
            "Melonie Rasmussen, Pierce College",
            "Rick Norwood, East Tennessee State University",
            "Nicholas Belloit, Florida State College at Jacksonville",
            "Harold Whipple, Formerly of Columbia College",
            "Jean-Marie Magnier, Springfield Technical Community College",
            "Christina Fernandez"
        ],
        "subjects": [
            "Math",
            "College Algebra"
        ],
        "image": null,
        "description": "College Algebra 2e provides a comprehensive exploration of algebraic principles and meets scope and sequence requirements for a typical introductory algebra course. The modular approach and richness of content ensure that the book addresses the needs of a variety of courses. College Algebra 2e offers a wealth of examples with detailed, conceptual explanations, building a strong foundation in the material before asking students to apply what they’ve learned. The College Algebra 2e revision focused on improving relevance and representation as well as mathematical clarity and accuracy. Introductory narratives, examples, and problems were reviewed and revised using a diversity, equity, and inclusion framework. Many contexts, scenarios, and images have been changed to become even more relevant to students’ lives and interests. To maintain our commitment to accuracy and precision, examples, exercises, and solutions were reviewed by multiple faculty experts. All improvement suggestions and errata updates from the first edition were considered and unified across the different formats of the text. The first edition of College Algebra by OpenStax is available in web view here. If you have encountered a white screen while accessing your OpenStax textbook, our developers suggest closing all of your OpenStax.org tabs and then loading the book again.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-41-1",
        "source": "https://openstax.org/details/books/college-algebra-2e"
    },
    {
        "title": "College Algebra 2e with Corequisite Support",
        "publish_date": "Dec 21, 2021",
        "last_update": "Jun 28, 2024",
        "authors": [
            "Jay Abramson, Arizona State University",
            "Sharon North, St. Louis Community College"
        ],
        "subjects": [
            "Math",
            "College Algebra"
        ],
        "image": null,
        "description": "College Algebra 2e with Corequisite Support integrates comprehensive algebraic principles with effective foundational review. Each textbook section is paired with a thoughtfully developed, topically aligned skills module that prepares students for the course material. The modules include conceptual overviews, worked examples, and guided practice; they incorporate relevant material from OpenStax’s Developmental Math series. To offer the most flexibility as possible, the material within College Algebra 2e with Corequisite Support will be available in several formats. The skills modules can be downloaded and/or printed for use in classes, workshops, or tutoring sessions, and will be provided as both Word and PDF files. The College Algebra 2e with Corequisite Support revision focused on improving relevance and representation as well as mathematical clarity and accuracy. Introductory narratives, examples, and problems were reviewed and revised using a diversity, equity, and inclusion framework. Many contexts, scenarios, and images have been changed to become even more relevant to students’ lives and interests. To maintain our commitment to accuracy and precision, examples, exercises, and solutions were reviewed by multiple faculty experts. All improvement suggestions and errata updates from the first edition were considered and unified across the different formats of the text. The first edition of College Algebra with Corequisite Support by OpenStax is available in web view here. If you have encountered a white screen while accessing your OpenStax textbook, our developers suggest closing all of your OpenStax.org tabs and then loading the book again.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-46-6",
        "source": "https://openstax.org/details/books/college-algebra-corequisite-support-2e"
    },
    {
        "title": "Contemporary Mathematics",
        "publish_date": "Mar 22, 2023",
        "last_update": "Jul 25, 2024",
        "authors": [
            "Donna Kirk, University of Wisconsin at Superior",
            "Barbara Boschmans, Northern Arizona University",
            "Brian Beaudrie, Northern Arizona University",
            "Matthew Cathey, Wofford College",
            "Valeree Falduto, Palm Beach State College",
            "Maureen Gerlofs, Texas State University",
            "Quin Hearn, Broward College",
            "Ian Walters, D’Youville College"
        ],
        "subjects": [
            "Math",
            "Contemporary Math"
        ],
        "image": null,
        "description": "Contemporary Mathematics is designed to meet the scope and sequence requirements for a liberal arts mathematics course. This resource provides stand-alone sections with a focus on showing relevance in the features as well as the examples, exercises, and exposition. Contemporary Mathematics integrates technology applications, projects, and highlights a diverse group of contributors to mathematics, statistics, and related fields.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-68-8",
        "source": "https://openstax.org/details/books/contemporary-mathematics"
    },
    {
        "title": "Elementary Algebra 2e",
        "publish_date": "Apr 22, 2020",
        "last_update": "Jul 24, 2024",
        "authors": [
            "Lynn Marecek, Santa Ana College",
            "MaryAnne Anthony-Smith, Formerly of Santa Ana College",
            "Andrea Honeycutt Mathis, Northeast Mississippi Community College"
        ],
        "subjects": [
            "Math",
            "Developmental Math"
        ],
        "image": null,
        "description": "Elementary Algebra 2e is designed to meet scope and sequence requirements for a one-semester elementary algebra course. The book’s organization makes it easy to adapt to a variety of course syllabi. The text expands on the fundamental concepts of algebra while addressing the needs of students with diverse backgrounds and learning styles. Each topic builds upon previously developed material to demonstrate the cohesiveness and structure of mathematics. The second edition contains detailed updates and accuracy revisions to address comments and suggestions from users. Dozens of faculty experts worked through the text, exercises and problems, graphics, and solutions to identify areas needing improvement. Though the authors made significant changes and enhancements, exercise and problem numbers remain nearly the same in order to ensure a smooth transition for faculty. The first edition of Elementary Algebra by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-20-6",
        "source": "https://openstax.org/details/books/elementary-algebra-2e"
    },
    {
        "title": "Intermediate Algebra 2e",
        "publish_date": "May 06, 2020",
        "last_update": "Jul 24, 2024",
        "authors": [
            "Lynn Marecek, Santa Ana College",
            "Andrea Honeycutt Mathis, Northeast Mississippi Community College"
        ],
        "subjects": [
            "Math",
            "Developmental Math"
        ],
        "image": null,
        "description": "Intermediate Algebra 2e is designed to meet the scope and sequence requirements of a one-semester intermediate algebra course. The book’s organization makes it easy to adapt to a variety of course syllabi. The text expands on the fundamental concepts of algebra while addressing the needs of students with diverse backgrounds and learning styles. The material is presented as a sequence of clear steps, building on concepts presented in prealgebra and elementary algebra courses. The second edition contains detailed updates and accuracy revisions to address comments and suggestions from users. Dozens of faculty experts worked through the text, exercises and problems, graphics, and solutions to identify areas needing improvement. Though the authors made significant changes and enhancements, exercise and problem numbers remain nearly the same in order to ensure a smooth transition for faculty. The first edition of Intermediate Algebra by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-24-4",
        "source": "https://openstax.org/details/books/intermediate-algebra-2e"
    },
    {
        "title": "Prealgebra 2e",
        "publish_date": "Mar 11, 2020",
        "last_update": "Jul 24, 2024",
        "authors": [
            "Lynn Marecek, Santa Ana College",
            "MaryAnne Anthony-Smith, Formerly of Santa Ana College",
            "Andrea Honeycutt Mathis, Northeast Mississippi Community College"
        ],
        "subjects": [
            "Math",
            "Developmental Math"
        ],
        "image": null,
        "description": "Prealgebra 2e is designed to meet scope and sequence requirements for a one-semester prealgebra or basic math course. The book’s organization makes it easy to adapt to a variety of course syllabi. The text introduces the fundamental concepts of algebra while addressing the needs of students with diverse backgrounds and learning styles. Each topic builds upon previously developed material to demonstrate the cohesiveness and structure of mathematics. The second edition contains detailed updates and accuracy revisions to address comments and suggestions from users. Dozens of faculty experts worked through the text, exercises and problems, graphics, and solutions to identify areas needing improvement. Though the authors made significant changes and enhancements, exercise and problem numbers remain nearly the same in order to ensure a smooth transition for faculty. The first edition of Prealgebra by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-19-0",
        "source": "https://openstax.org/details/books/prealgebra-2e"
    },
    {
        "title": "Precalculus 2e",
        "publish_date": "Dec 21, 2021",
        "last_update": "Jun 28, 2024",
        "authors": [
            "Jay Abramson, Arizona State University",
            "Valeree Falduto, Palm Beach State College",
            "Rachael Gross, Towson University",
            "David Lippman, Pierce College",
            "Melonie Rasmussen, Pierce College",
            "Rick Norwood, East Tennessee State University",
            "Nicholas Belloit, Florida State College at Jacksonville",
            "Harold Whipple, Formerly of Columbia College",
            "Jean-Marie Magnier, Springfield Technical Community College",
            "Christina Fernandez"
        ],
        "subjects": [
            "Math",
            "Precalculus"
        ],
        "image": null,
        "description": "Precalculus 2e provides a comprehensive exploration of mathematical principles and meets scope and sequence requirements for a typical precalculus course. The text proceeds from functions through trigonometry and ends with an introduction to calculus. The modular approach and the richness of content ensure that the book addresses the needs of a variety of courses. Precalculus 2e offers a wealth of examples with detailed, conceptual explanations, building a strong foundation in the material before asking students to apply what they’ve learned. The Precalculus 2e revision focused on improving relevance and representation as well as mathematical clarity and accuracy. Introductory narratives, examples, and problems were reviewed and revised using a diversity, equity, and inclusion framework. Many contexts, scenarios, and images have been changed to become even more relevant to students’ lives and interests. To maintain our commitment to accuracy and precision, examples, exercises, and solutions were reviewed by multiple faculty experts. All improvement suggestions and errata updates from the first edition were considered and unified across the different formats of the text. The first edition of Precalculus by OpenStax is available in web view here. If you have encountered a white screen while accessing your OpenStax textbook, our developers suggest closing all of your OpenStax.org tabs and then loading the book again.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-39-8",
        "source": "https://openstax.org/details/books/precalculus-2e"
    },
    {
        "title": "Introductory Business Statistics 2e",
        "publish_date": "Dec 13, 2023",
        "last_update": "Jul 18, 2024",
        "authors": [
            "Alexander Holmes, The University of Oklahoma",
            "Barbara Illowsky, De Anza College",
            "Susan Dean, De Anza College",
            "Kevin Hadley, Federal Reserve Bank of Kansas City"
        ],
        "subjects": [
            "Math",
            "Statistics"
        ],
        "image": null,
        "description": "Introductory Business Statistics 2e aligns with the topics and objectives of the typical one-semester statistics course for business, economics, and related majors. The text provides detailed and supportive explanations and extensive step-by-step walkthroughs. The author places a significant emphasis on the development and practical application of formulas so that students have a deeper understanding of their interpretation and application of data. Problems and exercises are largely centered on business topics, though other applications are provided in order to increase relevance and showcase the critical role of statistics in a number of fields and real-world contexts. The second edition retains the organization of the original text. Based on extensive feedback from adopters and students, the revision focused on improving currency and relevance, particularly in examples and problems. A detailed transition guide is available for instructors. The first edition of Introductory Business Statistics by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-33-4",
        "source": "https://openstax.org/details/books/introductory-business-statistics-2e"
    },
    {
        "title": "Introductory Statistics 2e",
        "publish_date": "Dec 13, 2023",
        "last_update": "Jul 18, 2024",
        "authors": [
            "Barbara Illowsky, De Anza College",
            "Susan Dean, De Anza College",
            "Daniel Birmajer, Nazareth College",
            "Bryan Blount, Kentucky Wesleyan College",
            "Sheri Boyd, Rollins College",
            "Matthew Einsohn, Prescott College",
            "James Helmreich, Marist College",
            "Lynette Kenyon, Collin County Community College",
            "Sheldon Lee, Viterbo University",
            "Jeff Taub, Maine Maritime Academy"
        ],
        "subjects": [
            "Math",
            "Statistics"
        ],
        "image": null,
        "description": "Introductory Statistics 2e provides an engaging, practical, and thorough overview of the core concepts and skills taught in most one-semester statistics courses. The text focuses on diverse applications from a variety of fields and societal contexts, including business, healthcare, sciences, sociology, political science, computing, and several others. The material supports students with conceptual narratives, detailed step-by-step examples, and a wealth of illustrations, as well as collaborative exercises, technology integration problems, and statistics labs. The text assumes some knowledge of intermediate algebra, and includes thousands of problems and exercises that offer instructors and students ample opportunity to explore and reinforce useful statistical skills. The first edition of Introductory Statistics by OpenStax is available in web view here.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-961584-32-7",
        "source": "https://openstax.org/details/books/introductory-statistics-2e"
    },
    {
        "title": "Statistics",
        "publish_date": "Mar 27, 2020",
        "last_update": "Apr 16, 2024",
        "authors": [
            "Barbara Illowsky, De Anza College",
            "Susan Dean, De Anza College",
            "Daniel Birmajer, Nazareth College",
            "Bryan Blount, Kentucky Wesleyan College",
            "Sheri Boyd, Rollins College",
            "Matthew Einsohn, Prescott College",
            "James Helmreich, Marist College",
            "Lynette Kenyon, Collin County Community College",
            "Sheldon Lee, Viterbo University",
            "Jeff Taub, Maine Maritime Academy"
        ],
        "subjects": [
            "Math",
            "Statistics"
        ],
        "image": null,
        "description": "This Statistics resource was developed under the guidance and support of experienced high school teachers and subject matter experts. It is presented here in multiple formats: PDF, online, and low-cost print. Statistics offers instruction in grade-level appropriate concepts and skills in a logical, engaging progression that begins with sampling and data and covers topics such as probability, random variables, the normal distribution, and hypothesis testing. This content was developed with students in mind, incorporating statistics labs, worked exercises, and additional opportunities for assessment that incorporate real-world statistical applications. For instructors, resources are available to support the implementation of the Statistics textbook, including a Getting Started Guide, direct instruction presentations, and a solutions manual.",
        "publisher": "OpenStax",
        "language": "English",
        "isbn13": "978-1-951693-22-0",
        "source": "https://openstax.org/details/books/statistics"
    }
]